wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/*!
    \file    gd32g5x3_hrtimer.h
    \brief   definitions for the HRTIMER

    \version 2026-02-04, V1.5.0, firmware for GD32G5x3
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32G5X3_HRTIMER_H
#define GD32G5X3_HRTIMER_H

#include "gd32g5x3.h"

/* HRTIMERy(y=0) definitions */
#define HRTIMER0                                      (HRTIMER_BASE + 0x00000000U)

/* registers definitions */
/* Master_TIMER registers definitions */
#define HRTIMER_MTCTL0(hrtimery)                     REG32((hrtimery) + 0x00000000U)                                              /*!< HRTIMER Master_TIMER control register 0 */
#define HRTIMER_MTINTF(hrtimery)                     REG32((hrtimery) + 0x00000004U)                                              /*!< HRTIMER Master_TIMER interrupt flag register */
#define HRTIMER_MTINTC(hrtimery)                     REG32((hrtimery) + 0x00000008U)                                              /*!< HRTIMER Master_TIMER interrupt flag clear register */
#define HRTIMER_MTDMAINTEN(hrtimery)                 REG32((hrtimery) + 0x0000000CU)                                              /*!< HRTIMER Master_TIMER DMA and interrupt enable register */
#define HRTIMER_MTCNT(hrtimery)                      REG32((hrtimery) + 0x00000010U)                                              /*!< HRTIMER Master_TIMER counter register */
#define HRTIMER_MTCAR(hrtimery)                      REG32((hrtimery) + 0x00000014U)                                              /*!< HRTIMER Master_TIMER counter auto reload register */
#define HRTIMER_MTCREP(hrtimery)                     REG32((hrtimery) + 0x00000018U)                                              /*!< HRTIMER Master_TIMER counter repetition register */
#define HRTIMER_MTCMP0V(hrtimery)                    REG32((hrtimery) + 0x0000001CU)                                              /*!< HRTIMER Master_TIMER compare 0 value register */
#define HRTIMER_MTCMP1V(hrtimery)                    REG32((hrtimery) + 0x00000024U)                                              /*!< HRTIMER Master_TIMER compare 1 value register */
#define HRTIMER_MTCMP2V(hrtimery)                    REG32((hrtimery) + 0x00000028U)                                              /*!< HRTIMER Master_TIMER compare 2 value register */
#define HRTIMER_MTCMP3V(hrtimery)                    REG32((hrtimery) + 0x0000002CU)                                              /*!< HRTIMER Master_TIMER compare 3 value register */

/* Slave_TIMERx(x=0..7) registers definitions */
#define HRTIMER_STXCTL0(hrtimery, slavex)            REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000000U)           /*!< HRTIMER Slave_TIMERx control register 0 */
#define HRTIMER_STXINTF(hrtimery, slavex)            REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000004U)           /*!< HRTIMER Slave_TIMERx interrupt flag register */
#define HRTIMER_STXINTC(hrtimery, slavex)            REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000008U)           /*!< HRTIMER Slave_TIMERx interrupt flag clear register */
#define HRTIMER_STXDMAINTEN(hrtimery, slavex)        REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000000CU)           /*!< HRTIMER Slave_TIMERx DMA and interrupt enable register */
#define HRTIMER_STXCNT(hrtimery, slavex)             REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000010U)           /*!< HRTIMER Slave_TIMERx counter register */
#define HRTIMER_STXCAR(hrtimery, slavex)             REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000014U)           /*!< HRTIMER Slave_TIMERx counter auto reload register */
#define HRTIMER_STXCREP(hrtimery, slavex)            REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000018U)           /*!< HRTIMER Slave_TIMERx counter repetition register */
#define HRTIMER_STXCMP0V(hrtimery, slavex)           REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000001CU)           /*!< HRTIMER Slave_TIMERx compare 0 value register */
#define HRTIMER_STXCMP0CP(hrtimery, slavex)          REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000020U)           /*!< HRTIMER Slave_TIMERx compare 0 composite register */
#define HRTIMER_STXCMP1V(hrtimery, slavex)           REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000024U)           /*!< HRTIMER Slave_TIMERx compare 1 value register */
#define HRTIMER_STXCMP2V(hrtimery, slavex)           REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000028U)           /*!< HRTIMER Slave_TIMERx compare 2 value register */
#define HRTIMER_STXCMP3V(hrtimery, slavex)           REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000002CU)           /*!< HRTIMER Slave_TIMERx compare 3 value register */
#define HRTIMER_STXCAP0V(hrtimery, slavex)           REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000030U)           /*!< HRTIMER Slave_TIMERx capture 0 value register */
#define HRTIMER_STXCAP1V(hrtimery, slavex)           REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000034U)           /*!< HRTIMER Slave_TIMERx capture 1 value register */
#define HRTIMER_STXDTCTL(hrtimery, slavex)           REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000038U)           /*!< HRTIMER Slave_TIMERx dead-time control register */
#define HRTIMER_STXCH0SET(hrtimery, slavex)          REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000003CU)           /*!< HRTIMER Slave_TIMERx channel 0 set request register */
#define HRTIMER_STXCH0RST(hrtimery, slavex)          REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000040U)           /*!< HRTIMER Slave_TIMERx channel 0 reset request register */
#define HRTIMER_STXCH1SET(hrtimery, slavex)          REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000044U)           /*!< HRTIMER Slave_TIMERx channel 1 set request register */
#define HRTIMER_STXCH1RST(hrtimery, slavex)          REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000048U)           /*!< HRTIMER Slave_TIMERx channel 1 reset request register */
#define HRTIMER_STXEXEVFCFG0(hrtimery, slavex)       REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000004CU)           /*!< HRTIMER Slave_TIMERx external event filter configuration register 0 */
#define HRTIMER_STXEXEVFCFG1(hrtimery, slavex)       REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000050U)           /*!< HRTIMER Slave_TIMERx external event filter configuration register 1 */
#define HRTIMER_STXCNTRST(hrtimery, slavex)          REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000054U)           /*!< HRTIMER Slave_TIMERx counter reset register */ 
#define HRTIMER_STXCSCTL(hrtimery, slavex)           REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000058U)           /*!< HRTIMER Slave_TIMERx carrier-signal control register */
#define HRTIMER_STXCAP0TRG(hrtimery, slavex)         REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000005CU)           /*!< HRTIMER Slave_TIMERx capture 0 trigger register */
#define HRTIMER_STXCAP1TRG(hrtimery, slavex)         REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000060U)           /*!< HRTIMER Slave_TIMERx capture 1 trigger register */
#define HRTIMER_STXCHOCTL(hrtimery, slavex)          REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000064U)           /*!< HRTIMER Slave_TIMERx channel output control register */
#define HRTIMER_STXFLTCTL(hrtimery, slavex)          REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000068U)           /*!< HRTIMER Slave_TIMERx fault control register */
#define HRTIMER_STXCTL1(hrtimery, slavex)            REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000006CU)           /*!< HRTIMER Slave_TIMERx control register 1 */
#define HRTIMER_STXEXEVFCFG2(hrtimery, slavex)       REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000070U)           /*!< HRTIMER Slave_TIMERx external event filter configuration register 2 */
#define HRTIMER_STXCAPTRGCOM(hrtimery, slavex)       REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000074U)           /*!< HRTIMER Slave_TIMERx capture trigger combination register */
#define HRTIMER_STXCNTRSTA(hrtimery, slavex)         REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000078U)           /*!< HRTIMER Slave_TIMERx counter reset and channel 0/1 set/reset request add register */
#define HRTIMER_STXACTL(hrtimery, slavex)            REG32((hrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000007CU)           /*!< HRTIMER Slave_TIMERx additional control register */

