wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* common registers definitions */
#define HRTIMER_CTL0(hrtimery)                       REG32(((hrtimery) + 0x00000380U) + 0x00000000U)                              /*!< HRTIMER control register 0 */
#define HRTIMER_CTL1(hrtimery)                       REG32(((hrtimery) + 0x00000380U) + 0x00000004U)                              /*!< HRTIMER control register 1 */
#define HRTIMER_INTF(hrtimery)                       REG32(((hrtimery) + 0x00000380U) + 0x00000008U)                              /*!< HRTIMER interrupt flag register */
#define HRTIMER_INTC(hrtimery)                       REG32(((hrtimery) + 0x00000380U) + 0x0000000CU)                              /*!< HRTIMER interrupt flag clear register */
#define HRTIMER_INTEN(hrtimery)                      REG32(((hrtimery) + 0x00000380U) + 0x00000010U)                              /*!< HRTIMER interrupt enable register */
#define HRTIMER_CHOUTEN(hrtimery)                    REG32(((hrtimery) + 0x00000380U) + 0x00000014U)                              /*!< HRTIMER channel output enable register */
#define HRTIMER_CHOUTDIS(hrtimery)                   REG32(((hrtimery) + 0x00000380U) + 0x00000018U)                              /*!< HRTIMER channel output disable register */
#define HRTIMER_CHOUTDISF(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x0000001CU)                              /*!< HRTIMER channel output disable flag register */
#define HRTIMER_BMCTL(hrtimery)                      REG32(((hrtimery) + 0x00000380U) + 0x00000020U)                              /*!< HRTIMER bunch mode control register */
#define HRTIMER_BMSTRG(hrtimery)                     REG32(((hrtimery) + 0x00000380U) + 0x00000024U)                              /*!< HRTIMER bunch mode start trigger register */
#define HRTIMER_BMCMPV(hrtimery)                     REG32(((hrtimery) + 0x00000380U) + 0x00000028U)                              /*!< HRTIMER bunch mode compare value register */
#define HRTIMER_BMCAR(hrtimery)                      REG32(((hrtimery) + 0x00000380U) + 0x0000002CU)                              /*!< HRTIMER bunch mode counter auto reload register */
#define HRTIMER_EXEVCFG0(hrtimery)                   REG32(((hrtimery) + 0x00000380U) + 0x00000030U)                              /*!< HRTIMER external event configuration register 0 */
#define HRTIMER_EXEVCFG1(hrtimery)                   REG32(((hrtimery) + 0x00000380U) + 0x00000034U)                              /*!< HRTIMER external event configuration register 1 */
#define HRTIMER_EXEVDFCTL(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000038U)                              /*!< HRTIMER external event digital filter control register */
#define HRTIMER_ADCTRIGS0(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x0000003CU)                              /*!< HRTIMER trigger source 0 to ADC register */
#define HRTIMER_ADCTRIGS1(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000040U)                              /*!< HRTIMER trigger source 1 to ADC register */
#define HRTIMER_ADCTRIGS2(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000044U)                              /*!< HRTIMER trigger source 2 to ADC register */
#define HRTIMER_ADCTRIGS3(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000048U)                              /*!< HRTIMER trigger source 3 to ADC register */
#define HRTIMER_DLLCCTL(hrtimery)                    REG32(((hrtimery) + 0x00000380U) + 0x0000004CU)                              /*!< HRTIMER DLL calibration control register */
#define HRTIMER_FLTINCFG0(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000050U)                              /*!< HRTIMER fault input configuration register 0 */
#define HRTIMER_FLTINCFG1(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000054U)                              /*!< HRTIMER fault input configuration register 1 */
#define HRTIMER_DMAUPMTR(hrtimery)                   REG32(((hrtimery) + 0x00000380U) + 0x00000058U)                              /*!< HRTIMER DMA update Master_TIMER register */
#define HRTIMER_DMAUPST0R(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x0000005CU)                              /*!< HRTIMER DMA update Slave_TIMER0 register */
#define HRTIMER_DMAUPST1R(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000060U)                              /*!< HRTIMER DMA update Slave_TIMER1 register */
#define HRTIMER_DMAUPST2R(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000064U)                              /*!< HRTIMER DMA update Slave_TIMER2 register */
#define HRTIMER_DMAUPST3R(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000068U)                              /*!< HRTIMER DMA update Slave_TIMER3 register */
#define HRTIMER_DMAUPST4R(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x0000006CU)                              /*!< HRTIMER DMA update Slave_TIMER4 register */
#define HRTIMER_DMAUPST5R(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000074U)                              /*!< HRTIMER DMA update Slave_TIMER5 register */
#define HRTIMER_DMAUPST6R(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000100U)                              /*!< HRTIMER DMA update Slave_TIMER6 register */
#define HRTIMER_DMAUPST7R(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000104U)                              /*!< HRTIMER DMA update Slave_TIMER7 register */
#define HRTIMER_DMATB(hrtimery)                      REG32(((hrtimery) + 0x00000380U) + 0x00000070U)                              /*!< HRTIMER DMA transfer buffer register */
#define HRTIMER_ADCEXTTRG(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000078U)                              /*!< HRTIMER ADC extended trigger register */
#define HRTIMER_ADCTRGUPD(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x0000007CU)                              /*!< HRTIMER ADC trigger update register */
#define HRTIMER_ADCPSCR0(hrtimery)                   REG32(((hrtimery) + 0x00000380U) + 0x00000080U)                              /*!< HRTIMER ADC post scaler register 0 */
#define HRTIMER_ADCPSCR1(hrtimery)                   REG32(((hrtimery) + 0x00000380U) + 0x00000084U)                              /*!< HRTIMER ADC post scaler register 1 */
#define HRTIMER_FLTINCFG2(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x00000088U)                              /*!< HRTIMER fault input configuration register 2 */
#define HRTIMER_FLTINCFG3(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x0000008CU)                              /*!< HRTIMER fault input configuration register 3 */
#define HRTIMER_BMSTRGA(hrtimery)                    REG32(((hrtimery) + 0x00000380U) + 0x00000108U)                              /*!< HRTIMER bunch mode start trigger add register */
#define HRTIMER_FLTINCFG4(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x0000010CU)                              /*!< HRTIMER fault input configuration register 4 */
#define HRTIMER_ADCEXTTRGA(hrtimery)                 REG32(((hrtimery) + 0x00000380U) + 0x00000110U)                              /*!< HRTIMER ADC extended trigger add register */
#define HRTIMER_ADCTRIGS0A(hrtimery)                 REG32(((hrtimery) + 0x00000380U) + 0x00000114U)                              /*!< HRTIMER trigger source 0 to ADC add register  */
#define HRTIMER_ADCTRIGS1A(hrtimery)                 REG32(((hrtimery) + 0x00000380U) + 0x00000118U)                              /*!< HRTIMER trigger source 1 to ADC add register */
#define HRTIMER_ADCTRIGS2A(hrtimery)                 REG32(((hrtimery) + 0x00000380U) + 0x0000011CU)                              /*!< HRTIMER trigger source 2 to ADC add register */
#define HRTIMER_ADCTRIGS3A(hrtimery)                 REG32(((hrtimery) + 0x00000380U) + 0x00000120U)                              /*!< HRTIMER trigger source 3 to ADC add register */
#define HRTIMER_FLTRECCTL(hrtimery)                  REG32(((hrtimery) + 0x00000380U) + 0x0000017CU)                              /*!< HRTIMER fault recovery control register */

