wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* bits definitions */
/* Master_TIMER registers */
/* HRTIMER_MTCTL0 */
#define HRTIMER_MTCTL0_CNTCKDIV2_0                    BITS(0,2)            /*!< counter clock division */
#define HRTIMER_MTCTL0_CTNM                           BIT(3)               /*!< continuous mode */
#define HRTIMER_MTCTL0_CNTRSTM                        BIT(4)               /*!< counter reset mode */
#define HRTIMER_MTCTL0_HALFM                          BIT(5)               /*!< half mode */
#define HRTIMER_MTCTL0_ALTM                           BITS(6,7)            /*!< alternate mode */
#define HRTIMER_MTCTL0_SYNISRC                        BITS(8,9)            /*!< synchronization input source */
#define HRTIMER_MTCTL0_SYNIRST                        BIT(10)              /*!< synchronization input reset counter */
#define HRTIMER_MTCTL0_SYNISTRT                       BIT(11)              /*!< synchronization input start counter */
#define HRTIMER_MTCTL0_SYNOPLS                        BITS(12,13)          /*!< synchronization output pulse */
#define HRTIMER_MTCTL0_SYNOSRC                        BITS(14,15)          /*!< synchronization output source */
#define HRTIMER_MTCTL0_MTCEN                          BIT(16)              /*!< the counter of Master_TIMER enable */
#define HRTIMER_MTCTL0_ST0CEN                         BIT(17)              /*!< the counter of Slave_TIMER0 enable */
#define HRTIMER_MTCTL0_ST1CEN                         BIT(18)              /*!< the counter of Slave_TIMER1 enable */
#define HRTIMER_MTCTL0_ST2CEN                         BIT(19)              /*!< the counter of Slave_TIMER2 enable */
#define HRTIMER_MTCTL0_ST3CEN                         BIT(20)              /*!< the counter of Slave_TIMER3 enable */
#define HRTIMER_MTCTL0_ST4CEN                         BIT(21)              /*!< the counter of Slave_TIMER4 enable */
#define HRTIMER_MTCTL0_ST5CEN                         BIT(22)              /*!< the counter of Slave_TIMER5 enable */
#define HRTIMER_MTCTL0_ST6CEN                         BIT(23)              /*!< the counter of Slave_TIMER6 enable */
#define HRTIMER_MTCTL0_ST7CEN                         BIT(24)              /*!< the counter of Slave_TIMER7 enable */
#define HRTIMER_MTCTL0_DACTRGS                        BITS(25,26)          /*!< trigger source to DAC */
#define HRTIMER_MTCTL0_SHWEN                          BIT(27)              /*!< shadow registers enable */
#define HRTIMER_MTCTL0_UPREP                          BIT(29)              /*!< update event generated by repetition event */
#define HRTIMER_MTCTL0_UPSEL                          BITS(30,31)          /*!< update event selection */

/* HRTIMER_MTINTF */
#define HRTIMER_MTINTF_CMP0IF                         BIT(0)               /*!< compare 0 interrupt flag */
#define HRTIMER_MTINTF_CMP1IF                         BIT(1)               /*!< compare 1 interrupt flag */
#define HRTIMER_MTINTF_CMP2IF                         BIT(2)               /*!< compare 2 interrupt flag */
#define HRTIMER_MTINTF_CMP3IF                         BIT(3)               /*!< compare 3 interrupt flag */
#define HRTIMER_MTINTF_REPIF                          BIT(4)               /*!< repetition interrupt flag */
#define HRTIMER_MTINTF_SYNIIF                         BIT(5)               /*!< synchronization input interrupt flag */
#define HRTIMER_MTINTF_UPIF                           BIT(6)               /*!< update interrupt flag */

/* HRTIMER_MTINTC */
#define HRTIMER_MTINTC_CMP0IFC                        BIT(0)               /*!< clear compare 0 interrupt flag */
#define HRTIMER_MTINTC_CMP1IFC                        BIT(1)               /*!< clear compare 1 interrupt flag */
#define HRTIMER_MTINTC_CMP2IFC                        BIT(2)               /*!< clear compare 2 interrupt flag */
#define HRTIMER_MTINTC_CMP3IFC                        BIT(3)               /*!< clear compare 3 interrupt flag */
#define HRTIMER_MTINTC_REPIFC                         BIT(4)               /*!< clear repetition interrupt flag */
#define HRTIMER_MTINTC_SYNIIFC                        BIT(5)               /*!< clear synchronization input interrupt flag */
#define HRTIMER_MTINTC_UPIFC                          BIT(6)               /*!< clear update interrupt flag */

/* HRTIMER_MTDMAINTEN */
#define HRTIMER_MTDMAINTEN_CMP0IE                     BIT(0)               /*!< compare 0 interrupt enable */
#define HRTIMER_MTDMAINTEN_CMP1IE                     BIT(1)               /*!< compare 1 interrupt enable */
#define HRTIMER_MTDMAINTEN_CMP2IE                     BIT(2)               /*!< compare 2 interrupt enable */
#define HRTIMER_MTDMAINTEN_CMP3IE                     BIT(3)               /*!< compare 3 interrupt enable */
#define HRTIMER_MTDMAINTEN_REPIE                      BIT(4)               /*!< repetition interrupt enable */
#define HRTIMER_MTDMAINTEN_SYNIIE                     BIT(5)               /*!< synchronization input interrupt enable */
#define HRTIMER_MTDMAINTEN_UPIE                       BIT(6)               /*!< update interrupt enable */
#define HRTIMER_MTDMAINTEN_CMP0DEN                    BIT(16)              /*!< compare 0 DMA request enable */
#define HRTIMER_MTDMAINTEN_CMP1DEN                    BIT(17)              /*!< compare 1 DMA request enable */
#define HRTIMER_MTDMAINTEN_CMP2DEN                    BIT(18)              /*!< compare 2 DMA request enable */
#define HRTIMER_MTDMAINTEN_CMP3DEN                    BIT(19)              /*!< compare 3 DMA request enable */
#define HRTIMER_MTDMAINTEN_REPDEN                     BIT(20)              /*!< repetition DMA request enable */
#define HRTIMER_MTDMAINTEN_SYNIDEN                    BIT(21)              /*!< synchronization input DMA request enable */
#define HRTIMER_MTDMAINTEN_UPDEN                      BIT(22)              /*!< update DMA request enable */

/* HRTIMER_MTCNT */
#define HRTIMER_MTCNT_CNT                             BITS(0,15)           /*!< the current counter value */

/* HRTIMER_MTCAR */
#define HRTIMER_MTCAR_CARL                            BITS(0,15)           /*!< counter auto reload value */

/* HRTIMER_MTCREP */
#define HRTIMER_MTCREP_CREP                           BITS(0,7)            /*!< counter repetition value */

/* HRTIMER_MTCMP0V */
#define HRTIMER_MTCMP0V_CMP0VAL                       BITS(0,15)           /*!< compare 0 value */

/* HRTIMER_MTCMP1V */
#define HRTIMER_MTCMP1V_CMP1VAL                       BITS(0,15)           /*!< compare 1 value */

/* HRTIMER_MTCMP2V */
#define HRTIMER_MTCMP2V_CMP2VAL                       BITS(0,15)           /*!< compare 2 value */

/* HRTIMER_MTCMP3V */
#define HRTIMER_MTCMP3V_CMP3VAL                       BITS(0,15)           /*!< compare 3 value */

/* Slave_TIMERx registers(x=0..7) */
/* HRTIMER_STxCTL0 */
#define HRTIMER_STXCTL0_CNTCKDIV2_0                   BITS(0,2)            /*!< counter clock division */
#define HRTIMER_STXCTL0_CTNM                          BIT(3)               /*!< continuous mode */
#define HRTIMER_STXCTL0_CNTRSTM                       BIT(4)               /*!< counter reset mode */
#define HRTIMER_STXCTL0_HALFM                         BIT(5)               /*!< half mode */
#define HRTIMER_STXCTL0_BLNMEN                        BIT(6)               /*!< balanced mode enable */
#define HRTIMER_STXCTL0_ALTM                          BITS(7,8)            /*!< alternate mode enable */
#define HRTIMER_STXCTL0_RSYNUPD                       BIT(9)               /*!< re-synchronized update */
#define HRTIMER_STXCTL0_SYNIRST                       BIT(10)              /*!< synchronization input reset counter */
#define HRTIMER_STXCTL0_SYNISTRT                      BIT(11)              /*!< synchronization input start counter */
#define HRTIMER_STXCTL0_DELCMP1M                      BITS(12,13)          /*!< compare 1 delayed mode */
#define HRTIMER_STXCTL0_DELCMP3M                      BITS(14,15)          /*!< compare 3 delayed mode */
#define HRTIMER_STXCTL0_UPBST5                        BIT(16)              /*!< update by Slave_TIMER5 update event */
#define HRTIMER_STXCTL0_UPREP                         BIT(17)              /*!< update event generated by repetition event */
#define HRTIMER_STXCTL0_UPRST                         BIT(18)              /*!< update event generated by reset event */
#define HRTIMER_STXCTL0_UPBST0                        BIT(19)              /*!< update by Slave_TIMER0 update event */
#define HRTIMER_STXCTL0_UPBST1                        BIT(20)              /*!< update by Slave_TIMER1 update event */
#define HRTIMER_STXCTL0_UPBST2                        BIT(21)              /*!< update by Slave_TIMER2 update event */
#define HRTIMER_STXCTL0_UPBST3                        BIT(22)              /*!< update by Slave_TIMER3 update event */
#define HRTIMER_STXCTL0_UPBST4                        BIT(23)              /*!< update by Slave_TIMER4 update event */
#define HRTIMER_STXCTL0_UPBMT                         BIT(24)              /*!< update by Master_TIMER update event */
#define HRTIMER_STXCTL0_DACTRGS                       BITS(25,26)          /*!< trigger source to DAC */
#define HRTIMER_STXCTL0_SHWEN                         BIT(27)              /*!< shadow registers enable */
#define HRTIMER_STXCTL0_UPSEL                         BITS(28,31)          /*!< update event selection */

/* HRTIMER_STxINTF */
#define HRTIMER_STXINTF_CMP0IF                        BIT(0)               /*!< compare 0 interrupt flag */
#define HRTIMER_STXINTF_CMP1IF                        BIT(1)               /*!< compare 1 interrupt flag */
#define HRTIMER_STXINTF_CMP2IF                        BIT(2)               /*!< compare 2 interrupt flag */
#define HRTIMER_STXINTF_CMP3IF                        BIT(3)               /*!< compare 3 interrupt flag */
#define HRTIMER_STXINTF_REPIF                         BIT(4)               /*!< repetition interrupt flag */
#define HRTIMER_STXINTF_UPIF                          BIT(6)               /*!< update interrupt flag */
#define HRTIMER_STXINTF_CAP0IF                        BIT(7)               /*!< capture 0 interrupt flag */
#define HRTIMER_STXINTF_CAP1IF                        BIT(8)               /*!< capture 1 interrupt flag */
#define HRTIMER_STXINTF_CH0OAIF                       BIT(9)               /*!< channel 0 output active interrupt flag */
#define HRTIMER_STXINTF_CH0ONAIF                      BIT(10)              /*!< channel 0 output inactive interrupt flag */
#define HRTIMER_STXINTF_CH1OAIF                       BIT(11)              /*!< channel 1 output active interrupt flag */
#define HRTIMER_STXINTF_CH1ONAIF                      BIT(12)              /*!< channel 1 output inactive interrupt flag */
#define HRTIMER_STXINTF_RSTIF                         BIT(13)              /*!< counter reset interrupt flag */
#define HRTIMER_STXINTF_DLYIIF                        BIT(14)              /*!< delayed IDLE mode entry interrupt flag */
#define HRTIMER_STXINTF_CBLNF                         BIT(16)              /*!< current balanced flag */
#define HRTIMER_STXINTF_BLNIF                         BIT(17)              /*!< balanced IDLE flag */
#define HRTIMER_STXINTF_CH0SF                         BIT(18)              /*!< channel 0 output state flag */
#define HRTIMER_STXINTF_CH1SF                         BIT(19)              /*!< channel 1 output state flag */
#define HRTIMER_STXINTF_CH0F                          BIT(20)              /*!< channel 0 output flag */
#define HRTIMER_STXINTF_CH1F                          BIT(21)              /*!< channel 1 output flag */
#define HRTIMER_STXINTF_DIR                           BIT(31)              /*!< count direction */

/* HRTIMER_STxINTC */
#define HRTIMER_STXINTC_CMP0IFC                       BIT(0)               /*!< clear compare 0 interrupt flag */
#define HRTIMER_STXINTC_CMP1IFC                       BIT(1)               /*!< clear compare 1 interrupt flag */
#define HRTIMER_STXINTC_CMP2IFC                       BIT(2)               /*!< clear compare 2 interrupt flag */
#define HRTIMER_STXINTC_CMP3IFC                       BIT(3)               /*!< clear compare 3 interrupt flag */
#define HRTIMER_STXINTC_REPIFC                        BIT(4)               /*!< clear repetition interrupt flag */
#define HRTIMER_STXINTC_UPIFC                         BIT(6)               /*!< clear update interrupt flag */
#define HRTIMER_STXINTC_CAP0IFC                       BIT(7)               /*!< clear capture 0 interrupt flag */
#define HRTIMER_STXINTC_CAP1IFC                       BIT(8)               /*!< clear capture 1 interrupt flag */
#define HRTIMER_STXINTC_CH0OAIFC                      BIT(9)               /*!< clear channel 0 output active interrupt flag */
#define HRTIMER_STXINTC_CH0ONAIFC                     BIT(10)              /*!< clear channel 0 output inactive interrupt flag */
#define HRTIMER_STXINTC_CH1OAIFC                      BIT(11)              /*!< clear channel 1 output active interrupt flag */
#define HRTIMER_STXINTC_CH1ONAIFC                     BIT(12)              /*!< clear channel 1 output inactive interrupt flag */
#define HRTIMER_STXINTC_RSTIFC                        BIT(13)              /*!< clear counter reset interrupt flag */
#define HRTIMER_STXINTC_DLYIIFC                       BIT(14)              /*!< clear delayed IDLE mode entry interrupt flag */

/* HRTIMER_STxDMAINTEN */
#define HRTIMER_STXDMAINTEN_CMP0IE                    BIT(0)               /*!< compare 0 interrupt enable */
#define HRTIMER_STXDMAINTEN_CMP1IE                    BIT(1)               /*!< compare 1 interrupt enable */
#define HRTIMER_STXDMAINTEN_CMP2IE                    BIT(2)               /*!< compare 2 interrupt enable */
#define HRTIMER_STXDMAINTEN_CMP3IE                    BIT(3)               /*!< compare 3 interrupt enable */
#define HRTIMER_STXDMAINTEN_REPIE                     BIT(4)               /*!< repetition interrupt enable */
#define HRTIMER_STXDMAINTEN_UPIE                      BIT(6)               /*!< update interrupt enable */
#define HRTIMER_STXDMAINTEN_CAP0IE                    BIT(7)               /*!< capture 0 interrupt enable */
#define HRTIMER_STXDMAINTEN_CAP1IE                    BIT(8)               /*!< capture 1 interrupt enable */
#define HRTIMER_STXDMAINTEN_CH0OAIE                   BIT(9)               /*!< channel 0 output active interrupt enable */
#define HRTIMER_STXDMAINTEN_CH0ONAIE                  BIT(10)              /*!< channel 0 output inactive interrupt enable */
#define HRTIMER_STXDMAINTEN_CH1OAIE                   BIT(11)              /*!< channel 1 output active interrupt enable */
#define HRTIMER_STXDMAINTEN_CH1ONAIE                  BIT(12)              /*!< channel 1 output inactive interrupt enable */
#define HRTIMER_STXDMAINTEN_RSTIE                     BIT(13)              /*!< counter reset interrupt enable */
#define HRTIMER_STXDMAINTEN_DLYIIE                    BIT(14)              /*!< delayed IDLE mode entry interrupt enable */
#define HRTIMER_STXDMAINTEN_CMP0DEN                   BIT(16)              /*!< compare 0 DMA request enable */
#define HRTIMER_STXDMAINTEN_CMP1DEN                   BIT(17)              /*!< compare 1 DMA request enable */
#define HRTIMER_STXDMAINTEN_CMP2DEN                   BIT(18)              /*!< compare 2 DMA request enable */
#define HRTIMER_STXDMAINTEN_CMP3DEN                   BIT(19)              /*!< compare 3 DMA request enable */
#define HRTIMER_STXDMAINTEN_REPDEN                    BIT(20)              /*!< repetition DMA request enable */
#define HRTIMER_STXDMAINTEN_UPDEN                     BIT(22)              /*!< update DMA request enable */
#define HRTIMER_STXDMAINTEN_CAP0DEN                   BIT(23)              /*!< capture 0 DMA request enable */
#define HRTIMER_STXDMAINTEN_CAP1DEN                   BIT(24)              /*!< capture 1 DMA request enable */
#define HRTIMER_STXDMAINTEN_CH0OADEN                  BIT(25)              /*!< channel 0 output active DMA request enable */
#define HRTIMER_STXDMAINTEN_CH0ONADEN                 BIT(26)              /*!< channel 0 output inactive DMA request enable */
#define HRTIMER_STXDMAINTEN_CH1OADEN                  BIT(27)              /*!< channel 1 output active DMA request enable */
#define HRTIMER_STXDMAINTEN_CH1ONADEN                 BIT(28)              /*!< channel 1 output inactive DMA request enable */
#define HRTIMER_STXDMAINTEN_RSTDEN                    BIT(29)              /*!< counter reset DMA request enable */
#define HRTIMER_STXDMAINTEN_DLYIDEN                   BIT(30)              /*!< delayed IDLE mode entry DMA request enable */

/* HRTIMER_STxCNT */
#define HRTIMER_STXCNT_CNT                            BITS(0,15)           /*!< the current counter value */

/* HRTIMER_STxCAR */
#define HRTIMER_STXCAR_CARL                           BITS(0,15)           /*!< counter auto reload value */

/* HRTIMER_STxCREP */
#define HRTIMER_STXCREP_CREP                          BITS(0,7)            /*!< counter repetition value */

/* HRTIMER_STxCMP0V */
#define HRTIMER_STXCMP0V_CMP0VAL                      BITS(0,15)           /*!< compare 0 value */

/* HRTIMER_STxCMP0CP */
#define HRTIMER_STXCMP0CP_CMP0VAL                     BITS(0,15)           /*!< compare 0 value */
#define HRTIMER_STXCMP0CP_CREP                        BITS(16,23)          /*!< counter repetition value */

/* HRTIMER_STxCMP1V */
#define HRTIMER_STXCMP1V_CMP1VAL                      BITS(0,15)           /*!< compare 1 value */

/* HRTIMER_STxCMP2V */
#define HRTIMER_STXCMP2V_CMP2VAL                      BITS(0,15)           /*!< compare 2 value */

/* HRTIMER_STxCMP3V */
#define HRTIMER_STXCMP3V_CMP3VAL                      BITS(0,15)           /*!< compare 3 value */

/* HRTIMER_STxCAP0V */
#define HRTIMER_STXCAP0V_CAP0VAL                      BITS(0,15)           /*!< capture 0 value */
#define HRTIMER_STXCAP0V_DIR                          BIT(16)              /*!< capture 0 direction status */

/* HRTIMER_STxCAP1V */
#define HRTIMER_STXCAP1V_CAP1VAL                      BITS(0,15)           /*!< capture 1 value */
#define HRTIMER_STXCAP1V_DIR                          BIT(16)              /*!< capture 1 direction status */

/* HRTIMER_STxDTCTL */
#define HRTIMER_STXDTCTL_DTRCFG8_0                    BITS(0,8)            /*!< rising edge dead-time value */
#define HRTIMER_STXDTCTL_DTRS                         BIT(9)               /*!< the sign of rising edge dead-time value */
#define HRTIMER_STXDTCTL_DTGCKDIV                     BITS(10,13)          /*!< dead time generator clock division */
#define HRTIMER_STXDTCTL_DTRSPROT                     BIT(14)              /*!< dead-time rising edge protection for sign */
#define HRTIMER_STXDTCTL_DTRSVPROT                    BIT(15)              /*!< dead-time rising edge protection for value and sign */
#define HRTIMER_STXDTCTL_DTFCFG8_0                    BITS(16,24)          /*!< falling edge dead-time value */
#define HRTIMER_STXDTCTL_DTFS                         BIT(25)              /*!< the sign of falling edge dead-time value */
#define HRTIMER_STXDTCTL_DTFSPROT                     BIT(30)              /*!< dead-time falling edge protection for sign */
#define HRTIMER_STXDTCTL_DTFSVPROT                    BIT(31)              /*!< dead-time falling edge protection for value and sign */

