wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER_STxCH0SET */
#define HRTIMER_STXCH0SET_CH0SSEV                     BIT(0)               /*!< software event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SRST                     BIT(1)               /*!< Slave_TIMERx reset event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SPER                     BIT(2)               /*!< Slave_TIMERx period event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SCMP0                    BIT(3)               /*!< Slave_TIMERx compare 0 event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SCMP1                    BIT(4)               /*!< Slave_TIMERx compare 1 event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SCMP2                    BIT(5)               /*!< Slave_TIMERx compare 2 event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SCMP3                    BIT(6)               /*!< Slave_TIMERx compare 3 event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SMTPER                   BIT(7)               /*!< Master_TIMER period event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SMTCMP0                  BIT(8)               /*!< Master_TIMER compare 0 event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SMTCMP1                  BIT(9)               /*!< Master_TIMER compare 1 event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SMTCMP2                  BIT(10)              /*!< Master_TIMER compare 2 event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SMTCMP3                  BIT(11)              /*!< Master_TIMER compare 3 event generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SSTEV0                   BIT(12)              /*!< Slave_TIMERx interconnection event 0 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SSTEV1                   BIT(13)              /*!< Slave_TIMERx interconnection event 1 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SSTEV2                   BIT(14)              /*!< Slave_TIMERx interconnection event 2 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SSTEV3                   BIT(15)              /*!< Slave_TIMERx interconnection event 3 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SSTEV4                   BIT(16)              /*!< Slave_TIMERx interconnection event 4 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SSTEV5                   BIT(17)              /*!< Slave_TIMERx interconnection event 5 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SSTEV6                   BIT(18)              /*!< Slave_TIMERx interconnection event 6 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SSTEV7                   BIT(19)              /*!< Slave_TIMERx interconnection event 7 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SSTEV8                   BIT(20)              /*!< Slave_TIMERx interconnection event 8 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SEXEV0                   BIT(21)              /*!< external event 0 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SEXEV1                   BIT(22)              /*!< external event 1 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SEXEV2                   BIT(23)              /*!< external event 2 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SEXEV3                   BIT(24)              /*!< external event 3 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SEXEV4                   BIT(25)              /*!< external event 4 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SEXEV5                   BIT(26)              /*!< external event 5 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SEXEV6                   BIT(27)              /*!< external event 6 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SEXEV7                   BIT(28)              /*!< external event 7 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SEXEV8                   BIT(29)              /*!< external event 8 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SEXEV9                   BIT(30)              /*!< external event 9 generates channel 0 set request */
#define HRTIMER_STXCH0SET_CH0SUP                      BIT(31)              /*!< update event generates channel 0 set request */

/* HRTIMER_STxCH0RST */
#define HRTIMER_STXCH0RST_CH0RSSEV                    BIT(0)               /*!< software event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSRST                    BIT(1)               /*!< Slave_TIMERx reset event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSPER                    BIT(2)               /*!< Slave_TIMERx period event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSCMP0                   BIT(3)               /*!< Slave_TIMERx compare 0 event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSCMP1                   BIT(4)               /*!< Slave_TIMERx compare 1 event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSCMP2                   BIT(5)               /*!< Slave_TIMERx compare 2 event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSCMP3                   BIT(6)               /*!< Slave_TIMERx compare 3 event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSMTPER                  BIT(7)               /*!< Master_TIMER period event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSMTCMP0                 BIT(8)               /*!< Master_TIMER compare 0 event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSMTCMP1                 BIT(9)               /*!< Master_TIMER compare 1 event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSMTCMP2                 BIT(10)              /*!< Master_TIMER compare 2 event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSMTCMP3                 BIT(11)              /*!< Master_TIMER compare 3 event generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSSTEV0                  BIT(12)              /*!< Slave_TIMERx interconnection event 0 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSSTEV1                  BIT(13)              /*!< Slave_TIMERx interconnection event 1 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSSTEV2                  BIT(14)              /*!< Slave_TIMERx interconnection event 2 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSSTEV3                  BIT(15)              /*!< Slave_TIMERx interconnection event 3 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSSTEV4                  BIT(16)              /*!< Slave_TIMERx interconnection event 4 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSSTEV5                  BIT(17)              /*!< Slave_TIMERx interconnection event 5 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSSTEV6                  BIT(18)              /*!< Slave_TIMERx interconnection event 6 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSSTEV7                  BIT(19)              /*!< Slave_TIMERx interconnection event 7 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSSTEV8                  BIT(20)              /*!< Slave_TIMERx interconnection event 8 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSEXEV0                  BIT(21)              /*!< external event 0 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSEXEV1                  BIT(22)              /*!< external event 1 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSEXEV2                  BIT(23)              /*!< external event 2 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSEXEV3                  BIT(24)              /*!< external event 3 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSEXEV4                  BIT(25)              /*!< external event 4 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSEXEV5                  BIT(26)              /*!< external event 5 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSEXEV6                  BIT(27)              /*!< external event 6 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSEXEV7                  BIT(28)              /*!< external event 7 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSEXEV8                  BIT(29)              /*!< external event 8 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSEXEV9                  BIT(30)              /*!< external event 9 generates channel 0 reset request */
#define HRTIMER_STXCH0RST_CH0RSUP                     BIT(31)              /*!< update event generates channel 0 reset request */

