wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER_STxCH1SET */
#define HRTIMER_STXCH1SET_CH1SSEV                     BIT(0)               /*!< software event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SRST                     BIT(1)               /*!< Slave_TIMERx reset event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SPER                     BIT(2)               /*!< Slave_TIMERx period event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SCMP0                    BIT(3)               /*!< Slave_TIMERx compare 0 event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SCMP1                    BIT(4)               /*!< Slave_TIMERx compare 1 event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SCMP2                    BIT(5)               /*!< Slave_TIMERx compare 2 event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SCMP3                    BIT(6)               /*!< Slave_TIMERx compare 3 event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SMTPER                   BIT(7)               /*!< Master_TIMER period event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SMTCMP0                  BIT(8)               /*!< Master_TIMER compare 0 event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SMTCMP1                  BIT(9)               /*!< Master_TIMER compare 1 event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SMTCMP2                  BIT(10)              /*!< Master_TIMER compare 2 event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SMTCMP3                  BIT(11)              /*!< Master_TIMER compare 3 event generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SSTEV0                   BIT(12)              /*!< Slave_TIMERx interconnection event 0 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SSTEV1                   BIT(13)              /*!< Slave_TIMERx interconnection event 1 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SSTEV2                   BIT(14)              /*!< Slave_TIMERx interconnection event 2 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SSTEV3                   BIT(15)              /*!< Slave_TIMERx interconnection event 3 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SSTEV4                   BIT(16)              /*!< Slave_TIMERx interconnection event 4 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SSTEV5                   BIT(17)              /*!< Slave_TIMERx interconnection event 5 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SSTEV6                   BIT(18)              /*!< Slave_TIMERx interconnection event 6 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SSTEV7                   BIT(19)              /*!< Slave_TIMERx interconnection event 7 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SSTEV8                   BIT(20)              /*!< Slave_TIMERx interconnection event 8 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SEXEV0                   BIT(21)              /*!< external event 0 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SEXEV1                   BIT(22)              /*!< external event 1 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SEXEV2                   BIT(23)              /*!< external event 2 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SEXEV3                   BIT(24)              /*!< external event 3 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SEXEV4                   BIT(25)              /*!< external event 4 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SEXEV5                   BIT(26)              /*!< external event 5 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SEXEV6                   BIT(27)              /*!< external event 6 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SEXEV7                   BIT(28)              /*!< external event 7 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SEXEV8                   BIT(29)              /*!< external event 8 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SEXEV9                   BIT(30)              /*!< external event 9 generates channel 1 set request */
#define HRTIMER_STXCH1SET_CH1SUP                      BIT(31)              /*!< update event generates channel 1 set request */

/* HRTIMER_STxCH1RST */
#define HRTIMER_STXCH1RST_CH1RSSEV                    BIT(0)               /*!< software event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSRST                    BIT(1)               /*!< Slave_TIMERx reset event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSPER                    BIT(2)               /*!< Slave_TIMERx period event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSCMP0                   BIT(3)               /*!< Slave_TIMERx compare 0 event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSCMP1                   BIT(4)               /*!< Slave_TIMERx compare 1 event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSCMP2                   BIT(5)               /*!< Slave_TIMERx compare 2 event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSCMP3                   BIT(6)               /*!< Slave_TIMERx compare 3 event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSMTPER                  BIT(7)               /*!< Master_TIMER period event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSMTCMP0                 BIT(8)               /*!< Master_TIMER compare 0 event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSMTCMP1                 BIT(9)               /*!< Master_TIMER compare 1 event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSMTCMP2                 BIT(10)              /*!< Master_TIMER compare 2 event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSMTCMP3                 BIT(11)              /*!< Master_TIMER compare 3 event generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSSTEV0                  BIT(12)              /*!< Slave_TIMERx interconnection event 0 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSSTEV1                  BIT(13)              /*!< Slave_TIMERx interconnection event 1 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSSTEV2                  BIT(14)              /*!< Slave_TIMERx interconnection event 2 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSSTEV3                  BIT(15)              /*!< Slave_TIMERx interconnection event 3 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSSTEV4                  BIT(16)              /*!< Slave_TIMERx interconnection event 4 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSSTEV5                  BIT(17)              /*!< Slave_TIMERx interconnection event 5 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSSTEV6                  BIT(18)              /*!< Slave_TIMERx interconnection event 6 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSSTEV7                  BIT(19)              /*!< Slave_TIMERx interconnection event 7 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSSTEV8                  BIT(20)              /*!< Slave_TIMERx interconnection event 8 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSEXEV0                  BIT(21)              /*!< external event 0 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSEXEV1                  BIT(22)              /*!< external event 1 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSEXEV2                  BIT(23)              /*!< external event 2 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSEXEV3                  BIT(24)              /*!< external event 3 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSEXEV4                  BIT(25)              /*!< external event 4 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSEXEV5                  BIT(26)              /*!< external event 5 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSEXEV6                  BIT(27)              /*!< external event 6 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSEXEV7                  BIT(28)              /*!< external event 7 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSEXEV8                  BIT(29)              /*!< external event 8 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSEXEV9                  BIT(30)              /*!< external event 9 generates channel 1 reset request */
#define HRTIMER_STXCH1RST_CH1RSUP                     BIT(31)              /*!< update event generates channel 1 reset request */

/* HRTIMER_STxEXEVFCFG0 */
#define HRTIMER_STXEXEVFCFG0_EXEV0MEEN                BIT(0)               /*!< external event 0 memory */
#define HRTIMER_STXEXEVFCFG0_EXEV0FM                  BITS(1,5)            /*!< external event 0 filter mode */
#define HRTIMER_STXEXEVFCFG0_EXEV1MEEN                BIT(6)               /*!< external event 1 memory */
#define HRTIMER_STXEXEVFCFG0_EXEV1FM                  BITS(7,11)           /*!< external event 1 filter mode */
#define HRTIMER_STXEXEVFCFG0_EXEV2MEEN                BIT(12)              /*!< external event 2 memory */
#define HRTIMER_STXEXEVFCFG0_EXEV2FM                  BITS(13,17)          /*!< external event 2 filter mode */
#define HRTIMER_STXEXEVFCFG0_EXEV3MEEN                BIT(18)              /*!< external event 3 memory */
#define HRTIMER_STXEXEVFCFG0_EXEV3FM                  BITS(19,23)          /*!< external event 3 filter mode */
#define HRTIMER_STXEXEVFCFG0_EXEV4MEEN                BIT(24)              /*!< external event 4 memory */
#define HRTIMER_STXEXEVFCFG0_EXEV4FM                  BITS(25,29)          /*!< external event 4 filter mode */

/* HRTIMER_STxEXEVFCFG1 */
#define HRTIMER_STXEXEVFCFG1_EXEV5MEEN                BIT(0)               /*!< external event 5 memory */
#define HRTIMER_STXEXEVFCFG1_EXEV5FM                  BITS(1,5)            /*!< external event 5 filter mode */
#define HRTIMER_STXEXEVFCFG1_EXEV6MEEN                BIT(6)               /*!< external event 6 memory */
#define HRTIMER_STXEXEVFCFG1_EXEV6FM                  BITS(7,11)           /*!< external event 6 filter mode */
#define HRTIMER_STXEXEVFCFG1_EXEV7MEEN                BIT(12)              /*!< external event 7 memory */
#define HRTIMER_STXEXEVFCFG1_EXEV7FM                  BITS(13,17)          /*!< external event 7 filter mode */
#define HRTIMER_STXEXEVFCFG1_EXEV8MEEN                BIT(18)              /*!< external event 8 memory */
#define HRTIMER_STXEXEVFCFG1_EXEV8FM                  BITS(19,23)          /*!< external event 8 filter mode */
#define HRTIMER_STXEXEVFCFG1_EXEV9MEEN                BIT(24)              /*!< external event 9 memory */
#define HRTIMER_STXEXEVFCFG1_EXEV9FM                  BITS(25,29)          /*!< external event 9 filter mode */

/* HRTIMER_STxCNTRST */
#define HRTIMER_STXCNTRST_UPRST                       BIT(1)               /*!< Slave_TIMER0 update event resets counter */
#define HRTIMER_STXCNTRST_CMP1RST                     BIT(2)               /*!< Slave_TIMER0 compare 1 event resets counter */
#define HRTIMER_STXCNTRST_CMP3RST                     BIT(3)               /*!< Slave_TIMER0 compare 3 event resets counter */
#define HRTIMER_STXCNTRST_MTPERRST                    BIT(4)               /*!< Master_TIMER period event resets counter */
#define HRTIMER_STXCNTRST_MTCMP0RST                   BIT(5)               /*!< Master_TIMER compare 0 event resets counter */
#define HRTIMER_STXCNTRST_MTCMP1RST                   BIT(6)               /*!< Master_TIMER compare 1 event resets counter */
#define HRTIMER_STXCNTRST_MTCMP2RST                   BIT(7)               /*!< Master_TIMER compare 2 event resets counter */
#define HRTIMER_STXCNTRST_MTCMP3RST                   BIT(8)               /*!< Master_TIMER compare 3 event resets counter */
#define HRTIMER_STXCNTRST_EXEV0RST                    BIT(9)               /*!< external event 0 resets counter */
#define HRTIMER_STXCNTRST_EXEV1RST                    BIT(10)              /*!< external event 1 resets counter */
#define HRTIMER_STXCNTRST_EXEV2RST                    BIT(11)              /*!< external event 2 resets counter */
#define HRTIMER_STXCNTRST_EXEV3RST                    BIT(12)              /*!< external event 3 resets counter */
#define HRTIMER_STXCNTRST_EXEV4RST                    BIT(13)              /*!< external event 4 resets counter */
#define HRTIMER_STXCNTRST_EXEV5RST                    BIT(14)              /*!< external event 5 resets counter */
#define HRTIMER_STXCNTRST_EXEV6RST                    BIT(15)              /*!< external event 6 resets counter */
#define HRTIMER_STXCNTRST_EXEV7RST                    BIT(16)              /*!< external event 7 resets counter */
#define HRTIMER_STXCNTRST_EXEV8RST                    BIT(17)              /*!< external event 8 resets counter */
#define HRTIMER_STXCNTRST_EXEV9RST                    BIT(18)              /*!< external event 9 resets counter */

/* For Slave_TIMER0 */
#define HRTIMER_ST0CNTRST_ST5CMP0RST                  BIT(0)               /*!< Slave_TIMER5 compare 0 event resets counter */
#define HRTIMER_ST0CNTRST_ST1CMP0RST                  BIT(19)              /*!< Slave_TIMER1 compare 0 event resets counter */
#define HRTIMER_ST0CNTRST_ST1CMP1RST                  BIT(20)              /*!< Slave_TIMER1 compare 1 event resets counter */
#define HRTIMER_ST0CNTRST_ST1CMP3RST                  BIT(21)              /*!< Slave_TIMER1 compare 3 event resets counter */
#define HRTIMER_ST0CNTRST_ST2CMP0RST                  BIT(22)              /*!< Slave_TIMER2 compare 0 event resets counter */
#define HRTIMER_ST0CNTRST_ST2CMP1RST                  BIT(23)              /*!< Slave_TIMER2 compare 1 event resets counter */
#define HRTIMER_ST0CNTRST_ST2CMP3RST                  BIT(24)              /*!< Slave_TIMER2 compare 3 event resets counter */
#define HRTIMER_ST0CNTRST_ST3CMP0RST                  BIT(25)              /*!< Slave_TIMER3 compare 0 event resets counter */
#define HRTIMER_ST0CNTRST_ST3CMP1RST                  BIT(26)              /*!< Slave_TIMER3 compare 1 event resets counter */
#define HRTIMER_ST0CNTRST_ST3CMP3RST                  BIT(27)              /*!< Slave_TIMER3 compare 3 event resets counter */
#define HRTIMER_ST0CNTRST_ST4CMP0RST                  BIT(28)              /*!< Slave_TIMER4 compare 0 event resets counter */
#define HRTIMER_ST0CNTRST_ST4CMP1RST                  BIT(29)              /*!< Slave_TIMER4 compare 1 event resets counter */
#define HRTIMER_ST0CNTRST_ST4CMP3RST                  BIT(30)              /*!< Slave_TIMER4 compare 3 event resets counter */
#define HRTIMER_ST0CNTRST_ST5CMP1RST                  BIT(31)              /*!< Slave_TIMER5 compare 1 event resets counter */
/* For Slave_TIMER1 */
#define HRTIMER_ST1CNTRST_ST5CMP0RST                  BIT(0)               /*!< Slave_TIMER5 compare 0 event resets counter */
#define HRTIMER_ST1CNTRST_ST0CMP0RST                  BIT(19)              /*!< Slave_TIMER0 compare 0 event resets counter */
#define HRTIMER_ST1CNTRST_ST0CMP1RST                  BIT(20)              /*!< Slave_TIMER0 compare 1 event resets counter */
#define HRTIMER_ST1CNTRST_ST0CMP3RST                  BIT(21)              /*!< Slave_TIMER0 compare 3 event resets counter */
#define HRTIMER_ST1CNTRST_ST2CMP0RST                  BIT(22)              /*!< Slave_TIMER2 compare 0 event resets counter */
#define HRTIMER_ST1CNTRST_ST2CMP1RST                  BIT(23)              /*!< Slave_TIMER2 compare 1 event resets counter */
#define HRTIMER_ST1CNTRST_ST2CMP3RST                  BIT(24)              /*!< Slave_TIMER2 compare 3 event resets counter */
#define HRTIMER_ST1CNTRST_ST3CMP0RST                  BIT(25)              /*!< Slave_TIMER3 compare 0 event resets counter */
#define HRTIMER_ST1CNTRST_ST3CMP1RST                  BIT(26)              /*!< Slave_TIMER3 compare 1 event resets counter */
#define HRTIMER_ST1CNTRST_ST3CMP3RST                  BIT(27)              /*!< Slave_TIMER3 compare 3 event resets counter */
#define HRTIMER_ST1CNTRST_ST4CMP0RST                  BIT(28)              /*!< Slave_TIMER4 compare 0 event resets counter */
#define HRTIMER_ST1CNTRST_ST4CMP1RST                  BIT(29)              /*!< Slave_TIMER4 compare 1 event resets counter */
#define HRTIMER_ST1CNTRST_ST4CMP3RST                  BIT(30)              /*!< Slave_TIMER4 compare 3 event resets counter */
#define HRTIMER_ST1CNTRST_ST5CMP1RST                  BIT(31)              /*!< Slave_TIMER5 compare 1 event resets counter */
/* For Slave_TIMER2 */
#define HRTIMER_ST2CNTRST_ST5CMP0RST                  BIT(0)               /*!< Slave_TIMER5 compare 0 event resets counter */
#define HRTIMER_ST2CNTRST_ST0CMP0RST                  BIT(19)              /*!< Slave_TIMER0 compare 0 event resets counter */
#define HRTIMER_ST2CNTRST_ST0CMP1RST                  BIT(20)              /*!< Slave_TIMER0 compare 1 event resets counter */
#define HRTIMER_ST2CNTRST_ST0CMP3RST                  BIT(21)              /*!< Slave_TIMER0 compare 3 event resets counter */
#define HRTIMER_ST2CNTRST_ST1CMP0RST                  BIT(22)              /*!< Slave_TIMER1 compare 0 event resets counter */
#define HRTIMER_ST2CNTRST_ST1CMP1RST                  BIT(23)              /*!< Slave_TIMER1 compare 1 event resets counter */
#define HRTIMER_ST2CNTRST_ST1CMP3RST                  BIT(24)              /*!< Slave_TIMER1 compare 3 event resets counter */
#define HRTIMER_ST2CNTRST_ST3CMP0RST                  BIT(25)              /*!< Slave_TIMER3 compare 0 event resets counter */
#define HRTIMER_ST2CNTRST_ST3CMP1RST                  BIT(26)              /*!< Slave_TIMER3 compare 1 event resets counter */
#define HRTIMER_ST2CNTRST_ST3CMP3RST                  BIT(27)              /*!< Slave_TIMER3 compare 3 event resets counter */
#define HRTIMER_ST2CNTRST_ST4CMP0RST                  BIT(28)              /*!< Slave_TIMER4 compare 0 event resets counter */
#define HRTIMER_ST2CNTRST_ST4CMP1RST                  BIT(29)              /*!< Slave_TIMER4 compare 1 event resets counter */
#define HRTIMER_ST2CNTRST_ST4CMP3RST                  BIT(30)              /*!< Slave_TIMER4 compare 3 event resets counter */
#define HRTIMER_ST2CNTRST_ST5CMP1RST                  BIT(31)              /*!< Slave_TIMER5 compare 1 event resets counter */
/* For Slave_TIMER3 */
#define HRTIMER_ST3CNTRST_ST5CMP0RST                  BIT(0)               /*!< Slave_TIMER5 compare 0 event resets counter */
#define HRTIMER_ST3CNTRST_ST0CMP0RST                  BIT(19)              /*!< Slave_TIMER0 compare 0 event resets counter */
#define HRTIMER_ST3CNTRST_ST0CMP1RST                  BIT(20)              /*!< Slave_TIMER0 compare 1 event resets counter */
#define HRTIMER_ST3CNTRST_ST0CMP3RST                  BIT(21)              /*!< Slave_TIMER0 compare 3 event resets counter */
#define HRTIMER_ST3CNTRST_ST1CMP0RST                  BIT(22)              /*!< Slave_TIMER1 compare 0 event resets counter */
#define HRTIMER_ST3CNTRST_ST1CMP1RST                  BIT(23)              /*!< Slave_TIMER1 compare 1 event resets counter */
#define HRTIMER_ST3CNTRST_ST1CMP3RST                  BIT(24)              /*!< Slave_TIMER1 compare 3 event resets counter */
#define HRTIMER_ST3CNTRST_ST2CMP0RST                  BIT(25)              /*!< Slave_TIMER2 compare 0 event resets counter */
#define HRTIMER_ST3CNTRST_ST2CMP1RST                  BIT(26)              /*!< Slave_TIMER2 compare 1 event resets counter */
#define HRTIMER_ST3CNTRST_ST2CMP3RST                  BIT(27)              /*!< Slave_TIMER2 compare 3 event resets counter */
#define HRTIMER_ST3CNTRST_ST4CMP0RST                  BIT(28)              /*!< Slave_TIMER4 compare 0 event resets counter */
#define HRTIMER_ST3CNTRST_ST4CMP1RST                  BIT(29)              /*!< Slave_TIMER4 compare 1 event resets counter */
#define HRTIMER_ST3CNTRST_ST4CMP3RST                  BIT(30)              /*!< Slave_TIMER4 compare 3 event resets counter */
#define HRTIMER_ST3CNTRST_ST5CMP1RST                  BIT(31)              /*!< Slave_TIMER5 compare 1 event resets counter */
/* For Slave_TIMER4 */
#define HRTIMER_ST4CNTRST_ST5CMP0RST                  BIT(0)               /*!< Slave_TIMER5 compare 0 event resets counter */
#define HRTIMER_ST4CNTRST_ST0CMP0RST                  BIT(19)              /*!< Slave_TIMER0 compare 0 event resets counter */
#define HRTIMER_ST4CNTRST_ST0CMP1RST                  BIT(20)              /*!< Slave_TIMER0 compare 1 event resets counter */
#define HRTIMER_ST4CNTRST_ST0CMP3RST                  BIT(21)              /*!< Slave_TIMER0 compare 3 event resets counter */
#define HRTIMER_ST4CNTRST_ST1CMP0RST                  BIT(22)              /*!< Slave_TIMER1 compare 0 event resets counter */
#define HRTIMER_ST4CNTRST_ST1CMP1RST                  BIT(23)              /*!< Slave_TIMER1 compare 1 event resets counter */
#define HRTIMER_ST4CNTRST_ST1CMP3RST                  BIT(24)              /*!< Slave_TIMER1 compare 3 event resets counter */
#define HRTIMER_ST4CNTRST_ST2CMP0RST                  BIT(25)              /*!< Slave_TIMER2 compare 0 event resets counter */
#define HRTIMER_ST4CNTRST_ST2CMP1RST                  BIT(26)              /*!< Slave_TIMER2 compare 1 event resets counter */
#define HRTIMER_ST4CNTRST_ST2CMP3RST                  BIT(27)              /*!< Slave_TIMER2 compare 3 event resets counter */
#define HRTIMER_ST4CNTRST_ST3CMP0RST                  BIT(28)              /*!< Slave_TIMER3 compare 0 event resets counter */
#define HRTIMER_ST4CNTRST_ST3CMP1RST                  BIT(29)              /*!< Slave_TIMER3 compare 1 event resets counter */
#define HRTIMER_ST4CNTRST_ST3CMP3RST                  BIT(30)              /*!< Slave_TIMER3 compare 3 event resets counter */
#define HRTIMER_ST4CNTRST_ST5CMP1RST                  BIT(31)              /*!< Slave_TIMER5 compare 1 event resets counter */

