wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* For Slave_TIMER5,6,7 */
#define HRTIMER_ST5_6_7CNTRST_ST4CMP0RST              BIT(0)               /*!< Slave_TIMER4 compare 0 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST0CMP0RST              BIT(19)              /*!< Slave_TIMER0 compare 0 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST0CMP1RST              BIT(20)              /*!< Slave_TIMER0 compare 1 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST0CMP3RST              BIT(21)              /*!< Slave_TIMER0 compare 3 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST1CMP0RST              BIT(22)              /*!< Slave_TIMER1 compare 0 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST1CMP1RST              BIT(23)              /*!< Slave_TIMER1 compare 1 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST1CMP3RST              BIT(24)              /*!< Slave_TIMER1 compare 3 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST2CMP0RST              BIT(25)              /*!< Slave_TIMER2 compare 0 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST2CMP1RST              BIT(26)              /*!< Slave_TIMER2 compare 1 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST2CMP3RST              BIT(27)              /*!< Slave_TIMER2 compare 3 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST3CMP0RST              BIT(28)              /*!< Slave_TIMER3 compare 0 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST3CMP1RST              BIT(29)              /*!< Slave_TIMER3 compare 1 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST3CMP3RST              BIT(30)              /*!< Slave_TIMER3 compare 3 event resets counter */
#define HRTIMER_ST5_6_7CNTRST_ST4CMP1RST              BIT(31)              /*!< Slave_TIMER4 compare 1 event resets counter */

/* HRTIMER_STxCSCTL */
#define HRTIMER_STXCSCTL_CSPRD                        BITS(0,3)            /*!< carrier signal period */
#define HRTIMER_STXCSCTL_CSDTY                        BITS(4,6)            /*!< carrier signal duty cycle */
#define HRTIMER_STXCSCTL_CSFSTPW                      BITS(7,10)           /*!< first carrier-signal pulse width */

/* HRTIMER_STxCAP0TRG */
#define HRTIMER_STXCAP0TRG_CP0BSW                     BIT(0)               /*!< capture 0 triggered by software */
#define HRTIMER_STXCAP0TRG_CP0BUP                     BIT(1)               /*!< capture 0 triggered by update event */
#define HRTIMER_STXCAP0TRG_CP0BEXEV0                  BIT(2)               /*!< capture 0 triggered by external event 0 */
#define HRTIMER_STXCAP0TRG_CP0BEXEV1                  BIT(3)               /*!< capture 0 triggered by external event 1 */
#define HRTIMER_STXCAP0TRG_CP0BEXEV2                  BIT(4)               /*!< capture 0 triggered by external event 2 */
#define HRTIMER_STXCAP0TRG_CP0BEXEV3                  BIT(5)               /*!< capture 0 triggered by external event 3 */
#define HRTIMER_STXCAP0TRG_CP0BEXEV4                  BIT(6)               /*!< capture 0 triggered by external event 4 */
#define HRTIMER_STXCAP0TRG_CP0BEXEV5                  BIT(7)               /*!< capture 0 triggered by external event 5 */
#define HRTIMER_STXCAP0TRG_CP0BEXEV6                  BIT(8)               /*!< capture 0 triggered by external event 6 */
#define HRTIMER_STXCAP0TRG_CP0BEXEV7                  BIT(9)               /*!< capture 0 triggered by external event 7 */
#define HRTIMER_STXCAP0TRG_CP0BEXEV8                  BIT(10)              /*!< capture 0 triggered by external event 8 */
#define HRTIMER_STXCAP0TRG_CP0BEXEV9                  BIT(11)              /*!< capture 0 triggered by external event 9 */
#define HRTIMER_STXCAP0TRG_CP0BST0A                   BIT(12)              /*!< capture 0 triggered by ST0CH0_O output inactive to active transition */
#define HRTIMER_STXCAP0TRG_CP0BST0NA                  BIT(13)              /*!< capture 0 triggered by ST0CH0_O output active to inactive transition */
#define HRTIMER_STXCAP0TRG_CP0BST0CMP0                BIT(14)              /*!< capture 0 triggered by compare 0 event of Slave_TIMER0  */
#define HRTIMER_STXCAP0TRG_CP0BST0CMP1                BIT(15)              /*!< capture 0 triggered by compare 1 event of Slave_TIMER0 */
#define HRTIMER_STXCAP0TRG_CP0BST1A                   BIT(16)              /*!< capture 0 triggered by ST1CH0_O output inactive to active transition */
#define HRTIMER_STXCAP0TRG_CP0BST1NA                  BIT(17)              /*!< capture 0 triggered by ST1CH0_O output active to inactive transition */
#define HRTIMER_STXCAP0TRG_CP0BST1CMP0                BIT(18)              /*!< capture 0 triggered by compare 0 event of Slave_TIMER1 */
#define HRTIMER_STXCAP0TRG_CP0BST1CMP1                BIT(19)              /*!< capture 0 triggered by compare 1 event of Slave_TIMER1 */
#define HRTIMER_STXCAP0TRG_CP0BST2A                   BIT(20)              /*!< capture 0 triggered by ST2CH0_O output inactive to active transition */
#define HRTIMER_STXCAP0TRG_CP0BST2NA                  BIT(21)              /*!< capture 0 triggered by ST2CH0_O output active to inactive transition */
#define HRTIMER_STXCAP0TRG_CP0BST2CMP0                BIT(22)              /*!< capture 0 triggered by compare 0 event of Slave_TIMER2 */
#define HRTIMER_STXCAP0TRG_CP0BST2CMP1                BIT(23)              /*!< capture 0 triggered by compare 1 event of Slave_TIMER2 */
#define HRTIMER_STXCAP0TRG_CP0BST3A                   BIT(24)              /*!< capture 0 triggered by ST3CH0_O output inactive to active transition */
#define HRTIMER_STXCAP0TRG_CP0BST3NA                  BIT(25)              /*!< capture 0 triggered by ST3CH0_O output active to inactive transition */
#define HRTIMER_STXCAP0TRG_CP0BST3CMP0                BIT(26)              /*!< capture 0 triggered by compare 0 event of Slave_TIMER3 */
#define HRTIMER_STXCAP0TRG_CP0BST3CMP1                BIT(27)              /*!< capture 0 triggered by compare 1 event of Slave_TIMER3 */
#define HRTIMER_STXCAP0TRG_CP0BST4A                   BIT(28)              /*!< capture 0 triggered by ST4CH0_O output inactive to active transition */
#define HRTIMER_STXCAP0TRG_CP0BST4NA                  BIT(29)              /*!< capture 0 triggered by ST4CH0_O output active to inactive transition. */
#define HRTIMER_STXCAP0TRG_CP0BST4CMP0                BIT(30)              /*!< capture 0 triggered by compare 0 event of Slave_TIMER4 */
#define HRTIMER_STXCAP0TRG_CP0BST4CMP1                BIT(31)              /*!< capture 0 triggered by compare 1 event of Slave_TIMER4 */

/* HRTIMER_STxCAP1TRG */
#define HRTIMER_STXCAP1TRG_CP1BSW                     BIT(0)               /*!< capture 1 triggered by software */
#define HRTIMER_STXCAP1TRG_CP1BUP                     BIT(1)               /*!< capture 1 triggered by update event */
#define HRTIMER_STXCAP1TRG_CP1BEXEV0                  BIT(2)               /*!< capture 1 triggered by external event 0 */
#define HRTIMER_STXCAP1TRG_CP1BEXEV1                  BIT(3)               /*!< capture 1 triggered by external event 1 */
#define HRTIMER_STXCAP1TRG_CP1BEXEV2                  BIT(4)               /*!< capture 1 triggered by external event 2 */
#define HRTIMER_STXCAP1TRG_CP1BEXEV3                  BIT(5)               /*!< capture 1 triggered by external event 3 */
#define HRTIMER_STXCAP1TRG_CP1BEXEV4                  BIT(6)               /*!< capture 1 triggered by external event 4 */
#define HRTIMER_STXCAP1TRG_CP1BEXEV5                  BIT(7)               /*!< capture 1 triggered by external event 5 */
#define HRTIMER_STXCAP1TRG_CP1BEXEV6                  BIT(8)               /*!< capture 1 triggered by external event 6 */
#define HRTIMER_STXCAP1TRG_CP1BEXEV7                  BIT(9)               /*!< capture 1 triggered by external event 7 */
#define HRTIMER_STXCAP1TRG_CP1BEXEV8                  BIT(10)              /*!< capture 1 triggered by external event 8 */
#define HRTIMER_STXCAP1TRG_CP1BEXEV9                  BIT(11)              /*!< capture 1 triggered by external event 9 */
#define HRTIMER_STXCAP1TRG_CP1BST0A                   BIT(12)              /*!< capture 1 triggered by ST0CH0_O output inactive to active transition */
#define HRTIMER_STXCAP1TRG_CP1BST0NA                  BIT(13)              /*!< capture 1 triggered by ST0CH0_O output active to inactive transition */
#define HRTIMER_STXCAP1TRG_CP1BST0CMP0                BIT(14)              /*!< capture 1 triggered by compare 0 event of Slave_TIMER0  */
#define HRTIMER_STXCAP1TRG_CP1BST0CMP1                BIT(15)              /*!< capture 1 triggered by compare 1 event of Slave_TIMER0 */
#define HRTIMER_STXCAP1TRG_CP1BST1A                   BIT(16)              /*!< capture 1 triggered by ST1CH0_O output inactive to active transition */
#define HRTIMER_STXCAP1TRG_CP1BST1NA                  BIT(17)              /*!< capture 1 triggered by ST1CH0_O output active to inactive transition */
#define HRTIMER_STXCAP1TRG_CP1BST1CMP0                BIT(18)              /*!< capture 1 triggered by compare 0 event of Slave_TIMER1 */
#define HRTIMER_STXCAP1TRG_CP1BST1CMP1                BIT(19)              /*!< capture 1 triggered by compare 1 event of Slave_TIMER1 */
#define HRTIMER_STXCAP1TRG_CP1BST2A                   BIT(20)              /*!< capture 1 triggered by ST2CH0_O output inactive to active transition */
#define HRTIMER_STXCAP1TRG_CP1BST2NA                  BIT(21)              /*!< capture 1 triggered by ST2CH0_O output active to inactive transition */
#define HRTIMER_STXCAP1TRG_CP1BST2CMP0                BIT(22)              /*!< capture 1 triggered by compare 0 event of Slave_TIMER2 */
#define HRTIMER_STXCAP1TRG_CP1BST2CMP1                BIT(23)              /*!< capture 1 triggered by compare 1 event of Slave_TIMER2 */
#define HRTIMER_STXCAP1TRG_CP1BST3A                   BIT(24)              /*!< capture 1 triggered by ST3CH0_O output inactive to active transition */
#define HRTIMER_STXCAP1TRG_CP1BST3NA                  BIT(25)              /*!< capture 1 triggered by ST3CH0_O output active to inactive transition */
#define HRTIMER_STXCAP1TRG_CP1BST3CMP0                BIT(26)              /*!< capture 1 triggered by compare 0 event of Slave_TIMER3 */
#define HRTIMER_STXCAP1TRG_CP1BST3CMP1                BIT(27)              /*!< capture 1 triggered by compare 1 event of Slave_TIMER3 */
#define HRTIMER_STXCAP1TRG_CP1BST4A                   BIT(28)              /*!< capture 1 triggered by ST4CH0_O output inactive to active transition */
#define HRTIMER_STXCAP1TRG_CP1BST4NA                  BIT(29)              /*!< capture 1 triggered by ST4CH0_O output active to inactive transition. */
#define HRTIMER_STXCAP1TRG_CP1BST4CMP0                BIT(30)              /*!< capture 1 triggered by compare 0 event of Slave_TIMER4 */
#define HRTIMER_STXCAP1TRG_CP1BST4CMP1                BIT(31)              /*!< capture 1 triggered by compare 1 event of Slave_TIMER4 */

/* HRTIMER_STxCHOCTL */
#define HRTIMER_STXCHOCTL_CH0P                        BIT(1)               /*!< channel 0 output polarity */
#define HRTIMER_STXCHOCTL_BMCH0IEN                    BIT(2)               /*!< channel 0 IDLE state enable in bunch mode */
#define HRTIMER_STXCHOCTL_ISO0                        BIT(3)               /*!< channel 0 output idle state */
#define HRTIMER_STXCHOCTL_CH0FLTOS                    BITS(4,5)            /*!< channel 0 fault output state */
#define HRTIMER_STXCHOCTL_CH0CSEN                     BIT(6)               /*!< channel 0 carrier-signal mode enable */
#define HRTIMER_STXCHOCTL_BMCH0DTI                    BIT(7)               /*!< channel 0 dead-time insert in bunch mode */
#define HRTIMER_STXCHOCTL_DTEN                        BIT(8)               /*!< dead time enable */
#define HRTIMER_STXCHOCTL_DLYISMEN                    BIT(9)               /*!< delayed IDLE state mode enable */
#define HRTIMER_STXCHOCTL_DLYISCH                     BITS(10,12)          /*!< delayed IDLE source and channel */
#define HRTIMER_STXCHOCTL_BALIAR                      BIT(14)              /*!< balanced IDLE automatic resume */
#define HRTIMER_STXCHOCTL_CH1P                        BIT(17)              /*!< channel 1 output polarity */
#define HRTIMER_STXCHOCTL_BMCH1IEN                    BIT(18)              /*!< channel 1 IDLE state enable in bunch mode */
#define HRTIMER_STXCHOCTL_ISO1                        BIT(19)              /*!< channel 1 output idle state */
#define HRTIMER_STXCHOCTL_CH1FLTOS                    BITS(20,21)          /*!< channel 1 fault output state */
#define HRTIMER_STXCHOCTL_CH1CSEN                     BIT(22)              /*!< channel 1 carrier-signal mode enable */
#define HRTIMER_STXCHOCTL_BMCH1DTI                    BIT(23)              /*!< channel 1 dead-time insert in bunch mode */

/* HRTIMER_STxFLTCTL */
#define HRTIMER_STXFLTCTL_FLT0EN                      BIT(0)               /*!< fault 0 enable */
#define HRTIMER_STXFLTCTL_FLT1EN                      BIT(1)               /*!< fault 1 enable */
#define HRTIMER_STXFLTCTL_FLT2EN                      BIT(2)               /*!< fault 2 enable */
#define HRTIMER_STXFLTCTL_FLT3EN                      BIT(3)               /*!< fault 3 enable */
#define HRTIMER_STXFLTCTL_FLT4EN                      BIT(4)               /*!< fault 4 enable */
#define HRTIMER_STXFLTCTL_FLT5EN                      BIT(5)               /*!< fault 5 enable */
#define HRTIMER_STXFLTCTL_FLT6EN                      BIT(6)               /*!< fault 6 enable */
#define HRTIMER_STXFLTCTL_FLT7EN                      BIT(7)               /*!< fault 7 enable */
#define HRTIMER_STXFLTCTL_FLTENPROT                   BIT(31)              /*!< protect fault enable */

/* HRTIMER_STXCTL1 */     
#define HRTIMER_STXCTL1_TRIGEN                        BIT(0)               /*!< two channel trigger enable */
#define HRTIMER_STXCTL1_TRIG0M                        BIT(1)               /*!< two channel TRIG0 trigger */
#define HRTIMER_STXCTL1_TRIG1M                        BIT(2)               /*!< two channel TRIG1 trigger */
#define HRTIMER_STXCTL1_CAM                           BIT(4)               /*!< center-aligned counting mode */
#define HRTIMER_STXCTL1_ROVM                          BITS(6,7)            /*!< roll-over mode */
#define HRTIMER_STXCTL1_OUTROVM                       BITS(8,9)            /*!< output roll-over mode */
#define HRTIMER_STXCTL1_ADCROVM                       BITS(10,11)          /*!< ADC roll-over mode */
#define HRTIMER_STXCTL1_BMROVM                        BITS(12,13)          /*!< bunch mode roll-over mode */
#define HRTIMER_STXCTL1_FEROVM                        BITS(14,15)          /*!< fault and event roll-over mode */
#define HRTIMER_STXCTL1_IMUPD0V                       BIT(16)              /*!< immediately update compare 0 value PWM mode */
#define HRTIMER_STXCTL1_IMUPD2V                       BIT(17)              /*!< immediately update compare 2 value PWM mode */
#define HRTIMER_STXCTL1_TRGHALFM                      BIT(20)              /*!< tiriggered-half mode */

