wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER_STXEXEVFCFG2 */
#define HRTIMER_STXEXEVFCFG2_EXTEXCEN                 BIT(0)               /*!< external event X counter enable */
#define HRTIMER_STXEXEVFCFG2_EXTEXCRST                BIT(1)               /*!< external event X counter reset */
#define HRTIMER_STXEXEVFCFG2_EXTEXRSTM                BIT(2)               /*!< external event X reset mode */
#define HRTIMER_STXEXEVFCFG2_EXTEXSEL                 BITS(4,7)            /*!< external event X selection */
#define HRTIMER_STXEXEVFCFG2_EXTEXCNTTHR              BITS(8,13)           /*!< external event X counter threshold */
#define HRTIMER_STXEXEVFCFG2_EXTEXCNT                 BITS(26,31)          /*!< external event X counter */

/* HRTIMER_STXCAPTRGCOM */
#define HRTIMER_STXCAPTRGCOM_CP0BST5A                 BIT(0)               /*!< capture 0 triggered by ST5CH0_O output inactive to active transition */
#define HRTIMER_STXCAPTRGCOM_CP0BST5NA                BIT(1)               /*!< capture 0 triggered by ST5CH0_O output active to inactive transition */
#define HRTIMER_STXCAPTRGCOM_CP0BST5CMP0              BIT(2)               /*!< capture 0 triggered by compare 0 event of Slave_TIMER5 */
#define HRTIMER_STXCAPTRGCOM_CP0BST5CMP1              BIT(3)               /*!< capture 0 triggered by compare 1 event of Slave_TIMER5 */
#define HRTIMER_STXCAPTRGCOM_CP0BST6A                 BIT(4)               /*!< capture 0 triggered by ST6CH0_O output inactive to active transition */
#define HRTIMER_STXCAPTRGCOM_CP0BST6NA                BIT(5)               /*!< capture 0 triggered by ST6CH0_O output active to inactive transition */
#define HRTIMER_STXCAPTRGCOM_CP0BST6CMP0              BIT(6)               /*!< capture 0 triggered by compare 0 event of Slave_TIMER6 */
#define HRTIMER_STXCAPTRGCOM_CP0BST6CMP1              BIT(7)               /*!< capture 0 triggered by compare 1 event of Slave_TIMER6 */
#define HRTIMER_STXCAPTRGCOM_CP0BST7A                 BIT(8)               /*!< capture 0 triggered by ST7CH0_O output inactive to active transition */
#define HRTIMER_STXCAPTRGCOM_CP0BST7NA                BIT(9)               /*!< capture 0 triggered by ST7CH0_O output active to inactive transition */
#define HRTIMER_STXCAPTRGCOM_CP0BST7CMP0              BIT(10)              /*!< capture 0 triggered by compare 0 event of Slave_TIMER7 */
#define HRTIMER_STXCAPTRGCOM_CP0BST7CMP1              BIT(11)              /*!< capture 0 triggered by compare 1 event of Slave_TIMER7 */
#define HRTIMER_STXCAPTRGCOM_CP1BST5A                 BIT(16)              /*!< capture 1 triggered by ST5CH0_O output inactive to active transition */
#define HRTIMER_STXCAPTRGCOM_CP1BST5NA                BIT(17)              /*!< capture 1 triggered by ST5CH0_O output active to inactive transition */
#define HRTIMER_STXCAPTRGCOM_CP1BST5CMP0              BIT(18)              /*!< capture 1 triggered by compare 0 event of Slave_TIMER5 */
#define HRTIMER_STXCAPTRGCOM_CP1BST5CMP1              BIT(19)              /*!< capture 1 triggered by compare 1 event of Slave_TIMER5 */
#define HRTIMER_STXCAPTRGCOM_CP1BST6A                 BIT(20)              /*!< capture 1 triggered by ST6CH0_O output inactive to active transition */
#define HRTIMER_STXCAPTRGCOM_CP1BST6NA                BIT(21)              /*!< capture 1 triggered by ST6CH0_O output active to inactive transition */
#define HRTIMER_STXCAPTRGCOM_CP1BST6CMP0              BIT(22)              /*!< capture 1 triggered by compare 0 event of Slave_TIMER6 */
#define HRTIMER_STXCAPTRGCOM_CP1BST6CMP1              BIT(23)              /*!< capture 1 triggered by compare 1 event of Slave_TIMER6 */
#define HRTIMER_STXCAPTRGCOM_CP1BST7A                 BIT(24)              /*!< capture 1 triggered by ST7CH0_O output inactive to active transition */
#define HRTIMER_STXCAPTRGCOM_CP1BST7NA                BIT(25)              /*!< capture 1 triggered by ST7CH0_O output active to inactive transition */
#define HRTIMER_STXCAPTRGCOM_CP1BST7CMP0              BIT(26)              /*!< capture 1 triggered by compare 0 event of Slave_TIMER7 */
#define HRTIMER_STXCAPTRGCOM_CP1BST7CMP1              BIT(27)              /*!< capture 1 triggered by compare 1 event of Slave_TIMER7 */

/* HRTIMER_STxCNTRSTA */  
#define HRTIMER_STxCNTRSTA_CH0SSTEV9                  BIT(16)              /*!< Slave_TIMERx interconnection event 9 generates channel 0 set request */
#define HRTIMER_STxCNTRSTA_CH0SSTEV10                 BIT(17)              /*!< Slave_TIMERx interconnection event 10 generates channel 0 set request */
#define HRTIMER_STxCNTRSTA_CH1SSTEV9                  BIT(18)              /*!< Slave_TIMERx interconnection event 9 generates channel 1 set request */
#define HRTIMER_STxCNTRSTA_CH1SSTEV10                 BIT(19)              /*!< Slave_TIMERx interconnection event 10 generates channel 1 set request */
#define HRTIMER_STxCNTRSTA_CH0SSTCNTRST               BIT(20)              /*!< Slave_TIMERx count reset event generates channel 0 set request */
#define HRTIMER_STxCNTRSTA_CH1SSTCNTRST               BIT(21)              /*!< Slave_TIMERx count reset event generates channel 1 set request */
#define HRTIMER_STxCNTRSTA_CH0RSSTEV9                 BIT(24)              /*!< Slave_TIMERx interconnection event 9 generates channel 0 reset request */
#define HRTIMER_STxCNTRSTA_CH0RSSTEV10                BIT(25)              /*!< Slave_TIMERx interconnection event 10 generates channel 0 reset request */
#define HRTIMER_STxCNTRSTA_CH1RSSTEV9                 BIT(26)              /*!< Slave_TIMERx interconnection event 9 generates channel 1 reset request */
#define HRTIMER_STxCNTRSTA_CH1RSSTEV10                BIT(27)              /*!< Slave_TIMERx interconnection event 10 generates channel 1 reset request */
#define HRTIMER_STxCNTRSTA_CH0RSSTCNTRST              BIT(28)              /*!< Slave_TIMERx count reset event generates channel 0 reset request */
#define HRTIMER_STxCNTRSTA_CH1RSSTCNTRST              BIT(29)              /*!< Slave_TIMERx count reset event generates channel 1 reset request */

/* HRTIMER_ST0CNTRSTA For Slave_TIMER0 */
#define HRTIMER_ST0CNTRSTA_ST5CMP3RST                 BIT(0)               /*!< Slave_TIMER5 compare 3 event resets counter */
#define HRTIMER_ST0CNTRSTA_ST6CMP0RST                 BIT(1)               /*!< Slave_TIMER6 compare 0 event resets counter */
#define HRTIMER_ST0CNTRSTA_ST6CMP1RST                 BIT(2)               /*!< Slave_TIMER6 compare 1 event resets counter */
#define HRTIMER_ST0CNTRSTA_ST6CMP3RST                 BIT(3)               /*!< Slave_TIMER6 compare 3 event resets counter */
#define HRTIMER_ST0CNTRSTA_ST7CMP0RST                 BIT(4)               /*!< Slave_TIMER7 compare 0 event resets counter */
#define HRTIMER_ST0CNTRSTA_ST7CMP1RST                 BIT(5)               /*!< Slave_TIMER7 compare 1 event resets counter */
#define HRTIMER_ST0CNTRSTA_ST7CMP3RST                 BIT(6)               /*!< Slave_TIMER7 compare 3 event resets counter */

/* HRTIMER_ST1CNTRSTA For Slave_TIMER1 */
#define HRTIMER_ST1CNTRSTA_ST5CMP3RST                 BIT(0)               /*!< Slave_TIMER5 compare 3 event resets counter */
#define HRTIMER_ST1CNTRSTA_ST6CMP0RST                 BIT(1)               /*!< Slave_TIMER6 compare 0 event resets counter */
#define HRTIMER_ST1CNTRSTA_ST6CMP1RST                 BIT(2)               /*!< Slave_TIMER6 compare 1 event resets counter */
#define HRTIMER_ST1CNTRSTA_ST6CMP3RST                 BIT(3)               /*!< Slave_TIMER6 compare 3 event resets counter */
#define HRTIMER_ST1CNTRSTA_ST7CMP0RST                 BIT(4)               /*!< Slave_TIMER7 compare 0 event resets counter */
#define HRTIMER_ST1CNTRSTA_ST7CMP1RST                 BIT(5)               /*!< Slave_TIMER7 compare 1 event resets counter */
#define HRTIMER_ST1CNTRSTA_ST7CMP3RST                 BIT(6)               /*!< Slave_TIMER7 compare 3 event resets counter */

