wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER_ST2CNTRSTA For Slave_TIMER1 */
#define HRTIMER_ST2CNTRSTA_ST5CMP3RST                 BIT(0)               /*!< Slave_TIMER5 compare 3 event resets counter */
#define HRTIMER_ST2CNTRSTA_ST6CMP0RST                 BIT(1)               /*!< Slave_TIMER6 compare 0 event resets counter */
#define HRTIMER_ST2CNTRSTA_ST6CMP1RST                 BIT(2)               /*!< Slave_TIMER6 compare 1 event resets counter */
#define HRTIMER_ST2CNTRSTA_ST6CMP3RST                 BIT(3)               /*!< Slave_TIMER6 compare 3 event resets counter */
#define HRTIMER_ST2CNTRSTA_ST7CMP0RST                 BIT(4)               /*!< Slave_TIMER7 compare 0 event resets counter */
#define HRTIMER_ST2CNTRSTA_ST7CMP1RST                 BIT(5)               /*!< Slave_TIMER7 compare 1 event resets counter */
#define HRTIMER_ST2CNTRSTA_ST7CMP3RST                 BIT(6)               /*!< Slave_TIMER7 compare 3 event resets counter */

/* HRTIMER_ST3CNTRSTA For Slave_TIMER1 */
#define HRTIMER_ST3CNTRSTA_ST5CMP3RST                 BIT(0)               /*!< Slave_TIMER5 compare 3 event resets counter */
#define HRTIMER_ST3CNTRSTA_ST6CMP0RST                 BIT(1)               /*!< Slave_TIMER6 compare 0 event resets counter */
#define HRTIMER_ST3CNTRSTA_ST6CMP1RST                 BIT(2)               /*!< Slave_TIMER6 compare 1 event resets counter */
#define HRTIMER_ST3CNTRSTA_ST6CMP3RST                 BIT(3)               /*!< Slave_TIMER6 compare 3 event resets counter */
#define HRTIMER_ST3CNTRSTA_ST7CMP0RST                 BIT(4)               /*!< Slave_TIMER7 compare 0 event resets counter */
#define HRTIMER_ST3CNTRSTA_ST7CMP1RST                 BIT(5)               /*!< Slave_TIMER7 compare 1 event resets counter */
#define HRTIMER_ST3CNTRSTA_ST7CMP3RST                 BIT(6)               /*!< Slave_TIMER7 compare 3 event resets counter */

/* HRTIMER_ST4CNTRSTA For Slave_TIMER1 */
#define HRTIMER_ST4CNTRSTA_ST5CMP3RST                 BIT(0)               /*!< Slave_TIMER5 compare 3 event resets counter */
#define HRTIMER_ST4CNTRSTA_ST6CMP0RST                 BIT(1)               /*!< Slave_TIMER6 compare 0 event resets counter */
#define HRTIMER_ST4CNTRSTA_ST6CMP1RST                 BIT(2)               /*!< Slave_TIMER6 compare 1 event resets counter */
#define HRTIMER_ST4CNTRSTA_ST6CMP3RST                 BIT(3)               /*!< Slave_TIMER6 compare 3 event resets counter */
#define HRTIMER_ST4CNTRSTA_ST7CMP0RST                 BIT(4)               /*!< Slave_TIMER7 compare 0 event resets counter */
#define HRTIMER_ST4CNTRSTA_ST7CMP1RST                 BIT(5)               /*!< Slave_TIMER7 compare 1 event resets counter */
#define HRTIMER_ST4CNTRSTA_ST7CMP3RST                 BIT(6)               /*!< Slave_TIMER7 compare 3 event resets counter */

/* HRTIMER_ST5CNTRSTA */  
#define HRTIMER_ST5CNTRSTA_ST4CMP3RST                 BIT(0)               /*!< Slave_TIMER4 compare 3 event resets counter */
#define HRTIMER_ST5CNTRSTA_ST6CMP0RST                 BIT(1)               /*!< Slave_TIMER6 compare 0 event resets counter */
#define HRTIMER_ST5CNTRSTA_ST6CMP1RST                 BIT(2)               /*!< Slave_TIMER6 compare 1 event resets counter */
#define HRTIMER_ST5CNTRSTA_ST6CMP3RST                 BIT(3)               /*!< Slave_TIMER6 compare 3 event resets counter */
#define HRTIMER_ST5CNTRSTA_ST7CMP0RST                 BIT(4)               /*!< Slave_TIMER7 compare 0 event resets counter */
#define HRTIMER_ST5CNTRSTA_ST7CMP1RST                 BIT(5)               /*!< Slave_TIMER7 compare 1 event resets counter */
#define HRTIMER_ST5CNTRSTA_ST7CMP3RST                 BIT(6)               /*!< Slave_TIMER7 compare 3 event resets counter */
/* HRTIMER_ST6CNTRSTA */  
#define HRTIMER_ST6CNTRSTA_ST4CMP3RST                 BIT(0)               /*!< Slave_TIMER4 compare 3 event resets counter */
#define HRTIMER_ST6CNTRSTA_ST5CMP0RST                 BIT(1)               /*!< Slave_TIMER5 compare 0 event resets counter */
#define HRTIMER_ST6CNTRSTA_ST5CMP1RST                 BIT(2)               /*!< Slave_TIMER5 compare 1 event resets counter */
#define HRTIMER_ST6CNTRSTA_ST5CMP3RST                 BIT(3)               /*!< Slave_TIMER5 compare 3 event resets counter */
#define HRTIMER_ST6CNTRSTA_ST7CMP0RST                 BIT(4)               /*!< Slave_TIMER7 compare 0 event resets counter */
#define HRTIMER_ST6CNTRSTA_ST7CMP1RST                 BIT(5)               /*!< Slave_TIMER7 compare 1 event resets counter */
#define HRTIMER_ST6CNTRSTA_ST7CMP3RST                 BIT(6)               /*!< Slave_TIMER7 compare 3 event resets counter */
/* HRTIMER_ST7CNTRSTA */  
#define HRTIMER_ST7CNTRSTA_ST4CMP3RST                 BIT(0)               /*!< Slave_TIMER4 compare 3 event resets counter */
#define HRTIMER_ST7CNTRSTA_ST5CMP0RST                 BIT(1)               /*!< Slave_TIMER5 compare 0 event resets counter */
#define HRTIMER_ST7CNTRSTA_ST5CMP1RST                 BIT(2)               /*!< Slave_TIMER5 compare 1 event resets counter */
#define HRTIMER_ST7CNTRSTA_ST5CMP3RST                 BIT(3)               /*!< Slave_TIMER5 compare 3 event resets counter */
#define HRTIMER_ST7CNTRSTA_ST6CMP0RST                 BIT(4)               /*!< Slave_TIMER6 compare 0 event resets counter */
#define HRTIMER_ST7CNTRSTA_ST6CMP1RST                 BIT(5)               /*!< Slave_TIMER6 compare 1 event resets counter */
#define HRTIMER_ST7CNTRSTA_ST6CMP3RST                 BIT(6)               /*!< Slave_TIMER6 compare 3 event resets counter */

/* HRTIMER_STxACTL */
#define HRTIMER_STXACTL_UPBST6                        BIT(0)               /*!< update by Slave_TIMER6 update event */
#define HRTIMER_STXACTL_UPBST7                        BIT(1)               /*!< update by Slave_TIMER7 update event */
#define HRTIMER_STXACTL_FLTAR                         BIT(8)               /*!< fault automatic resume */
#define HRTIMER_STXACTL_DTRCFG15_9                    BITS(9,15)           /*!< rising edge dead-time value configure */
#define HRTIMER_STXACTL_DTFCFG15_9                    BITS(25,31)          /*!< falling edge dead-time value configure */

/* Common registers */
/* HRTIMER_CTL0 */
#define HRTIMER_CTL0_MTUPDIS                          BIT(0)               /*!< Master_TIMER update disable */
#define HRTIMER_CTL0_ST0UPDIS                         BIT(1)               /*!< Slave_TIMER0 update disable */
#define HRTIMER_CTL0_ST1UPDIS                         BIT(2)               /*!< Slave_TIMER1 update disable */
#define HRTIMER_CTL0_ST2UPDIS                         BIT(3)               /*!< Slave_TIMER2 update disable */
#define HRTIMER_CTL0_ST3UPDIS                         BIT(4)               /*!< Slave_TIMER3 update disable */
#define HRTIMER_CTL0_ST4UPDIS                         BIT(5)               /*!< Slave_TIMER4 update disable */
#define HRTIMER_CTL0_ST5UPDIS                         BIT(6)               /*!< Slave_TIMER5 update disable */
#define HRTIMER_CTL0_ST6UPDIS                         BIT(7)               /*!< Slave_TIMER6 update disable */
#define HRTIMER_CTL0_ST7UPDIS                         BIT(8)               /*!< Slave_TIMER7 update disable */
#define HRTIMER_CTL0_ADTG0USRC0_2                     BITS(16,18)          /*!< HRTIMER_ADCTRIG0 update source */
#define HRTIMER_CTL0_ADTG1USRC0_2                     BITS(19,21)          /*!< HRTIMER_ADCTRIG1 update source */
#define HRTIMER_CTL0_ADTG2USRC0_2                     BITS(22,24)          /*!< HRTIMER_ADCTRIG2 update source */
#define HRTIMER_CTL0_ADTG3USRC0_2                     BITS(25,27)          /*!< HRTIMER_ADCTRIG3 update source */
#define HRTIMER_CTL0_ADTG0USRC3                       BIT(28)              /*!< HRTIMER_ADCTRIG0 update source */
#define HRTIMER_CTL0_ADTG1USRC3                       BIT(29)              /*!< HRTIMER_ADCTRIG1 update source */
#define HRTIMER_CTL0_ADTG2USRC3                       BIT(30)              /*!< HRTIMER_ADCTRIG2 update source */
#define HRTIMER_CTL0_ADTG3USRC3                       BIT(31)              /*!< HRTIMER_ADCTRIG3 update source */

/* HRTIMER_CTL1 */
#define HRTIMER_CTL1_MTSUP                            BIT(0)               /*!< Master_TIMER software update */
#define HRTIMER_CTL1_ST0SUP                           BIT(1)               /*!< Slave_TIMER0 software update */
#define HRTIMER_CTL1_ST1SUP                           BIT(2)               /*!< Slave_TIMER1 software update */
#define HRTIMER_CTL1_ST2SUP                           BIT(3)               /*!< Slave_TIMER2 software update */
#define HRTIMER_CTL1_ST3SUP                           BIT(4)               /*!< Slave_TIMER3 software update */
#define HRTIMER_CTL1_ST4SUP                           BIT(5)               /*!< Slave_TIMER4 software update */
#define HRTIMER_CTL1_ST5SUP                           BIT(6)               /*!< Slave_TIMER5 software update */
#define HRTIMER_CTL1_ST6SUP                           BIT(7)               /*!< Slave_TIMER6 software update */
#define HRTIMER_CTL1_MTSRST                           BIT(8)               /*!< Master_TIMER software reset */
#define HRTIMER_CTL1_ST0SRST                          BIT(9)               /*!< Slave_TIMER0 software reset */
#define HRTIMER_CTL1_ST1SRST                          BIT(10)              /*!< Slave_TIMER1 software reset */
#define HRTIMER_CTL1_ST2SRST                          BIT(11)              /*!< Slave_TIMER2 software reset */
#define HRTIMER_CTL1_ST3SRST                          BIT(12)              /*!< Slave_TIMER3 software reset */
#define HRTIMER_CTL1_ST4SRST                          BIT(13)              /*!< Slave_TIMER4 software reset */
#define HRTIMER_CTL1_ST5SRST                          BIT(14)              /*!< Slave_TIMER5 software reset */
#define HRTIMER_CTL1_ST6SRST                          BIT(15)              /*!< Slave_TIMER6 software reset */
#define HRTIMER_CTL1_EXC0                             BIT(16)              /*!< exchange Slave_TIMER0 outputs */
#define HRTIMER_CTL1_EXC1                             BIT(17)              /*!< exchange Slave_TIMER1 outputs */
#define HRTIMER_CTL1_EXC2                             BIT(18)              /*!< exchange Slave_TIMER2 outputs */
#define HRTIMER_CTL1_EXC3                             BIT(19)              /*!< exchange Slave_TIMER3 outputs */
#define HRTIMER_CTL1_EXC4                             BIT(20)              /*!< exchange Slave_TIMER4 outputs */
#define HRTIMER_CTL1_EXC5                             BIT(21)              /*!< exchange Slave_TIMER5 outputs */
#define HRTIMER_CTL1_EXC6                             BIT(22)              /*!< exchange Slave_TIMER6 outputs */
#define HRTIMER_CTL1_EXC7                             BIT(23)              /*!< exchange Slave_TIMER7 outputs */
#define HRTIMER_CTL1_ST7SUP                           BIT(28)              /*!< Slave_TIMER7 software update */
#define HRTIMER_CTL1_ST7SRST                          BIT(29)              /*!< Slave_TIMER7 software reset */

