wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER_INTF */
#define HRTIMER_INTF_FLT0IF                           BIT(0)               /*!< fault 0 interrupt flag */
#define HRTIMER_INTF_FLT1IF                           BIT(1)               /*!< fault 1 interrupt flag */
#define HRTIMER_INTF_FLT2IF                           BIT(2)               /*!< fault 2 interrupt flag */
#define HRTIMER_INTF_FLT3IF                           BIT(3)               /*!< fault 3 interrupt flag */
#define HRTIMER_INTF_FLT4IF                           BIT(4)               /*!< fault 4 interrupt flag */
#define HRTIMER_INTF_SYSFLTIF                         BIT(5)               /*!< system fault interrupt flag */
#define HRTIMER_INTF_FLT5IF                           BIT(6)               /*!< fault 5 interrupt flag */
#define HRTIMER_INTF_FLT6IF                           BIT(7)               /*!< fault 6 interrupt flag */
#define HRTIMER_INTF_FLT7IF                           BIT(8)               /*!< fault 7 interrupt flag */
#define HRTIMER_INTF_DLLCALIF                         BIT(16)              /*!< DLL calibration completed interrupt flag */
#define HRTIMER_INTF_BMPERIF                          BIT(17)              /*!< bunch mode period interrupt flag */

/* HRTIMER_INTC */
#define HRTIMER_INTC_FLT0IFC                          BIT(0)               /*!< clear fault 0 interrupt flag */
#define HRTIMER_INTC_FLT1IFC                          BIT(1)               /*!< clear fault 1 interrupt flag */
#define HRTIMER_INTC_FLT2IFC                          BIT(2)               /*!< clear fault 2 interrupt flag */
#define HRTIMER_INTC_FLT3IFC                          BIT(3)               /*!< clear fault 3 interrupt flag */
#define HRTIMER_INTC_FLT4IFC                          BIT(4)               /*!< clear fault 4 interrupt flag */
#define HRTIMER_INTC_SYSFLTIFC                        BIT(5)               /*!< clear system fault interrupt flag */
#define HRTIMER_INTC_FLT5IFC                          BIT(6)               /*!< clear fault 5 interrupt flag */
#define HRTIMER_INTC_FLT6IFC                          BIT(7)               /*!< clear fault 6 interrupt flag */
#define HRTIMER_INTC_FLT7IFC                          BIT(8)               /*!< clear fault 7 interrupt flag */
#define HRTIMER_INTC_DLLCALIFC                        BIT(16)              /*!< clear DLL calibration completed interrupt flag */
#define HRTIMER_INTC_BMPERIFC                         BIT(17)              /*!< clear bunch mode period interrupt flag */

/* HRTIMER_INTEN */
#define HRTIMER_INTEN_FLT0IE                          BIT(0)               /*!< fault 0 interrupt enable */
#define HRTIMER_INTEN_FLT1IE                          BIT(1)               /*!< fault 1 interrupt enable */
#define HRTIMER_INTEN_FLT2IE                          BIT(2)               /*!< fault 2 interrupt enable */
#define HRTIMER_INTEN_FLT3IE                          BIT(3)               /*!< fault 3 interrupt enable */
#define HRTIMER_INTEN_FLT4IE                          BIT(4)               /*!< fault 4 interrupt enable */
#define HRTIMER_INTEN_SYSFLTIE                        BIT(5)               /*!< system fault interrupt enable */
#define HRTIMER_INTEN_FLT5IE                          BIT(6)               /*!< fault 5 interrupt enable */
#define HRTIMER_INTEN_FLT6IE                          BIT(7)               /*!< fault 6 interrupt enable */
#define HRTIMER_INTEN_FLT7IE                          BIT(8)               /*!< fault 7 interrupt enable */
#define HRTIMER_INTEN_DLLCALIE                        BIT(16)              /*!< DLL calibration completed interrupt enable */
#define HRTIMER_INTEN_BMPERIE                         BIT(17)              /*!< bunch mode period interrupt enable */

/* HRTIMER_CHOUTEN */
#define HRTIMER_CHOUTEN_ST0CH0EN                      BIT(0)               /*!< Slave_TIMER0 channel 0 output (ST0CH0_O) enable */
#define HRTIMER_CHOUTEN_ST0CH1EN                      BIT(1)               /*!< Slave_TIMER0 channel 1 output (ST0CH1_O) enable */
#define HRTIMER_CHOUTEN_ST1CH0EN                      BIT(2)               /*!< Slave_TIMER1 channel 0 output (ST1CH0_O) enable */
#define HRTIMER_CHOUTEN_ST1CH1EN                      BIT(3)               /*!< Slave_TIMER1 channel 1 output (ST1CH1_O) enable */
#define HRTIMER_CHOUTEN_ST2CH0EN                      BIT(4)               /*!< Slave_TIMER2 channel 0 output (ST2CH0_O) enable */
#define HRTIMER_CHOUTEN_ST2CH1EN                      BIT(5)               /*!< Slave_TIMER2 channel 1 output (ST2CH1_O) enable */
#define HRTIMER_CHOUTEN_ST3CH0EN                      BIT(6)               /*!< Slave_TIMER3 channel 0 output (ST3CH0_O) enable */
#define HRTIMER_CHOUTEN_ST3CH1EN                      BIT(7)               /*!< Slave_TIMER3 channel 1 output (ST3CH1_O) enable */
#define HRTIMER_CHOUTEN_ST4CH0EN                      BIT(8)               /*!< Slave_TIMER4 channel 0 output (ST4CH0_O) enable */
#define HRTIMER_CHOUTEN_ST4CH1EN                      BIT(9)               /*!< Slave_TIMER4 channel 1 output (ST4CH1_O) enable */
#define HRTIMER_CHOUTEN_ST5CH0EN                      BIT(10)              /*!< Slave_TIMER5 channel 0 output (ST5CH0_O) enable */
#define HRTIMER_CHOUTEN_ST5CH1EN                      BIT(11)              /*!< Slave_TIMER5 channel 1 output (ST5CH1_O) enable */
#define HRTIMER_CHOUTEN_ST6CH0EN                      BIT(12)              /*!< Slave_TIMER6 channel 0 output (ST6CH0_O) enable */
#define HRTIMER_CHOUTEN_ST6CH1EN                      BIT(13)              /*!< Slave_TIMER6 channel 1 output (ST6CH1_O) enable */
#define HRTIMER_CHOUTEN_ST7CH0EN                      BIT(14)              /*!< Slave_TIMER7 channel 0 output (ST7CH0_O) enable */
#define HRTIMER_CHOUTEN_ST7CH1EN                      BIT(15)              /*!< Slave_TIMER7 channel 1 output (ST7CH1_O) enable */

/* HRTIMER_CHOUTDIS */
#define HRTIMER_CHOUTDIS_ST0CH0DIS                    BIT(0)               /*!< Slave_TIMER0 channel 0 output (ST0CH0_O) disable */
#define HRTIMER_CHOUTDIS_ST0CH1DIS                    BIT(1)               /*!< Slave_TIMER0 channel 1 output (ST0CH1_O) disable */
#define HRTIMER_CHOUTDIS_ST1CH0DIS                    BIT(2)               /*!< Slave_TIMER1 channel 0 output (ST1CH0_O) disable */
#define HRTIMER_CHOUTDIS_ST1CH1DIS                    BIT(3)               /*!< Slave_TIMER1 channel 1 output (ST1CH1_O) disable */
#define HRTIMER_CHOUTDIS_ST2CH0DIS                    BIT(4)               /*!< Slave_TIMER2 channel 0 output (ST2CH0_O) disable */
#define HRTIMER_CHOUTDIS_ST2CH1DIS                    BIT(5)               /*!< Slave_TIMER2 channel 1 output (ST2CH1_O) disable */
#define HRTIMER_CHOUTDIS_ST3CH0DIS                    BIT(6)               /*!< Slave_TIMER3 channel 0 output (ST3CH0_O) disable */
#define HRTIMER_CHOUTDIS_ST3CH1DIS                    BIT(7)               /*!< Slave_TIMER3 channel 1 output (ST3CH1_O) disable */
#define HRTIMER_CHOUTDIS_ST4CH0DIS                    BIT(8)               /*!< Slave_TIMER4 channel 0 output (ST4CH0_O) disable */
#define HRTIMER_CHOUTDIS_ST4CH1DIS                    BIT(9)               /*!< Slave_TIMER4 channel 1 output (ST4CH1_O) disable */
#define HRTIMER_CHOUTDIS_ST5CH0DIS                    BIT(10)              /*!< Slave_TIMER5 channel 0 output (ST5CH0_O) disable */
#define HRTIMER_CHOUTDIS_ST5CH1DIS                    BIT(11)              /*!< Slave_TIMER5 channel 1 output (ST5CH1_O) disable */
#define HRTIMER_CHOUTDIS_ST6CH0DIS                    BIT(12)              /*!< Slave_TIMER6 channel 0 output (ST6CH0_O) disable */
#define HRTIMER_CHOUTDIS_ST6CH1DIS                    BIT(13)              /*!< Slave_TIMER6 channel 1 output (ST6CH1_O) disable */
#define HRTIMER_CHOUTDIS_ST7CH0DIS                    BIT(14)              /*!< Slave_TIMER7 channel 0 output (ST7CH0_O) disable */
#define HRTIMER_CHOUTDIS_ST7CH1DIS                    BIT(15)              /*!< Slave_TIMER7 channel 1 output (ST7CH1_O) disable */

/* HRTIMER_CHOUTDISF */
#define HRTIMER_CHOUTDISF_ST0CH0DISF                  BIT(0)               /*!< Slave_TIMER0 channel 0 output (ST0CH0_O) disable flag */
#define HRTIMER_CHOUTDISF_ST0CH1DISF                  BIT(1)               /*!< Slave_TIMER0 channel 1 output (ST0CH1_O) disable flag */
#define HRTIMER_CHOUTDISF_ST1CH0DISF                  BIT(2)               /*!< Slave_TIMER1 channel 0 output (ST1CH0_O) disable flag */
#define HRTIMER_CHOUTDISF_ST1CH1DISF                  BIT(3)               /*!< Slave_TIMER1 channel 1 output (ST1CH1_O) disable flag */
#define HRTIMER_CHOUTDISF_ST2CH0DISF                  BIT(4)               /*!< Slave_TIMER2 channel 0 output (ST2CH0_O) disable flag */
#define HRTIMER_CHOUTDISF_ST2CH1DISF                  BIT(5)               /*!< Slave_TIMER2 channel 1 output (ST2CH1_O) disable flag */
#define HRTIMER_CHOUTDISF_ST3CH0DISF                  BIT(6)               /*!< Slave_TIMER3 channel 0 output (ST3CH0_O) disable flag */
#define HRTIMER_CHOUTDISF_ST3CH1DISF                  BIT(7)               /*!< Slave_TIMER3 channel 1 output (ST3CH1_O) disable flag */
#define HRTIMER_CHOUTDISF_ST4CH0DISF                  BIT(8)               /*!< Slave_TIMER4 channel 0 output (ST4CH0_O) disable flag */
#define HRTIMER_CHOUTDISF_ST4CH1DISF                  BIT(9)               /*!< Slave_TIMER4 channel 1 output (ST4CH1_O) disable flag */
#define HRTIMER_CHOUTDISF_ST5CH0DISF                  BIT(10)              /*!< Slave_TIMER5 channel 0 output (ST5CH0_O) disable flag */
#define HRTIMER_CHOUTDISF_ST5CH1DISF                  BIT(11)              /*!< Slave_TIMER5 channel 1 output (ST5CH1_O) disable flag */
#define HRTIMER_CHOUTDISF_ST6CH0DISF                  BIT(12)              /*!< Slave_TIMER6 channel 0 output (ST6CH0_O) disable flag */
#define HRTIMER_CHOUTDISF_ST6CH1DISF                  BIT(13)              /*!< Slave_TIMER6 channel 1 output (ST6CH1_O) disable flag */
#define HRTIMER_CHOUTDISF_ST7CH0DISF                  BIT(14)              /*!< Slave_TIMER7 channel 0 output (ST7CH0_O) disable flag */
#define HRTIMER_CHOUTDISF_ST7CH1DISF                  BIT(15)              /*!< Slave_TIMER7 channel 1 output (ST7CH1_O) disable flag */

/* HRTIMER_BMCTL */
#define HRTIMER_BMCTL_BMEN                            BIT(0)               /*!< bunch mode enable */
#define HRTIMER_BMCTL_BMCTN                           BIT(1)               /*!< continuous mode in bunch mode */
#define HRTIMER_BMCTL_BMCLKS                          BITS(2,5)            /*!< bunch mode clock source */
#define HRTIMER_BMCTL_BMPSC                           BITS(6,9)            /*!< bunch mode clock division */
#define HRTIMER_BMCTL_BMSE                            BIT(10)              /*!< bunch mode shadow enable */
#define HRTIMER_BMCTL_BMMT                            BIT(16)              /*!< Master_TIMER bunch mode */
#define HRTIMER_BMCTL_BMST0                           BIT(17)              /*!< Slave_TIMER0 bunch mode */
#define HRTIMER_BMCTL_BMST1                           BIT(18)              /*!< Slave_TIMER1 bunch mode */
#define HRTIMER_BMCTL_BMST2                           BIT(19)              /*!< Slave_TIMER2 bunch mode */
#define HRTIMER_BMCTL_BMST3                           BIT(20)              /*!< Slave_TIMER3 bunch mode */
#define HRTIMER_BMCTL_BMST4                           BIT(21)              /*!< Slave_TIMER4 bunch mode */
#define HRTIMER_BMCTL_BMST5                           BIT(22)              /*!< Slave_TIMER5 bunch mode */
#define HRTIMER_BMCTL_BMST6                           BIT(23)              /*!< Slave_TIMER6 bunch mode */
#define HRTIMER_BMCTL_BMST7                           BIT(24)              /*!< Slave_TIMER7 bunch mode */
#define HRTIMER_BMCTL_BMOPTF                          BIT(31)              /*!< bunch mode operating flag */

/* HRTIMER_BMSTRG */
#define HRTIMER_BMSTRG_SWTRG                          BIT(0)               /*!< software triggers bunch mode operation */
#define HRTIMER_BMSTRG_MTRST                          BIT(1)               /*!< Master_TIMER reset event triggers bunch mode operation */
#define HRTIMER_BMSTRG_MTREP                          BIT(2)               /*!< Master_TIMER repetition event triggers bunch mode operation */
#define HRTIMER_BMSTRG_MTCMP0                         BIT(3)               /*!< Master_TIMER compare 0 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_MTCMP1                         BIT(4)               /*!< Master_TIMER compare 1 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_MTCMP2                         BIT(5)               /*!< Master_TIMER compare 2 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_MTCMP3                         BIT(6)               /*!< Master_TIMER compare 3 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST0RST                         BIT(7)               /*!< Slave_TIMER0 reset event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST0REP                         BIT(8)               /*!< Slave_TIMER0 repetition event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST0CMP0                        BIT(9)               /*!< Slave_TIMER0 compare 0 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST0CMP1                        BIT(10)              /*!< Slave_TIMER0 compare 1 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST1RST                         BIT(11)              /*!< Slave_TIMER1 reset event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST1REP                         BIT(12)              /*!< Slave_TIMER1 repetition event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST1CMP0                        BIT(13)              /*!< Slave_TIMER1 compare 0 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST1CMP1                        BIT(14)              /*!< Slave_TIMER1 compare 1 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST2RST                         BIT(15)              /*!< Slave_TIMER2 reset event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST2REP                         BIT(16)              /*!< Slave_TIMER2 repetition event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST2CMP0                        BIT(17)              /*!< Slave_TIMER2 compare 0 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST2CMP1                        BIT(18)              /*!< Slave_TIMER2 compare 1 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST3RST                         BIT(19)              /*!< Slave_TIMER3 reset event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST3REP                         BIT(20)              /*!< Slave_TIMER3 repetition event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST3CMP0                        BIT(21)              /*!< Slave_TIMER3 compare 0 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST3CMP1                        BIT(22)              /*!< Slave_TIMER3 compare 1 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST4RST                         BIT(23)              /*!< Slave_TIMER4 reset event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST4REP                         BIT(24)              /*!< Slave_TIMER4 repetition event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST4CMP0                        BIT(25)              /*!< Slave_TIMER4 compare 0 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST4CMP1                        BIT(26)              /*!< Slave_TIMER4 compare 1 event triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST0EXEV6                       BIT(27)              /*!< Slave_TIMER0 period event following external event 6 triggers bunch mode operation */
#define HRTIMER_BMSTRG_ST3EXEV7                       BIT(28)              /*!< Slave_TIMER3 period event following external event 7 triggers bunch mode operation */
#define HRTIMER_BMSTRG_EXEV6                          BIT(29)              /*!< external event 6 triggers bunch mode operation */
#define HRTIMER_BMSTRG_EXEV7                          BIT(30)              /*!< external event 7 triggers bunch mode operation */
#define HRTIMER_BMSTRG_CISGN                          BIT(31)              /*!< chip internal signal triggers bunch mode operation */

