wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER_BMCMPV */
#define HRTIMER_BMCMPV_BMCMPVAL                       BITS(0,15)           /*!< bunch mode compare value */

/* HRTIMER_BMCAR */
#define HRTIMER_BMCAR_BMCARL                          BITS(0,15)           /*!< bunch mode counter auto reload value */

/* HRTIMER_EXEVCFG0 */
#define HRTIMER_EXEVCFG0_EXEV0SRC                     BITS(0,1)            /*!< external event 0 source */
#define HRTIMER_EXEVCFG0_EXEV0P                       BIT(2)               /*!< external event 0 polarity */
#define HRTIMER_EXEVCFG0_EXEV0EG                      BITS(3,4)            /*!< external event 0 edge sensitivity */
#define HRTIMER_EXEVCFG0_EXEV0FAST                    BIT(5)               /*!< external event 0 fast mode */
#define HRTIMER_EXEVCFG0_EXEV1SRC                     BITS(6,7)            /*!< external event 1 source */
#define HRTIMER_EXEVCFG0_EXEV1P                       BIT(8)               /*!< external event 1 polarity */
#define HRTIMER_EXEVCFG0_EXEV1EG                      BITS(9,10)           /*!< external event 1 edge sensitivity */
#define HRTIMER_EXEVCFG0_EXEV1FAST                    BIT(11)              /*!< external event 1 fast mode */
#define HRTIMER_EXEVCFG0_EXEV2SRC                     BITS(12,13)          /*!< external event 2 source */
#define HRTIMER_EXEVCFG0_EXEV2P                       BIT(14)              /*!< external event 2 polarity */
#define HRTIMER_EXEVCFG0_EXEV2EG                      BITS(15,16)          /*!< external event 2 edge sensitivity */
#define HRTIMER_EXEVCFG0_EXEV2FAST                    BIT(17)              /*!< external event 2 fast mode */
#define HRTIMER_EXEVCFG0_EXEV3SRC                     BITS(18,19)          /*!< external event 3 source */
#define HRTIMER_EXEVCFG0_EXEV3P                       BIT(20)              /*!< external event 3 polarity */
#define HRTIMER_EXEVCFG0_EXEV3EG                      BITS(21,22)          /*!< external event 3 edge sensitivity */
#define HRTIMER_EXEVCFG0_EXEV3FAST                    BIT(17)              /*!< external event 3 fast mode */
#define HRTIMER_EXEVCFG0_EXEV4SRC                     BITS(24,25)          /*!< external event 4 source */
#define HRTIMER_EXEVCFG0_EXEV4P                       BIT(26)              /*!< external event 4 polarity */
#define HRTIMER_EXEVCFG0_EXEV4EG                      BITS(27,28)          /*!< external event 4 edge sensitivity */
#define HRTIMER_EXEVCFG0_EXEV4FAST                    BIT(29)              /*!< external event 4 fast mode */

/* HRTIMER_EXEVCFG1 */
#define HRTIMER_EXEVCFG1_EXEV5SRC                     BITS(0,1)            /*!< external event 5 source */
#define HRTIMER_EXEVCFG1_EXEV5P                       BIT(2)               /*!< external event 5 polarity */
#define HRTIMER_EXEVCFG1_EXEV5EG                      BITS(3,4)            /*!< external event 5 edge sensitivity */
#define HRTIMER_EXEVCFG1_EXEV6SRC                     BITS(6,7)            /*!< external event 6 source */
#define HRTIMER_EXEVCFG1_EXEV6P                       BIT(8)               /*!< external event 6 polarity */
#define HRTIMER_EXEVCFG1_EXEV6EG                      BITS(9,10)           /*!< external event 6 edge sensitivity */
#define HRTIMER_EXEVCFG1_EXEV7SRC                     BITS(12,13)          /*!< external event 7 source */
#define HRTIMER_EXEVCFG1_EXEV7P                       BIT(14)              /*!< external event 7 polarity */
#define HRTIMER_EXEVCFG1_EXEV7EG                      BITS(15,16)          /*!< external event 7 edge sensitivity */
#define HRTIMER_EXEVCFG1_EXEV8SRC                     BITS(18,19)          /*!< external event 8 source */
#define HRTIMER_EXEVCFG1_EXEV8P                       BIT(20)              /*!< external event 8 polarity */
#define HRTIMER_EXEVCFG1_EXEV8EG                      BITS(21,22)          /*!< external event 8 edge sensitivity */
#define HRTIMER_EXEVCFG1_EXEV9SRC                     BITS(24,25)          /*!< external event 9 source */
#define HRTIMER_EXEVCFG1_EXEV9P                       BIT(26)              /*!< external event 9 polarity */
#define HRTIMER_EXEVCFG1_EXEV9EG                      BITS(27,28)          /*!< external event 9 edge sensitivity */

/* HRTIMER_EXEVDFCTL */
#define HRTIMER_EXEVDFCTL_EXEV5FC                     BITS(0,3)            /*!< external event 5 filter control */
#define HRTIMER_EXEVDFCTL_EXEV6FC                     BITS(6,9)            /*!< external event 6 filter control */
#define HRTIMER_EXEVDFCTL_EXEV7FC                     BITS(12,15)          /*!< external event 7 filter control */
#define HRTIMER_EXEVDFCTL_EXEV8FC                     BITS(18,21)          /*!< external event 8 filter control */
#define HRTIMER_EXEVDFCTL_EXEV9FC                     BITS(24,27)          /*!< external event 9 filter control */
#define HRTIMER_EXEVDFCTL_EXEVFDIV                    BITS(30,31)          /*!< external event digital filter clock division */

/* HRTIMER_ADCTRIGS0 */
#define HRTIMER_ADCTRIGS0_TRG0MTC0                    BIT(0)               /*!< HRTIMER_ADCTRIG0 on Master_TIMER compare 0 event */
#define HRTIMER_ADCTRIGS0_TRG0MTC1                    BIT(1)               /*!< HRTIMER_ADCTRIG0 on Master_TIMER compare 1 event */
#define HRTIMER_ADCTRIGS0_TRG0MTC2                    BIT(2)               /*!< HRTIMER_ADCTRIG0 on Master_TIMER compare 2 event */
#define HRTIMER_ADCTRIGS0_TRG0MTC3                    BIT(3)               /*!< HRTIMER_ADCTRIG0 on Master_TIMER compare 3 event */
#define HRTIMER_ADCTRIGS0_TRG0MTPER                   BIT(4)               /*!< HRTIMER_ADCTRIG0 on Master_TIMER period event */
#define HRTIMER_ADCTRIGS0_TRG0EXEV0                   BIT(5)               /*!< HRTIMER_ADCTRIG0 on external event 0 */
#define HRTIMER_ADCTRIGS0_TRG0EXEV1                   BIT(6)               /*!< HRTIMER_ADCTRIG0 on external event 1 */
#define HRTIMER_ADCTRIGS0_TRG0EXEV2                   BIT(7)               /*!< HRTIMER_ADCTRIG0 on external event 2 */
#define HRTIMER_ADCTRIGS0_TRG0EXEV3                   BIT(8)               /*!< HRTIMER_ADCTRIG0 on external event 3 */
#define HRTIMER_ADCTRIGS0_TRG0EXEV4                   BIT(9)               /*!< HRTIMER_ADCTRIG0 on external event 4 */
#define HRTIMER_ADCTRIGS0_TRG0ST0C1                   BIT(10)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER0 compare 1 event */
#define HRTIMER_ADCTRIGS0_TRG0ST0C2                   BIT(11)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER0 compare 2 event */
#define HRTIMER_ADCTRIGS0_TRG0ST0C3                   BIT(12)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER0 compare 3 event */
#define HRTIMER_ADCTRIGS0_TRG0ST0PER                  BIT(13)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER0 period event */
#define HRTIMER_ADCTRIGS0_TRG0ST0RST                  BIT(14)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER0 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS0_TRG0ST1C1                   BIT(15)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER1 compare 1 event */
#define HRTIMER_ADCTRIGS0_TRG0ST1C2                   BIT(16)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER1 compare 2 event */
#define HRTIMER_ADCTRIGS0_TRG0ST1C3                   BIT(17)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER1 compare 3 event */
#define HRTIMER_ADCTRIGS0_TRG0ST1PER                  BIT(18)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER1 period event */
#define HRTIMER_ADCTRIGS0_TRG0ST1RST                  BIT(19)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER1 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS0_TRG0ST2C1                   BIT(20)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER2 compare 1 event */
#define HRTIMER_ADCTRIGS0_TRG0ST2C2                   BIT(21)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER2 compare 2 event */
#define HRTIMER_ADCTRIGS0_TRG0ST2C3                   BIT(22)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER2 compare 3 event */
#define HRTIMER_ADCTRIGS0_TRG0ST2PER                  BIT(23)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER2 period event */
#define HRTIMER_ADCTRIGS0_TRG0ST3C1                   BIT(24)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER3 compare 1 event */
#define HRTIMER_ADCTRIGS0_TRG0ST3C2                   BIT(25)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER3 compare 2 event */
#define HRTIMER_ADCTRIGS0_TRG0ST3C3                   BIT(26)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER3 compare 3 event */
#define HRTIMER_ADCTRIGS0_TRG0ST3PER                  BIT(27)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER3 period event */
#define HRTIMER_ADCTRIGS0_TRG0ST4C1                   BIT(28)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER4 compare 1 event */
#define HRTIMER_ADCTRIGS0_TRG0ST4C2                   BIT(29)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER4 compare 2 event */
#define HRTIMER_ADCTRIGS0_TRG0ST4C3                   BIT(30)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER4 compare 3 event */
#define HRTIMER_ADCTRIGS0_TRG0ST4PER                  BIT(31)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER4 period event */

/* HRTIMER_ADCTRIGS1 */
#define HRTIMER_ADCTRIGS1_TRG1MTC0                    BIT(0)               /*!< HRTIMER_ADCTRIG1 on Master_TIMER compare 0 event */
#define HRTIMER_ADCTRIGS1_TRG1MTC1                    BIT(1)               /*!< HRTIMER_ADCTRIG1 on Master_TIMER compare 1 event */
#define HRTIMER_ADCTRIGS1_TRG1MTC2                    BIT(2)               /*!< HRTIMER_ADCTRIG1 on Master_TIMER compare 2 event */
#define HRTIMER_ADCTRIGS1_TRG1MTC3                    BIT(3)               /*!< HRTIMER_ADCTRIG1 on Master_TIMER compare 3 event */
#define HRTIMER_ADCTRIGS1_TRG1MTPER                   BIT(4)               /*!< HRTIMER_ADCTRIG1 on Master_TIMER period event */
#define HRTIMER_ADCTRIGS1_TRG1EXEV5                   BIT(5)               /*!< HRTIMER_ADCTRIG1 on external event 5 */
#define HRTIMER_ADCTRIGS1_TRG1EXEV6                   BIT(6)               /*!< HRTIMER_ADCTRIG1 on external event 6 */
#define HRTIMER_ADCTRIGS1_TRG1EXEV7                   BIT(7)               /*!< HRTIMER_ADCTRIG1 on external event 7 */
#define HRTIMER_ADCTRIGS1_TRG1EXEV8                   BIT(8)               /*!< HRTIMER_ADCTRIG1 on external event 8 */
#define HRTIMER_ADCTRIGS1_TRG1EXEV9                   BIT(9)               /*!< HRTIMER_ADCTRIG1 on external event 9 */
#define HRTIMER_ADCTRIGS1_TRG1ST0C1                   BIT(10)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER0 compare 1 event */
#define HRTIMER_ADCTRIGS1_TRG1ST0C2                   BIT(11)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER0 compare 2 event */
#define HRTIMER_ADCTRIGS1_TRG1ST0C3                   BIT(12)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER0 compare 3 event */
#define HRTIMER_ADCTRIGS1_TRG1ST0PER                  BIT(13)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER0 period event */
#define HRTIMER_ADCTRIGS1_TRG1ST1C1                   BIT(14)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER1 compare 1 event */
#define HRTIMER_ADCTRIGS1_TRG1ST1C2                   BIT(15)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER1 compare 2 event */
#define HRTIMER_ADCTRIGS1_TRG1ST1C3                   BIT(16)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER1 compare 3 event */
#define HRTIMER_ADCTRIGS1_TRG1ST1PER                  BIT(17)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER1 period event */
#define HRTIMER_ADCTRIGS1_TRG1ST2C1                   BIT(18)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER2 compare 1 event */
#define HRTIMER_ADCTRIGS1_TRG1ST2C2                   BIT(19)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER2 compare 2 event */
#define HRTIMER_ADCTRIGS1_TRG1ST2C3                   BIT(20)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER2 compare 3 event */
#define HRTIMER_ADCTRIGS1_TRG1ST2PER                  BIT(21)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER2 period event */
#define HRTIMER_ADCTRIGS1_TRG1ST2RST                  BIT(22)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER2 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS1_TRG1ST3C1                   BIT(23)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER3 compare 1 event */
#define HRTIMER_ADCTRIGS1_TRG1ST3C2                   BIT(24)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER3 compare 2 event */
#define HRTIMER_ADCTRIGS1_TRG1ST3C3                   BIT(25)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER3 compare 3 event */
#define HRTIMER_ADCTRIGS1_TRG1ST3PER                  BIT(26)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER3 period event */
#define HRTIMER_ADCTRIGS1_TRG1ST3RST                  BIT(27)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER3 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS1_TRG1ST4C1                   BIT(28)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER4 compare 1 event */
#define HRTIMER_ADCTRIGS1_TRG1ST4C2                   BIT(29)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER4 compare 2 event */
#define HRTIMER_ADCTRIGS1_TRG1ST4C3                   BIT(30)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER4 compare 3 event */
#define HRTIMER_ADCTRIGS1_TRG1ST4RST                  BIT(31)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER4 reset and counter roll-over event */

