wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER_ADCTRIGS2 */
#define HRTIMER_ADCTRIGS2_TRG2MTC0                    BIT(0)               /*!< HRTIMER_ADCTRIG2 on Master_TIMER compare 0 event */
#define HRTIMER_ADCTRIGS2_TRG2MTC1                    BIT(1)               /*!< HRTIMER_ADCTRIG2 on Master_TIMER compare 1 event */
#define HRTIMER_ADCTRIGS2_TRG2MTC2                    BIT(2)               /*!< HRTIMER_ADCTRIG2 on Master_TIMER compare 2 event */
#define HRTIMER_ADCTRIGS2_TRG2MTC3                    BIT(3)               /*!< HRTIMER_ADCTRIG2 on Master_TIMER compare 3 event */
#define HRTIMER_ADCTRIGS2_TRG2MTPER                   BIT(4)               /*!< HRTIMER_ADCTRIG2 on Master_TIMER period event */
#define HRTIMER_ADCTRIGS2_TRG2EXEV0                   BIT(5)               /*!< HRTIMER_ADCTRIG2 on external event 0 */
#define HRTIMER_ADCTRIGS2_TRG2EXEV1                   BIT(6)               /*!< HRTIMER_ADCTRIG2 on external event 1 */
#define HRTIMER_ADCTRIGS2_TRG2EXEV2                   BIT(7)               /*!< HRTIMER_ADCTRIG2 on external event 2 */
#define HRTIMER_ADCTRIGS2_TRG2EXEV3                   BIT(8)               /*!< HRTIMER_ADCTRIG2 on external event 3 */
#define HRTIMER_ADCTRIGS2_TRG2EXEV4                   BIT(9)               /*!< HRTIMER_ADCTRIG2 on external event 4 */
#define HRTIMER_ADCTRIGS2_TRG2ST0C1                   BIT(10)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER0 compare 1 event */
#define HRTIMER_ADCTRIGS2_TRG2ST0C2                   BIT(11)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER0 compare 2 event */
#define HRTIMER_ADCTRIGS2_TRG2ST0C3                   BIT(12)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER0 compare 3 event */
#define HRTIMER_ADCTRIGS2_TRG2ST0PER                  BIT(13)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER0 period event */
#define HRTIMER_ADCTRIGS2_TRG2ST0RST                  BIT(14)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER0 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS2_TRG2ST1C1                   BIT(15)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER1 compare 1 event */
#define HRTIMER_ADCTRIGS2_TRG2ST1C2                   BIT(16)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER1 compare 2 event */
#define HRTIMER_ADCTRIGS2_TRG2ST1C3                   BIT(17)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER1 compare 3 event */
#define HRTIMER_ADCTRIGS2_TRG2ST1PER                  BIT(18)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER1 period event */
#define HRTIMER_ADCTRIGS2_TRG2ST1RST                  BIT(19)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER1 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS2_TRG2ST2C1                   BIT(20)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER2 compare 1 event */
#define HRTIMER_ADCTRIGS2_TRG2ST2C2                   BIT(21)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER2 compare 2 event */
#define HRTIMER_ADCTRIGS2_TRG2ST2C3                   BIT(22)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER2 compare 3 event */
#define HRTIMER_ADCTRIGS2_TRG2ST2PER                  BIT(23)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER2 period event */
#define HRTIMER_ADCTRIGS2_TRG2ST3C1                   BIT(24)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER3 compare 1 event */
#define HRTIMER_ADCTRIGS2_TRG2ST3C2                   BIT(25)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER3 compare 2 event */
#define HRTIMER_ADCTRIGS2_TRG2ST3C3                   BIT(26)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER3 compare 3 event */
#define HRTIMER_ADCTRIGS2_TRG2ST3PER                  BIT(27)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER3 period event */
#define HRTIMER_ADCTRIGS2_TRG2ST4C1                   BIT(28)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER4 compare 1 event */
#define HRTIMER_ADCTRIGS2_TRG2ST4C2                   BIT(29)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER4 compare 2 event */
#define HRTIMER_ADCTRIGS2_TRG2ST4C3                   BIT(30)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER4 compare 3 event */
#define HRTIMER_ADCTRIGS2_TRG2ST4PER                  BIT(31)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER4 period event */

/* HRTIMER_ADCTRIGS3 */
#define HRTIMER_ADCTRIGS3_TRG3MTC0                    BIT(0)               /*!< HRTIMER_ADCTRIG3 on Master_TIMER compare 0 event */
#define HRTIMER_ADCTRIGS3_TRG3MTC1                    BIT(1)               /*!< HRTIMER_ADCTRIG3 on Master_TIMER compare 1 event */
#define HRTIMER_ADCTRIGS3_TRG3MTC2                    BIT(2)               /*!< HRTIMER_ADCTRIG3 on Master_TIMER compare 2 event */
#define HRTIMER_ADCTRIGS3_TRG3MTC3                    BIT(3)               /*!< HRTIMER_ADCTRIG3 on Master_TIMER compare 3 event */
#define HRTIMER_ADCTRIGS3_TRG3MTPER                   BIT(4)               /*!< HRTIMER_ADCTRIG3 on Master_TIMER period event */
#define HRTIMER_ADCTRIGS3_TRG3EXEV5                   BIT(5)               /*!< HRTIMER_ADCTRIG3 on external event 5 */
#define HRTIMER_ADCTRIGS3_TRG3EXEV6                   BIT(6)               /*!< HRTIMER_ADCTRIG3 on external event 6 */
#define HRTIMER_ADCTRIGS3_TRG3EXEV7                   BIT(7)               /*!< HRTIMER_ADCTRIG3 on external event 7 */
#define HRTIMER_ADCTRIGS3_TRG3EXEV8                   BIT(8)               /*!< HRTIMER_ADCTRIG3 on external event 8 */
#define HRTIMER_ADCTRIGS3_TRG3EXEV9                   BIT(9)               /*!< HRTIMER_ADCTRIG3 on external event 9 */
#define HRTIMER_ADCTRIGS3_TRG3ST0C1                   BIT(10)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER0 compare 1 event */
#define HRTIMER_ADCTRIGS3_TRG3ST0C2                   BIT(11)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER0 compare 2 event */
#define HRTIMER_ADCTRIGS3_TRG3ST0C3                   BIT(12)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER0 compare 3 event */
#define HRTIMER_ADCTRIGS3_TRG3ST0PER                  BIT(13)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER0 period event */
#define HRTIMER_ADCTRIGS3_TRG3ST1C1                   BIT(14)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER1 compare 1 event */
#define HRTIMER_ADCTRIGS3_TRG3ST1C2                   BIT(15)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER1 compare 2 event */
#define HRTIMER_ADCTRIGS3_TRG3ST1C3                   BIT(16)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER1 compare 3 event */
#define HRTIMER_ADCTRIGS3_TRG3ST1PER                  BIT(17)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER1 period event */
#define HRTIMER_ADCTRIGS3_TRG3ST2C1                   BIT(18)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER2 compare 1 event */
#define HRTIMER_ADCTRIGS3_TRG3ST2C2                   BIT(19)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER2 compare 2 event */
#define HRTIMER_ADCTRIGS3_TRG3ST2C3                   BIT(20)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER2 compare 3 event */
#define HRTIMER_ADCTRIGS3_TRG3ST2PER                  BIT(21)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER2 period event */
#define HRTIMER_ADCTRIGS3_TRG3ST2RST                  BIT(22)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER2 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS3_TRG3ST3C1                   BIT(23)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER3 compare 1 event */
#define HRTIMER_ADCTRIGS3_TRG3ST3C2                   BIT(24)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER3 compare 2 event */
#define HRTIMER_ADCTRIGS3_TRG3ST3C3                   BIT(25)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER3 compare 3 event */
#define HRTIMER_ADCTRIGS3_TRG3ST3PER                  BIT(26)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER3 period event */
#define HRTIMER_ADCTRIGS3_TRG3ST3RST                  BIT(27)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER3 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS3_TRG3ST4C1                   BIT(28)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER4 compare 1 event */
#define HRTIMER_ADCTRIGS3_TRG3ST4C2                   BIT(29)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER4 compare 2 event */
#define HRTIMER_ADCTRIGS3_TRG3ST4C3                   BIT(30)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER4 compare 3 event */
#define HRTIMER_ADCTRIGS3_TRG3ST4RST                  BIT(31)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER4 reset and counter roll-over event */

/* HRTIMER_DLLCCTL */
#define HRTIMER_DLLCCTL_CLBSTRT                       BIT(0)               /*!< DLL calibration start once */
#define HRTIMER_DLLCCTL_CLBPEREN                      BIT(1)               /*!< DLL periodic calibration enable */
#define HRTIMER_DLLCCTL_CLBPER                        BITS(2,3)            /*!< DLL calibration period */

/* HRTIMER_FLTINCFG0 */
#define HRTIMER_FLTINCFG0_FLT0INEN                    BIT(0)               /*!< fault 0 input enable */
#define HRTIMER_FLTINCFG0_FLT0INP                     BIT(1)               /*!< fault 0 input polarity */
#define HRTIMER_FLTINCFG0_FLT0INSRC0                  BIT(2)               /*!< fault 0 input source */
#define HRTIMER_FLTINCFG0_FLT0INFC                    BITS(3,6)            /*!< fault 0 input filter control */
#define HRTIMER_FLTINCFG0_FLT0INPROT                  BIT(7)               /*!< protect fault 0 input configuration */
#define HRTIMER_FLTINCFG0_FLT1INEN                    BIT(8)               /*!< fault 1 input enable */
#define HRTIMER_FLTINCFG0_FLT1INP                     BIT(9)               /*!< fault 1 input polarity */
#define HRTIMER_FLTINCFG0_FLT1INSRC0                  BIT(10)              /*!< fault 1 input source */
#define HRTIMER_FLTINCFG0_FLT1INFC                    BITS(11,14)          /*!< fault 1 input filter control */
#define HRTIMER_FLTINCFG0_FLT1INPROT                  BIT(15)              /*!< protect fault 1 input configuration */
#define HRTIMER_FLTINCFG0_FLT2INEN                    BIT(16)              /*!< fault 2 input enable */
#define HRTIMER_FLTINCFG0_FLT2INP                     BIT(17)              /*!< fault 2 input polarity */
#define HRTIMER_FLTINCFG0_FLT2INSRC0                  BIT(18)              /*!< fault 2 input source */
#define HRTIMER_FLTINCFG0_FLT2INFC                    BITS(19,22)          /*!< fault 2 input filter control */
#define HRTIMER_FLTINCFG0_FLT2INPROT                  BIT(23)              /*!< protect fault 2 input configuration */
#define HRTIMER_FLTINCFG0_FLT3INEN                    BIT(24)              /*!< fault 3 input enable */
#define HRTIMER_FLTINCFG0_FLT3INP                     BIT(25)              /*!< fault 3 input polarity */
#define HRTIMER_FLTINCFG0_FLT3INSRC0                  BIT(26)              /*!< fault 3 input source */
#define HRTIMER_FLTINCFG0_FLT3INFC                    BITS(27,30)          /*!< fault 3 input filter control */
#define HRTIMER_FLTINCFG0_FLT3INPROT                  BIT(31)              /*!< protect fault 3 input configuration */

/* HRTIMER_FLTINCFG1 */
#define HRTIMER_FLTINCFG1_FLT4INEN                    BIT(0)               /*!< fault 4 input enable */
#define HRTIMER_FLTINCFG1_FLT4INP                     BIT(1)               /*!< fault 4 input polarity */
#define HRTIMER_FLTINCFG1_FLT4INSRC0                  BIT(2)               /*!< fault 4 input source */
#define HRTIMER_FLTINCFG1_FLT4INFC                    BITS(3,6)            /*!< fault 4 input filter control */
#define HRTIMER_FLTINCFG1_FLT4INPROT                  BIT(7)               /*!< protect fault 4 input configuration */
#define HRTIMER_FLTINCFG1_FLT5INEN                    BIT(8)               /*!< fault 5 input enable */
#define HRTIMER_FLTINCFG1_FLT5INP                     BIT(9)               /*!< fault 5 input polarity */
#define HRTIMER_FLTINCFG1_FLT5INSRC0                  BIT(10)              /*!< fault 5 input source */
#define HRTIMER_FLTINCFG1_FLT5INFC                    BITS(11,14)          /*!< fault 5 input filter control */
#define HRTIMER_FLTINCFG1_FLT5INPROT                  BIT(15)              /*!< protect fault 5 input configuration */
#define HRTIMER_FLTINCFG1_FLT0INSRC1                  BIT(16)              /*!< fault 0 input source */
#define HRTIMER_FLTINCFG1_FLT1INSRC1                  BIT(17)              /*!< fault 1 input source */
#define HRTIMER_FLTINCFG1_FLT2INSRC1                  BIT(18)              /*!< fault 2 input source */
#define HRTIMER_FLTINCFG1_FLT3INSRC1                  BIT(19)              /*!< fault 3 input source */
#define HRTIMER_FLTINCFG1_FLT4INSRC1                  BIT(20)              /*!< fault 4 input source */
#define HRTIMER_FLTINCFG1_FLT5INSRC1                  BIT(21)              /*!< fault 5 input source */
#define HRTIMER_FLTINCFG1_FLT6INSRC1                  BIT(22)              /*!< fault 6 input source */
#define HRTIMER_FLTINCFG1_FLT7INSRC1                  BIT(23)              /*!< fault 7 input source */
#define HRTIMER_FLTINCFG1_FLTFDIV                     BITS(24,25)          /*!< fault input digital filter clock division */

