wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER_DMAUPMTR */
#define HRTIMER_DMAUPMTR_MTCTL0                       BIT(0)               /*!< HRTIMER_MTCTL0 update by DMA mode */
#define HRTIMER_DMAUPMTR_MTINTC                       BIT(1)               /*!< HRTIMER_MTINTC update by DMA mode */
#define HRTIMER_DMAUPMTR_MTDMAINTEN                   BIT(2)               /*!< HRTIMER_MTDMAINTEN update by DMA mode */
#define HRTIMER_DMAUPMTR_MTCNT                        BIT(3)               /*!< HRTIMER_MTCNT update by DMA mode */
#define HRTIMER_DMAUPMTR_MTCAR                        BIT(4)               /*!< HRTIMER_MTCAR update by DMA mode */
#define HRTIMER_DMAUPMTR_MTCREP                       BIT(5)               /*!< HRTIMER_MTCREP update by DMA mode */
#define HRTIMER_DMAUPMTR_MTCMP0V                      BIT(6)               /*!< HRTIMER_MTCMP0V update by DMA mode */
#define HRTIMER_DMAUPMTR_MTCMP1V                      BIT(7)               /*!< HRTIMER_MTCMP1V update by DMA mode */
#define HRTIMER_DMAUPMTR_MTCMP2V                      BIT(8)               /*!< HRTIMER_MTCMP2V update by DMA mode */
#define HRTIMER_DMAUPMTR_MTCMP3V                      BIT(9)               /*!< HRTIMER_MTCMP3V update by DMA mode */

/* HRTIMER_DMAUPSTxR */
#define HRTIMER_DMAUPSTXR_STXCTL0                     BIT(0)               /*!< HRTIMER_STxCTL0 update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXINTC                     BIT(1)               /*!< HRTIMER_STxINTC update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXDMAINTEN                 BIT(2)               /*!< HRTIMER_STxDMAINTEN update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCNT                      BIT(3)               /*!< HRTIMER_STxCNT update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCAR                      BIT(4)               /*!< HRTIMER_STxCAR update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCREP                     BIT(5)               /*!< HRTIMER_STxCREP update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCMP0V                    BIT(6)               /*!< HRTIMER_STxCMP0V update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCMP1V                    BIT(7)               /*!< HRTIMER_STxCMP1V update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCMP2V                    BIT(8)               /*!< HRTIMER_STxCMP2V update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCMP3V                    BIT(9)               /*!< HRTIMER_STxCMP3V update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXDTCTL                    BIT(10)              /*!< HRTIMER_STxDTCTL update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCH0SET                   BIT(11)              /*!< HRTIMER_STxCH0SET update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCH0RST                   BIT(12)              /*!< HRTIMER_STxCH0RST update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCH1SET                   BIT(13)              /*!< HRTIMER_STxCH1SET update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCH1RST                   BIT(14)              /*!< HRTIMER_STxCH1RST update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXEXEVFCFG0                BIT(15)              /*!< HRTIMER_STxEXEVFCFG0 update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXEXEVFCFG1                BIT(16)              /*!< HRTIMER_STxEXEVFCFG1 update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCNTRST                   BIT(17)              /*!< HRTIMER_STxCNTRST update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCSCTL                    BIT(18)              /*!< HRTIMER_STxCSCTL update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXCHOCTL                   BIT(19)              /*!< HRTIMER_STxCHOCTL update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXFLTCTL                   BIT(20)              /*!< HRTIMER_STxFLTCTL update by DMA mode */
#define HRTIMER_DMAUPSTXR_STxCTL1                     BIT(21)              /*!< HRTIMER_STxCTL1 update by DMA mode */
#define HRTIMER_DMAUPSTXR_STxEXEVFCFG2                BIT(22)              /*!< HRTIMER_STxEXEVFCFG2 update by DMA mode */
#define HRTIMER_DMAUPSTXR_STXACTL                     BIT(31)              /*!< HRTIMER_STxACTL update by DMA mode */

/* HRTIMER_DMATB */
#define HRTIMER_DMATB_DMATB                           BITS(0,31)           /*!< DMA transfer buffer */

/* HRTIMER_ADCEXTTRG */
#define HRTIMER_ADCEXTTRG_ADC4TRG4_0                  BITS(0,4)            /*!< this bit selects the ADC trigger 4 source */
#define HRTIMER_ADCEXTTRG_ADC5TRG4_0                  BITS(5,9)            /*!< this bit selects the ADC trigger 5 source */
#define HRTIMER_ADCEXTTRG_ADC6TRG4_0                  BITS(10,14)          /*!< this bit selects the ADC trigger 6 source */
#define HRTIMER_ADCEXTTRG_ADC7TRG4_0                  BITS(16,20)          /*!< this bit selects the ADC trigger 7 source */
#define HRTIMER_ADCEXTTRG_ADC8TRG4_0                  BITS(21,25)          /*!< this bit selects the ADC trigger 8 source */
#define HRTIMER_ADCEXTTRG_ADC9TRG4_0                  BITS(26,30)          /*!< this bit selects the ADC trigger 9 source */

/* HRTIMER_ADCTRGUPD */
#define HRTIMER_ADCTRGUPD_ADTG4USRC                    BITS(0,3)           /*!< ADC trigger 4 update source */ 
#define HRTIMER_ADCTRGUPD_ADTG5USRC                    BITS(4,7)           /*!< ADC trigger 5 update source */ 
#define HRTIMER_ADCTRGUPD_ADTG6USRC                    BITS(8,11)          /*!< ADC trigger 6 update source */ 
#define HRTIMER_ADCTRGUPD_ADTG7USRC                    BITS(12,15)         /*!< ADC trigger 7 update source */ 
#define HRTIMER_ADCTRGUPD_ADTG8USRC                    BITS(16,19)         /*!< ADC trigger 8 update source */ 
#define HRTIMER_ADCTRGUPD_ADTG9USRC                    BITS(20,23)         /*!< ADC trigger 9 update source */

/* HRTIMER_ADCPSCR0 */
#define HRTIMER_ADCPSCR0_ADC0PSC                      BITS(0,4)            /*!< ADC trigger 0 prescaler */
#define HRTIMER_ADCPSCR0_ADC1PSC                      BITS(6,10)           /*!< ADC trigger 1 prescaler */
#define HRTIMER_ADCPSCR0_ADC2PSC                      BITS(12,16)          /*!< ADC trigger 2 prescaler */
#define HRTIMER_ADCPSCR0_ADC3PSC                      BITS(18,22)          /*!< ADC trigger 3 prescaler */
#define HRTIMER_ADCPSCR0_ADC4PSC                      BITS(24,28)          /*!< ADC trigger 4 prescaler */

/* HRTIMER_ADCPSCR1 */
#define HRTIMER_ADCPSCR1_ADC5PSC                      BITS(0,4)            /*!< ADC trigger 5 prescaler */
#define HRTIMER_ADCPSCR1_ADC6PSC                      BITS(6,10)           /*!< ADC trigger 6 prescaler */
#define HRTIMER_ADCPSCR1_ADC7PSC                      BITS(12,16)          /*!< ADC trigger 7 prescaler */
#define HRTIMER_ADCPSCR1_ADC8PSC                      BITS(18,22)          /*!< ADC trigger 8 prescaler */
#define HRTIMER_ADCPSCR1_ADC9PSC                      BITS(24,28)          /*!< ADC trigger 9 prescaler */

