wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER_FLTINCFG2 */
#define HRTIMER_FLTINCFG2_FLT0BLKEN                   BIT(0)               /*!< fault 0 blanking enable */
#define HRTIMER_FLTINCFG2_FLT0BLKS                    BIT(1)               /*!< fault 0 blanking source */
#define HRTIMER_FLTINCFG2_FLT0CNT                     BITS(2,5)            /*!< fault 0 counter */
#define HRTIMER_FLTINCFG2_FLT0CNTRST                  BIT(6)               /*!< fault 0 counter reset */
#define HRTIMER_FLTINCFG2_FLT0RST                     BIT(7)               /*!< fault 0 reset mode */
#define HRTIMER_FLTINCFG2_FLT1BLKEN                   BIT(8)               /*!< fault 1 blanking enable */
#define HRTIMER_FLTINCFG2_FLT1BLKS                    BIT(9)               /*!< fault 1 blanking source */
#define HRTIMER_FLTINCFG2_FLT1CNT                     BITS(10,13)          /*!< fault 1 counter */
#define HRTIMER_FLTINCFG2_FLT1CNTRST                  BIT(14)              /*!< fault 1 counter reset */
#define HRTIMER_FLTINCFG2_FLT1RST                     BIT(15)              /*!< fault 1 reset mode */
#define HRTIMER_FLTINCFG2_FLT2BLKEN                   BIT(16)              /*!< fault 2 blanking enable */
#define HRTIMER_FLTINCFG2_FLT2BLKS                    BIT(17)              /*!< fault 2 blanking source */
#define HRTIMER_FLTINCFG2_FLT2CNT                     BITS(18,21)          /*!< fault 2 counter */
#define HRTIMER_FLTINCFG2_FLT2CNTRST                  BIT(22)              /*!< fault 2 counter reset */
#define HRTIMER_FLTINCFG2_FLT2RST                     BIT(23)              /*!< fault 2 reset mode */
#define HRTIMER_FLTINCFG2_FLT3BLKEN                   BIT(24)              /*!< fault 3 blanking enable */
#define HRTIMER_FLTINCFG2_FLT3BLKS                    BIT(25)              /*!< fault 3 blanking source */
#define HRTIMER_FLTINCFG2_FLT3CNT                     BITS(26,29)          /*!< fault 3 counter */
#define HRTIMER_FLTINCFG2_FLT3CNTRST                  BIT(30)              /*!< fault 3 counter reset */
#define HRTIMER_FLTINCFG2_FLT3RST                     BIT(31)              /*!< fault 3 reset mode */

/* HRTIMER_FLTINCFG3 */
#define HRTIMER_FLTINCFG3_FLT4BLKEN                   BIT(0)               /*!< fault 4 blanking enable */
#define HRTIMER_FLTINCFG3_FLT4BLKS                    BIT(1)               /*!< fault 4 blanking source */
#define HRTIMER_FLTINCFG3_FLT4CNT                     BITS(2,5)            /*!< fault 4 counter */
#define HRTIMER_FLTINCFG3_FLT4CNTRST                  BIT(6)               /*!< fault 4 counter reset */
#define HRTIMER_FLTINCFG3_FLT4RST                     BIT(7)               /*!< fault 4 reset mode */
#define HRTIMER_FLTINCFG3_FLT5BLKEN                   BIT(8)               /*!< fault 5 blanking enable */
#define HRTIMER_FLTINCFG3_FLT5BLKS                    BIT(9)               /*!< fault 5 blanking source */
#define HRTIMER_FLTINCFG3_FLT5CNT                     BITS(10,13)          /*!< fault 5 counter */
#define HRTIMER_FLTINCFG3_FLT5CNTRST                  BIT(14)              /*!< fault 5 counter reset */
#define HRTIMER_FLTINCFG3_FLT5RST                     BIT(15)              /*!< fault 5 reset mode */
#define HRTIMER_FLTINCFG3_FLT6BLKEN                   BIT(16)              /*!< fault 6 blanking enable */
#define HRTIMER_FLTINCFG3_FLT6BLKS                    BIT(17)              /*!< fault 6 blanking source */
#define HRTIMER_FLTINCFG3_FLT6CNT                     BITS(18,21)          /*!< fault 6 counter */
#define HRTIMER_FLTINCFG3_FLT6CNTRST                  BIT(22)              /*!< fault 6 counter reset */
#define HRTIMER_FLTINCFG3_FLT6RST                     BIT(23)              /*!< fault 6 reset mode */
#define HRTIMER_FLTINCFG3_FLT7BLKEN                   BIT(24)              /*!< fault 7 blanking enable */
#define HRTIMER_FLTINCFG3_FLT7BLKS                    BIT(25)              /*!< fault 7 blanking source */
#define HRTIMER_FLTINCFG3_FLT7CNT                     BITS(26,29)          /*!< fault 7 counter */
#define HRTIMER_FLTINCFG3_FLT7CNTRST                  BIT(30)              /*!< fault 7 counter reset */
#define HRTIMER_FLTINCFG3_FLT7RST                     BIT(31)              /*!< fault 7 reset mode */

/* HRTIMER_BMSTRGA */
#define HRTIMER_BMSTRGA_ST5RST                        BIT(0)               /*!< Slave_TIMER5 reset event triggers bunch mode operation */
#define HRTIMER_BMSTRGA_ST5REP                        BIT(1)               /*!< Slave_TIMER5 repetition event triggers bunch mode operation */
#define HRTIMER_BMSTRGA_ST5CMP0                       BIT(2)               /*!< Slave_TIMER5 compare 0 event triggers bunch mode operation */
#define HRTIMER_BMSTRGA_ST5CMP1                       BIT(3)               /*!< Slave_TIMER5 compare 1 event triggers bunch mode operation */
#define HRTIMER_BMSTRGA_ST6RST                        BIT(4)               /*!< Slave_TIMER6 reset event triggers bunch mode operation */
#define HRTIMER_BMSTRGA_ST6REP                        BIT(5)               /*!< Slave_TIMER6 repetition event triggers bunch mode operation */
#define HRTIMER_BMSTRGA_ST6CMP0                       BIT(6)               /*!< Slave_TIMER6 compare 0 event triggers bunch mode operation */
#define HRTIMER_BMSTRGA_ST6CMP1                       BIT(7)               /*!< Slave_TIMER6 compare 1 event triggers bunch mode operation */
#define HRTIMER_BMSTRGA_ST7RST                        BIT(8)               /*!< Slave_TIMER7 reset event triggers bunch mode operation */
#define HRTIMER_BMSTRGA_ST7REP                        BIT(9)               /*!< Slave_TIMER7 repetition event triggers bunch mode operation */
#define HRTIMER_BMSTRGA_ST7CMP0                       BIT(10)              /*!< Slave_TIMER7 compare 0 event triggers bunch mode operation */
#define HRTIMER_BMSTRGA_ST7CMP1                       BIT(11)              /*!< Slave_TIMER7 compare 1 event triggers bunch mode operation */

/* HRTIMER_FLTINCFG4 */
#define HRTIMER_FLTINCFG4_FLT6INEN                    BIT(0)               /*!< fault 6 input enable */
#define HRTIMER_FLTINCFG4_FLT6INP                     BIT(1)               /*!< fault 6 input polarity */
#define HRTIMER_FLTINCFG4_FLT6INSRC0                  BIT(2)               /*!< fault 6 input source */
#define HRTIMER_FLTINCFG4_FLT6INFC                    BITS(3,6)            /*!< fault 6 input filter control */
#define HRTIMER_FLTINCFG4_FLT6INPROT                  BIT(7)               /*!< protect fault 6 input configuration */
#define HRTIMER_FLTINCFG4_FLT7INEN                    BIT(8)               /*!< fault 7 input enable */
#define HRTIMER_FLTINCFG4_FLT7INP                     BIT(9)               /*!< fault 7 input polarity */
#define HRTIMER_FLTINCFG4_FLT7INSRC0                  BIT(10)              /*!< fault 7 input source */
#define HRTIMER_FLTINCFG4_FLT7INFC                    BITS(11,14)          /*!< fault 7 input filter control */
#define HRTIMER_FLTINCFG4_FLT7INPROT                  BIT(15)              /*!< protect fault 7 input configuration */

/* HRTIMER_ADCEXTTRGA */
#define HRTIMER_ADCEXTTRGA_ADC4TRG5                   BIT(0)               /*!< this bit selects the ADC trigger 4 source */
#define HRTIMER_ADCEXTTRGA_ADC5TRG5                   BIT(1)               /*!< this bit selects the ADC trigger 5 source */
#define HRTIMER_ADCEXTTRGA_ADC6TRG5                   BIT(2)               /*!< this bit selects the ADC trigger 6 source */
#define HRTIMER_ADCEXTTRGA_ADC7TRG5                   BIT(3)               /*!< this bit selects the ADC trigger 7 source */
#define HRTIMER_ADCEXTTRGA_ADC8TRG5                   BIT(4)               /*!< this bit selects the ADC trigger 8 source */
#define HRTIMER_ADCEXTTRGA_ADC9TRG5                   BIT(5)               /*!< this bit selects the ADC trigger 9 source */

/* HRTIMER_ADCTRIGS0A */
#define HRTIMER_ADCTRIGS0A_TRG0ST5C1                  BIT(0)               /*!< HRTIMER_ADCTRIG0 on Slave_TIMER5 compare 1 event */
#define HRTIMER_ADCTRIGS0A_TRG0ST5C2                  BIT(1)               /*!< HRTIMER_ADCTRIG0 on Slave_TIMER5 compare 2 event */
#define HRTIMER_ADCTRIGS0A_TRG0ST5C3                  BIT(2)               /*!< HRTIMER_ADCTRIG0 on Slave_TIMER5 compare 3 event */
#define HRTIMER_ADCTRIGS0A_TRG0ST5PER                 BIT(3)               /*!< HRTIMER_ADCTRIG0 on Slave_TIMER5 period event */
#define HRTIMER_ADCTRIGS0A_TRG0ST5RST                 BIT(4)               /*!< HRTIMER_ADCTRIG0 on Slave_TIMER5 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS0A_TRG0ST6C1                  BIT(8)               /*!< HRTIMER_ADCTRIG0 on Slave_TIMER6 compare 1 event */
#define HRTIMER_ADCTRIGS0A_TRG0ST6C2                  BIT(9)               /*!< HRTIMER_ADCTRIG0 on Slave_TIMER6 compare 2 event */
#define HRTIMER_ADCTRIGS0A_TRG0ST6C3                  BIT(10)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER6 compare 3 event */
#define HRTIMER_ADCTRIGS0A_TRG0ST6PER                 BIT(11)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER6 period event */
#define HRTIMER_ADCTRIGS0A_TRG0ST6RST                 BIT(12)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER6 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS0A_TRG0ST7C1                  BIT(16)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER7 compare 1 event */
#define HRTIMER_ADCTRIGS0A_TRG0ST7C2                  BIT(17)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER7 compare 2 event */
#define HRTIMER_ADCTRIGS0A_TRG0ST7C3                  BIT(18)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER7 compare 3 event */
#define HRTIMER_ADCTRIGS0A_TRG0ST7PER                 BIT(19)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER7 period event */
#define HRTIMER_ADCTRIGS0A_TRG0ST7RST                 BIT(20)              /*!< HRTIMER_ADCTRIG0 on Slave_TIMER7 reset and counter roll-over event */

/* HRTIMER_ADCTRIGS1A */
#define HRTIMER_ADCTRIGS1A_TRG1ST5C1                  BIT(0)               /*!< HRTIMER_ADCTRIG1 on Slave_TIMER5 compare 1 event */
#define HRTIMER_ADCTRIGS1A_TRG1ST5C2                  BIT(1)               /*!< HRTIMER_ADCTRIG1 on Slave_TIMER5 compare 2 event */
#define HRTIMER_ADCTRIGS1A_TRG1ST5C3                  BIT(2)               /*!< HRTIMER_ADCTRIG1 on Slave_TIMER5 compare 3 event */
#define HRTIMER_ADCTRIGS1A_TRG1ST5PER                 BIT(3)               /*!< HRTIMER_ADCTRIG1 on Slave_TIMER5 period event */
#define HRTIMER_ADCTRIGS1A_TRG1ST5RST                 BIT(4)               /*!< HRTIMER_ADCTRIG1 on Slave_TIMER5 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS1A_TRG1ST6C1                  BIT(8)               /*!< HRTIMER_ADCTRIG1 on Slave_TIMER6 compare 1 event */
#define HRTIMER_ADCTRIGS1A_TRG1ST6C2                  BIT(9)               /*!< HRTIMER_ADCTRIG1 on Slave_TIMER6 compare 2 event */
#define HRTIMER_ADCTRIGS1A_TRG1ST6C3                  BIT(10)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER6 compare 3 event */
#define HRTIMER_ADCTRIGS1A_TRG1ST6PER                 BIT(11)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER6 period event */
#define HRTIMER_ADCTRIGS1A_TRG1ST6RST                 BIT(12)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER6 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS1A_TRG1ST7C1                  BIT(16)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER7 compare 1 event */
#define HRTIMER_ADCTRIGS1A_TRG1ST7C2                  BIT(17)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER7 compare 2 event */
#define HRTIMER_ADCTRIGS1A_TRG1ST7C3                  BIT(18)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER7 compare 3 event */
#define HRTIMER_ADCTRIGS1A_TRG1ST7PER                 BIT(19)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER7 period event */
#define HRTIMER_ADCTRIGS1A_TRG1ST7RST                 BIT(20)              /*!< HRTIMER_ADCTRIG1 on Slave_TIMER7 reset and counter roll-over event */

/* HRTIMER_ADCTRIGS2A */
#define HRTIMER_ADCTRIGS2A_TRG2ST5C1                  BIT(0)               /*!< HRTIMER_ADCTRIG2 on Slave_TIMER5 compare 1 event */
#define HRTIMER_ADCTRIGS2A_TRG2ST5C2                  BIT(1)               /*!< HRTIMER_ADCTRIG2 on Slave_TIMER5 compare 2 event */
#define HRTIMER_ADCTRIGS2A_TRG2ST5C3                  BIT(2)               /*!< HRTIMER_ADCTRIG2 on Slave_TIMER5 compare 3 event */
#define HRTIMER_ADCTRIGS2A_TRG2ST5PER                 BIT(3)               /*!< HRTIMER_ADCTRIG2 on Slave_TIMER5 period event */
#define HRTIMER_ADCTRIGS2A_TRG2ST5RST                 BIT(4)               /*!< HRTIMER_ADCTRIG2 on Slave_TIMER5 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS2A_TRG2ST6C1                  BIT(8)               /*!< HRTIMER_ADCTRIG2 on Slave_TIMER6 compare 1 event */
#define HRTIMER_ADCTRIGS2A_TRG2ST6C2                  BIT(9)               /*!< HRTIMER_ADCTRIG2 on Slave_TIMER6 compare 2 event */
#define HRTIMER_ADCTRIGS2A_TRG2ST6C3                  BIT(10)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER6 compare 3 event */
#define HRTIMER_ADCTRIGS2A_TRG2ST6PER                 BIT(11)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER6 period event */
#define HRTIMER_ADCTRIGS2A_TRG2ST6RST                 BIT(12)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER6 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS2A_TRG2ST7C1                  BIT(16)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER7 compare 1 event */
#define HRTIMER_ADCTRIGS2A_TRG2ST7C2                  BIT(17)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER7 compare 2 event */
#define HRTIMER_ADCTRIGS2A_TRG2ST7C3                  BIT(18)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER7 compare 3 event */
#define HRTIMER_ADCTRIGS2A_TRG2ST7PER                 BIT(19)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER7 period event */
#define HRTIMER_ADCTRIGS2A_TRG2ST7RST                 BIT(20)              /*!< HRTIMER_ADCTRIG2 on Slave_TIMER7 reset and counter roll-over event */

/* HRTIMER_ADCTRIGS3A */
#define HRTIMER_ADCTRIGS3A_TRG3ST5C1                  BIT(0)               /*!< HRTIMER_ADCTRIG3 on Slave_TIMER5 compare 1 event */
#define HRTIMER_ADCTRIGS3A_TRG3ST5C2                  BIT(1)               /*!< HRTIMER_ADCTRIG3 on Slave_TIMER5 compare 2 event */
#define HRTIMER_ADCTRIGS3A_TRG3ST5C3                  BIT(2)               /*!< HRTIMER_ADCTRIG3 on Slave_TIMER5 compare 3 event */
#define HRTIMER_ADCTRIGS3A_TRG3ST5PER                 BIT(3)               /*!< HRTIMER_ADCTRIG3 on Slave_TIMER5 period event */
#define HRTIMER_ADCTRIGS3A_TRG3ST5RST                 BIT(4)               /*!< HRTIMER_ADCTRIG3 on Slave_TIMER5 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS3A_TRG3ST6C1                  BIT(8)               /*!< HRTIMER_ADCTRIG3 on Slave_TIMER6 compare 1 event */
#define HRTIMER_ADCTRIGS3A_TRG3ST6C2                  BIT(9)               /*!< HRTIMER_ADCTRIG3 on Slave_TIMER6 compare 2 event */
#define HRTIMER_ADCTRIGS3A_TRG3ST6C3                  BIT(10)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER6 compare 3 event */
#define HRTIMER_ADCTRIGS3A_TRG3ST6PER                 BIT(11)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER6 period event */
#define HRTIMER_ADCTRIGS3A_TRG3ST6RST                 BIT(12)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER6 reset and counter roll-over event */
#define HRTIMER_ADCTRIGS3A_TRG3ST7C1                  BIT(16)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER7 compare 1 event */
#define HRTIMER_ADCTRIGS3A_TRG3ST7C2                  BIT(17)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER7 compare 2 event */
#define HRTIMER_ADCTRIGS3A_TRG3ST7C3                  BIT(18)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER7 compare 3 event */
#define HRTIMER_ADCTRIGS3A_TRG3ST7PER                 BIT(19)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER7 period event */
#define HRTIMER_ADCTRIGS3A_TRG3ST7RST                 BIT(20)              /*!< HRTIMER_ADCTRIG3 on Slave_TIMER7 reset and counter roll-over event */

