wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER_FLTRECCTL */
#define HRTIMER_FLTRECCTL_FLTRECCTL                   BIT(1)               /*!< fault recovery control */

/* constants definitions */
typedef enum {COUNTER_UP = 0, COUNTER_DOWN = !COUNTER_UP} DirectionStatus;

/* HRTIMER time base parameters struct definitions */
typedef struct
{
    uint32_t period;                                                        /*!< period value, min value: 3*tHRTIMER_CK clock, max value: 0xFFFF C (1*tHRTIMER_CK) */
    uint32_t repetitioncounter;                                             /*!< the counter repetition value, 0x00~0xFF */
    uint32_t prescaler;                                                     /*!< prescaler value, refer to: counter clock division */
    uint32_t counter_mode;                                                  /*!< counter operating mode, refer to: counter operating mode */
    uint32_t counterdirection;                                              /*!< counter direction, refer to: counter direction mode */
}hrtimer_baseinit_parameter_struct;

/* waveform mode initialization parameters struct definitions */
typedef struct {
    uint32_t half_mode;                                                     /*!< specifies whether or not half mode is enabled, refer to: half mode enabling status */
    uint32_t alternate_mode;                                                /*!< specifies whether or not alternate mode is enabled, refer to: alternate mode enable status */
    uint32_t resynchronized_update;                                         /*!< specifies whether or not the update source is coming from other slave timer */
    uint32_t start_sync;                                                    /*!< specifies whether or not timer is started by a rising edge on the synchronization input, refer to: synchronous input start timer */
    uint32_t reset_sync;                                                    /*!< specifies whether or not timer is reset by a rising edge on the synchronization input, refer to: synchronous input reset timer */
    uint32_t dac_trigger;                                                   /*!< indicates whether or not the a DAC synchronization event is generated, refer to: trigger source to DAC */
    uint32_t shadow;                                                        /*!< specifies whether or not the shadow registers are enabled, refer to: shadow registers enabling status */
    uint32_t update_selection;                                              /*!< the update occurs with respect to DMA mode or STxUPINy (Slave_TIMERx only), refer to: update event selection */
    uint32_t cnt_bunch;                                                     /*!< the timer behaves during a bunch mode operation, refer to: timer behaves during a bunch mode operation */
    uint32_t repetition_update;                                             /*!< specifies whether or not registers update is triggered by the repetition event, refer to: update event generated by repetition event */
}hrtimer_timerinit_parameter_struct;

/* Slave_TIMER general behavior configuration struct definitions */
typedef struct {
    uint32_t balanced_mode;                                                 /*!< specifies whether or not the balanced mode is enabled, refer to: set balanced mode */
    uint32_t fault_enable;                                                  /*!< specifies whether or not the fault channels are enabled for the Slave_TIMER, refer to: faut channel enabled for a Slave_TIMER*/
    uint32_t fault_protect;                                                 /*!< specifies whether the write protection function is enable or not, refer to: protect fault enable */
    uint32_t fault_automatic_resume;                                        /*!< specifies whether the fault automatic resume function is enable or not, refer to: fault automatic resume enable */
    uint32_t deadtime_enable;                                               /*!< specifies whether or not dead time insertion is enabled for the timer, refer to: dead time enable */
    uint32_t delayed_idle;                                                  /*!< the delayed IDLE mode, refer to: set delayed IDLE state mode */
    uint32_t balanced_idle_automatic_resume;                                /*!< specifies whether or not the balanced idle automatic resumpe is enabled, refer to: balanced idle automatic resumption enable */
    uint64_t update_source;                                                 /*!< the source triggering the Slave_TIMER registers update, refer to: update is done synchronously with any other Slave_TIMER or Master_TIMER update */
    uint64_t cnt_reset;                                                     /*!< the source triggering the Slave_TIMER counter reset, refer to: Slave_TIMER counter reset */
    uint32_t reset_update;                                                  /*!< specifies whether or not registers update is triggered when the timer counter is reset, refer to: update event generated by reset event */
}hrtimer_timercfg_parameter_struct;

/* capture value struct definitions */
typedef struct {
    uint32_t value;                                                         /*!< capture value */
    uint32_t dir;                                                           /*!< count direation when captured */
}hrtimer_capture_value_struct;

/* compare unit configuration struct definitions */
typedef struct {
    uint32_t compare_value;                                                 /*!< compare value, min value: 3*tHRTIMER_CK clock, max value: 0xFFFF C (1*tHRTIMER_CK) */
    uint32_t delayed_mode;                                                  /*!< defining whether the compare register is behaving in regular mode or in delayed mode, refer to: compare 3 or 1 delayed mode */
    uint32_t timeout_value;                                                 /*!< compare value for compare 0 or 2 when compare 3 or 1 is delayed mode with time out is selected , timeout_value + compare_value must be less than 0xFFFF */
    uint32_t trigger_half;                                                  /*!< triggered half mode */
    uint32_t immediately_update_cmp0;                                       /*!< immediately update compare 0 value PWM mode */
    uint32_t immediately_update_cmp2;                                       /*!< immediately update compare 2 value PWM mode */
}hrtimer_comparecfg_parameter_struct;

