wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* external event filtering for Slave_TIMER configuration struct definitions */
typedef struct {
    uint32_t filter_mode;                                                   /*!< the external event filter mode for Slave_TIMER, refer to: external event filter mode */ 
    uint32_t memorized;                                                     /*!< specifies whether or not the signal is memorized, refer to: external event memorized enable */
}hrtimer_exevfilter_parameter_struct;

/* dead time configuration struct definitions */
typedef struct {
    uint32_t prescaler;                                                     /*!< dead time generator clock division, refer to: dead time prescaler */ 
    uint32_t rising_value;                                                  /*!< rising edge dead-time value, 0x0000~0xFFFF */ 
    uint32_t rising_sign;                                                   /*!< the sign of rising edge dead-time value, refer to: dead time rising sign */ 
    uint32_t rising_protect;                                                /*!< dead time rising edge protection for value and sign, refer to: dead time rising edge protection for value and sign */ 
    uint32_t risingsign_protect;                                            /*!< dead time rising edge protection for sign, refer to: dead time rising edge protection only for sign */ 
    uint32_t falling_value;                                                 /*!< falling edge dead-time value, 0x0000~0xFFFF */ 
    uint32_t falling_sign;                                                  /*!< the sign of falling edge dead-time value, refer to: dead time falling sign */ 
    uint32_t falling_protect;                                               /*!< dead time falling edge protection for value and sign, refer to: dead time falling edge protection for value and sign */
    uint32_t fallingsign_protect;                                           /*!< dead time falling edge protection for sign, refer to: dead time falling edge protection only for sign */
}hrtimer_deadtimecfg_parameter_struct;

/* carrier signal configuration struct definitions */
typedef struct {
    uint32_t period;                                                        /*!< carrier signal period: tCSPRD, 0x0~0xF. tCSPRD = (period + 1) * 16 * tHRTIMER_CK */
    uint32_t duty_cycle;                                                    /*!< carrier signal duty cycle, 0x0~0x7, duty cycle = duty_cycle/8 */
    uint32_t first_pulse;                                                   /*!< first carrier-signal pulse width: tCSFSTPW, 0x0~0xF. tCSFSTPW = (first_pulse+1) * 16 * tHRTIMER_CK */
}hrtimer_carriersignalcfg_parameter_struct;

/* synchronization configuration struct definitions */
typedef struct {
    uint32_t input_source;                                                  /*!< the external synchronization input source, refer to: the synchronization input source */
    uint32_t output_source;                                                 /*!< the source and event to be sent on the external synchronization outputs, refer to: the synchronization output source */
    uint32_t output_polarity;                                               /*!< the polarity and length of the pulse to be sent on the external synchronization outputs, refer to: the pulse on the synchronization output pad HRTIMER_SCOUT */
}hrtimer_synccfg_parameter_struct;

/* bunch mode configuration struct definitions */
typedef struct {
    uint32_t mode;                                                          /*!< the bunch mode operating mode, refer to: continuous mode in bunch mode */
    uint32_t clock_source;                                                  /*!< specifies the burst mode clock source, refer to: bunch mode clock source*/
    uint32_t prescaler;                                                     /*!< the bunch mode prescaler, refer to: bunch mode clock division */
    uint32_t shadow;                                                        /*!< specifies whether or not preload is enabled for HRTIMER_BMCMPV and HRTIMER_BMCAR registers, refer to: bunch mode shadow enable */
    uint32_t trigger[2];                                                    /*!< the event triggering the bunch operation, refer to: the event triggers bunch mode operation */
    uint32_t idle_duration;                                                 /*!< the duration of the IDLE, 0x0000~0xFFFF  */
    uint32_t period;                                                        /*!< the bunch mode period which is the sum of the IDLE and RUN duration, 0x0001~0xFFFF  */
}hrtimer_bunchmode_parameter_struct;

/* external event configuration struct definitions */
typedef struct {
    uint32_t source;                                                        /*!< the source of the external event,refer to: external event source */ 
    uint32_t polarity;                                                      /*!< the active level of external event 0 when EXEVyEG[1:0] = 2b00, refer to: external event polarity */ 
    uint32_t edge;                                                          /*!< the sensitivity of the external event, external event edge sensitivity */ 
    uint32_t fast;                                                          /*!< external event fast mode */ 
    uint32_t digital_filter;                                                /*!< external event filter control, 0x0~0xF */ 
}hrtimer_exeventcfg_parameter_struct;

/* HRTIMER event counter parameters struct definitions */
typedef struct
{
    uint32_t reset_mode;                                                    /*!< external event X reset mode */
    uint32_t counter_threshold;                                             /*!< external event X counter threshold value, 0x00~0x3F*/
    uint32_t event_source;                                                  /*!< external event X selection*/
}hrtimer_exeventcnt_parameter_struct;

/* fault input configuration struct definitions */
typedef struct {
    uint32_t source;                                                        /*!< the source of the fault input, refer to: fault input source */ 
    uint32_t polarity;                                                      /*!< the polarity of the fault input, refer to: fault input polarity */ 
    uint32_t filter;                                                        /*!< fault input filter control, 0x0~0xF */ 
    uint32_t control;                                                       /*!< fault input enable or disable, refer to: enable or disable fault */ 
    uint32_t protect ;                                                      /*!< protect fault input configuration, refer to: protect fault input configuration */
    uint32_t blanksource;                                                   /*!< fault blanking source */
    uint32_t counter;                                                       /*!< fault blanking counter */
    uint32_t resetmode;                                                     /*!< fault reset mode */
    uint32_t blanksenable;                                                  /*!< fault blank enable */
    uint32_t fault_recovery_control;                                        /*!< fault recovery control */
}hrtimer_faultcfg_parameter_struct;

/* ADC trigger configuration struct definitions */
typedef struct {
    uint32_t update_source;                                                 /*!< the source triggering the update of the HRTIMER_ADCTRIGSy register, refer to: HRTIMER_ADCTRIG update source */
    uint32_t trigger0_3[2];                                                 /*!< the event triggering the ADC conversion, refer to:  ADC trigger 0,2 and ADC trigger 1,3 */
    uint32_t trigger4_9;                                                    /*!< the event triggering the ADC conversion, refer to:  ADC trigger 4,6,8 and ADC trigger 5,7,9 */
}hrtimer_adctrigcfg_parameter_struct;

