wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* channel output configuration struct definitions */
typedef struct {
    uint32_t polarity;                                                      /*!< configure channel output polarity, refer to: channel output polarity */
    uint64_t set_request;                                                   /*!< configure the event generates channel set request, refer to channel set request */
    uint64_t reset_request;                                                 /*!< configure the event generates channel reset request, refer to: channel reset request */
    uint32_t idle_bunch;                                                    /*!< specifies whether channel output can be IDLE state in bunch mode, refer to: channel IDLE state enable in bunch mode */
    uint32_t idle_state;                                                    /*!< specifies channel output idle state, refer to channel output idle state */
    uint32_t fault_state;                                                   /*!< specifies the output level when in FAULT state, refer to: channel output in fault state */
    uint32_t carrier_mode;                                                  /*!< specifies whether or not the carrier-signal mode is enabled, refer to: channel carrier-signal mode enable */
    uint32_t deadtime_bunch;                                                /*!< specifies whether or not deadtime is inserted before output entering the IDLE state in bunch mode, refer to: channel dead-time insert in bunch mode */
}hrtimer_channel_outputcfg_parameter_struct;

/* roll over struct definitions */
typedef struct {
    uint32_t roll_over_mode;                                                /*!< roll-over mode */
    uint32_t output_roll_over_mode;                                         /*!< output roll-over mode */
    uint32_t adc_roll_over_mode;                                            /*!< ADC roll-over mode */
    uint32_t bunch_mode_roll_over_mode;                                     /*!< bunch mode roll-over mode */
    uint32_t fault_event_roll_over_mode;                                    /*!< fault and event roll-over mode */
}hrtimer_roll_over_parameter_struct;

/* double channel trigger struct */
typedef struct {
    uint32_t trigger_enable;                                                /*!< configure the double channel trigger enable */
    uint32_t trigger0;                                                      /*!< configure the double channel trigger0 */
    uint32_t trigger1;                                                      /*!< configure the double channel trigger1 */
}hrtimer_double_trigger_parameter_struct;

/* HRTIMER timer to configure */
#define HRTIMER_SLAVE_TIMER0                            ((uint32_t)0x00000000U)                                          /*!< index associated to Slave_TIMER0 */
#define HRTIMER_SLAVE_TIMER1                            ((uint32_t)0x00000001U)                                          /*!< index associated to Slave_TIMER1 */
#define HRTIMER_SLAVE_TIMER2                            ((uint32_t)0x00000002U)                                          /*!< index associated to Slave_TIMER2 */
#define HRTIMER_SLAVE_TIMER3                            ((uint32_t)0x00000003U)                                          /*!< index associated to Slave_TIMER3 */
#define HRTIMER_SLAVE_TIMER4                            ((uint32_t)0x00000004U)                                          /*!< index associated to Slave_TIMER4 */
#define HRTIMER_MASTER_TIMER                            ((uint32_t)0x00000006U)                                          /*!< index associated to Master_TIMER */
#define HRTIMER_COMMONINDEX                             ((uint32_t)0x00000007U)                                          /*!< index associated to common registers */
#define HRTIMER_SLAVE_TIMER5                            ((uint32_t)0x00000005U)                                          /*!< index associated to Slave_TIMER5 */
#define HRTIMER_SLAVE_TIMER6                            ((uint32_t)0x0000000FU)                                          /*!< index associated to Slave_TIMER6 */
#define HRTIMER_SLAVE_TIMER7                            ((uint32_t)0x00000010U)                                          /*!< index associated to Slave_TIMER7 */
                                                                                                                  
/* compare unit to configure */                                                                                   
#define HRTIMER_COMPARE0                                ((uint32_t)0x00000000U)                                          /*!< compare unit 0 */
#define HRTIMER_COMPARE1                                ((uint32_t)0x00000001U)                                          /*!< compare unit 1 */
#define HRTIMER_COMPARE2                                ((uint32_t)0x00000002U)                                          /*!< compare unit 2 */
#define HRTIMER_COMPARE3                                ((uint32_t)0x00000003U)                                          /*!< compare unit 3 */
#define HRTIMER_COMPARE0_COMPOSITE                      ((uint32_t)0x00000005U)                                          /*!< compare 0 composite unit */
                                                                                                                  
/* capture unit to configure */                                                                                   
#define HRTIMER_CAPTURE_0                               ((uint32_t)0x00000000U)                                          /*!< capture unit 0 */
#define HRTIMER_CAPTURE_1                               ((uint32_t)0x00000001U)                                          /*!< capture unit 1 */
                                                                                                                  
/* external event to configure */                                                                                 
#define HRTIMER_EXEVENT_NONE                            ((uint32_t)0x00000000U)                                          /*!< undefined event channel */
#define HRTIMER_EXEVENT_0                               ((uint32_t)0x00000001U)                                          /*!< extern event 0 */
#define HRTIMER_EXEVENT_1                               ((uint32_t)0x00000002U)                                          /*!< extern event 1 */
#define HRTIMER_EXEVENT_2                               ((uint32_t)0x00000004U)                                          /*!< extern event 2 */
#define HRTIMER_EXEVENT_3                               ((uint32_t)0x00000008U)                                          /*!< extern event 3 */
#define HRTIMER_EXEVENT_4                               ((uint32_t)0x00000010U)                                          /*!< extern event 4 */
#define HRTIMER_EXEVENT_5                               ((uint32_t)0x00000020U)                                          /*!< extern event 5 */
#define HRTIMER_EXEVENT_6                               ((uint32_t)0x00000040U)                                          /*!< extern event 6 */
#define HRTIMER_EXEVENT_7                               ((uint32_t)0x00000080U)                                          /*!< extern event 7  */
#define HRTIMER_EXEVENT_8                               ((uint32_t)0x00000100U)                                          /*!< extern event 8 */
#define HRTIMER_EXEVENT_9                               ((uint32_t)0x00000200U)                                          /*!< extern event 9 */
                                                                                                                  
