wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* fault to configure */                                                                                          
#define HRTIMER_FAULT_0                                 ((uint32_t)0x00000000U)                                          /*!< fault 0 */
#define HRTIMER_FAULT_1                                 ((uint32_t)0x00000001U)                                          /*!< fault 1 */
#define HRTIMER_FAULT_2                                 ((uint32_t)0x00000002U)                                          /*!< fault 2 */
#define HRTIMER_FAULT_3                                 ((uint32_t)0x00000004U)                                          /*!< fault 3 */
#define HRTIMER_FAULT_4                                 ((uint32_t)0x00000008U)                                          /*!< fault 4 */
#define HRTIMER_FAULT_5                                 ((uint32_t)0x00000010U)                                          /*!< fault 5 */
#define HRTIMER_FAULT_6                                 ((uint32_t)0x00000020U)                                          /*!< fault 6 */
#define HRTIMER_FAULT_7                                 ((uint32_t)0x00000040U)                                          /*!< fault 7 */
                                                                                                                  
/* HRTIMER_ADCTRIG to configure */                                                                               
#define HRTIMER_ADCTRIG_0                               ((uint32_t)0x00000000U)                                          /*!< HRTIMER_ADCTRIG0 */
#define HRTIMER_ADCTRIG_1                               ((uint32_t)0x00000001U)                                          /*!< HRTIMER_ADCTRIG1 */
#define HRTIMER_ADCTRIG_2                               ((uint32_t)0x00000002U)                                          /*!< HRTIMER_ADCTRIG2 */
#define HRTIMER_ADCTRIG_3                               ((uint32_t)0x00000003U)                                          /*!< HRTIMER_ADCTRIG3 */
#define HRTIMER_ADCTRIG_4                               ((uint32_t)0x00000004U)                                          /*!< HRTIMER_ADCTRIG4 */
#define HRTIMER_ADCTRIG_5                               ((uint32_t)0x00000005U)                                          /*!< HRTIMER_ADCTRIG5 */
#define HRTIMER_ADCTRIG_6                               ((uint32_t)0x00000006U)                                          /*!< HRTIMER_ADCTRIG6 */
#define HRTIMER_ADCTRIG_7                               ((uint32_t)0x00000007U)                                          /*!< HRTIMER_ADCTRIG7 */
#define HRTIMER_ADCTRIG_8                               ((uint32_t)0x00000008U)                                          /*!< HRTIMER_ADCTRIG8 */
#define HRTIMER_ADCTRIG_9                               ((uint32_t)0x00000009U)                                          /*!< HRTIMER_ADCTRIG9 */

/* channel to configure */                                                                                        
#define HRTIMER_ST0_CH0                                 ((uint32_t)0x00000001U)                                          /*!< Slave_TIMER0 channel 0 */
#define HRTIMER_ST0_CH1                                 ((uint32_t)0x00000002U)                                          /*!< Slave_TIMER0 channel 1 */
#define HRTIMER_ST1_CH0                                 ((uint32_t)0x00000004U)                                          /*!< Slave_TIMER1 channel 0 */
#define HRTIMER_ST1_CH1                                 ((uint32_t)0x00000008U)                                          /*!< Slave_TIMER1 channel 1 */
#define HRTIMER_ST2_CH0                                 ((uint32_t)0x00000010U)                                          /*!< Slave_TIMER2 channel 0 */
#define HRTIMER_ST2_CH1                                 ((uint32_t)0x00000020U)                                          /*!< Slave_TIMER2 channel 1 */
#define HRTIMER_ST3_CH0                                 ((uint32_t)0x00000040U)                                          /*!< Slave_TIMER3 channel 0 */
#define HRTIMER_ST3_CH1                                 ((uint32_t)0x00000080U)                                          /*!< Slave_TIMER3 channel 1 */
#define HRTIMER_ST4_CH0                                 ((uint32_t)0x00000100U)                                          /*!< Slave_TIMER4 channel 0 */
#define HRTIMER_ST4_CH1                                 ((uint32_t)0x00000200U)                                          /*!< Slave_TIMER4 channel 1 */
#define HRTIMER_ST5_CH0                                 ((uint32_t)0x00000400U)                                          /*!< Slave_TIMER5 channel 0 */
#define HRTIMER_ST5_CH1                                 ((uint32_t)0x00000800U)                                          /*!< Slave_TIMER5 channel 1 */
#define HRTIMER_ST6_CH0                                 ((uint32_t)0x00001000U)                                          /*!< Slave_TIMER6 channel 0 */
#define HRTIMER_ST6_CH1                                 ((uint32_t)0x00002000U)                                          /*!< Slave_TIMER6 channel 1 */
#define HRTIMER_ST7_CH0                                 ((uint32_t)0x00004000U)                                          /*!< Slave_TIMER7 channel 0 */
#define HRTIMER_ST7_CH1                                 ((uint32_t)0x00008000U)                                          /*!< Slave_TIMER7 channel 1 */
                                                                                                                  
/* the counter to enable/disable */                                                                               
#define HRTIMER_MT_COUNTER                              (HRTIMER_MTCTL0_MTCEN)                                          /*!< the counter of Master_TIMER */
#define HRTIMER_ST0_COUNTER                             (HRTIMER_MTCTL0_ST0CEN)                                         /*!< the counter of Slave_TIMER0 */
#define HRTIMER_ST1_COUNTER                             (HRTIMER_MTCTL0_ST1CEN)                                         /*!< the counter of Slave_TIMER1 */
#define HRTIMER_ST2_COUNTER                             (HRTIMER_MTCTL0_ST2CEN)                                         /*!< the counter of Slave_TIMER2 */
#define HRTIMER_ST3_COUNTER                             (HRTIMER_MTCTL0_ST3CEN)                                         /*!< the counter of Slave_TIMER3 */
#define HRTIMER_ST4_COUNTER                             (HRTIMER_MTCTL0_ST4CEN)                                         /*!< the counter of Slave_TIMER4 */
#define HRTIMER_ST5_COUNTER                             (HRTIMER_MTCTL0_ST5CEN)                                         /*!< the counter of Slave_TIMER5 */
#define HRTIMER_ST6_COUNTER                             (HRTIMER_MTCTL0_ST6CEN)                                         /*!< the counter of Slave_TIMER6 */
#define HRTIMER_ST7_COUNTER                             (HRTIMER_MTCTL0_ST7CEN)                                         /*!< the counter of Slave_TIMER7 */
                                                                                                                  
/* counter clock division */                                                                                      
#define HRTIMER_PRESCALER_MUL32                         ((uint32_t)0x00000000U)                                          /* fHRTIMER_PSSCK = fHPTIM_HPCK = 32 *fHRTIMER_CK */
#define HRTIMER_PRESCALER_MUL16                         ((uint32_t)0x00000001U)                                          /* fHRTIMER_PSSCK = fHPTIM_HPCK/2 = 16 *fHRTIMER_CK */
#define HRTIMER_PRESCALER_MUL8                          ((uint32_t)0x00000002U)                                          /* fHRTIMER_PSSCK = fHPTIM_HPCK/4 = 8 *fHRTIMER_CK */
#define HRTIMER_PRESCALER_MUL4                          ((uint32_t)0x00000003U)                                          /* fHRTIMER_PSSCK = fHPTIM_HPCK/8 = 4 *fHRTIMER_CK */
#define HRTIMER_PRESCALER_MUL2                          ((uint32_t)0x00000004U)                                          /* fHRTIMER_PSSCK = fHPTIM_HPCK/16= 2*fHRTIMER_CK */
#define HRTIMER_PRESCALER_DIV1                          ((uint32_t)0x00000005U)                                          /* fHRTIMER_PSSCK = fHPTIM_HPCK/32 = fHRTIMER_CK */
#define HRTIMER_PRESCALER_DIV2                          ((uint32_t)0x00000006U)                                          /* fHRTIMER_PSSCK = fHPTIM_HPCK/64 = fHRTIMER_CK/2 */
#define HRTIMER_PRESCALER_DIV4                          ((uint32_t)0x00000007U)                                          /* fHRTIMER_PSSCK = fHPTIM_HPCK/128 = fHRTIMER_CK/4 */

/* counter operating mode */
#define HRTIMER_COUNTER_MODE_CONTINOUS                  ((uint32_t)0x00000008U)                                          /*!< the timer operates in continuous (free-running) mode */
#define HRTIMER_COUNTER_MODE_SINGLEPULSE                ((uint32_t)0x00000000U)                                          /*!< single pulse mode: the counter can be reset only if it stops (period elapsed) */
#define HRTIMER_COUNTER_MODE_SINGLEPULSE_RETRIGGERABLE  ((uint32_t)0x00000010U)                                          /*!< single pulse mode: the counter can be reset at any time (running or stopped) */

