wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* counter direction mode */
#define HRTIMER_COUNTER_UP                               ((uint32_t)0x00000000U)                                          /*!< the timer operates in continuous (free-running) mode */
#define HRTIMER_COUNTER_CENTER_ALIGNED                   (HRTIMER_STXCTL1_CAM)                                          /*!< single pulse mode: the counter can be reset only if it stops (period elapsed) */

/* half mode enable status */
#define HRTIMER_HALFMODE_DISABLED                       ((uint32_t)0x00000000U)                                          /*!< half mode disable */
#define HRTIMER_HALFMODE_ENABLED                        ((uint32_t)0x00000020U)                                          /*!< half mode enable */

/* alternate mode enable status */
#define HRTIMER_ALTERNATE_MODE_DISABLED                 ((uint32_t)0x00000000U)                                          /*!< alternate mode disabled */
#define HRTIMER_ALTERNATE_MODE_TRIPLE                   ((uint32_t)0x00000080U)                                          /*!< triple alternate mode */
#define HRTIMER_ALTERNATE_MODE_QUAD                     ((uint32_t)0x00000100U)                                          /*!< quad alternate mode */

/* re-synchronized update mode */
#define HRTIMER_RSYUPD_DISABLED                         ((uint32_t)0x00000000U)                                          /*!< re-synchronized update mode disabled */
#define HRTIMER_RSYUPD_ENABLED                          (HRTIMER_STXCTL0_RSYNUPD)                                       /*!< re-synchronized update mode enabled */

/* synchronous input start timer */
#define HRTIMER_SYNISTART_DISABLED                      ((uint32_t)0x00000000U)                                          /*!< the synchronous input signal cannot start the counter */
#define HRTIMER_SYNISTART_ENABLED                       ((uint32_t)0x00000800U)                                          /*!< the synchronous input signal can start the counter */

/* synchronous input reset timer */
#define HRTIMER_SYNCRESET_DISABLED                      ((uint32_t)0x00000000U)                                          /*!< the synchronous input signal cannot reset the counter */
#define HRTIMER_SYNCRESET_ENABLED                       ((uint32_t)0x00000400U)                                          /*!< the synchronous input signal can reset the counter */

/* trigger source to DAC */
#define HRTIMER_DAC_TRIGGER_NONE                        ((uint32_t)0x00000000U)                                          /*!< no DAC trigger event generated */
#define HRTIMER_DAC_TRIGGER_DACTRIG0                    ((uint32_t)0x02000000U)                                          /*!< DAC trigger event generated on HRTIMER_DACTRIG0 */
#define HRTIMER_DAC_TRIGGER_DACTRIG1                    ((uint32_t)0x04000000U)                                          /*!< DAC trigger event generated on HRTIMER_DACTRIG1 */
#define HRTIMER_DAC_TRIGGER_DACTRIG2                    ((uint32_t)0x06000000U)                                          /*!< DAC trigger event generated on HRTIMER_DACTRIG2 */

/* shadow registers enable status */
#define HRTIMER_SHADOW_DISABLED                         ((uint32_t)0x00000000U)                                          /*!< the shadow registers are disabled: the write access is directly done into the active registers */
#define HRTIMER_SHADOW_ENABLED                          ((uint32_t)0x08000000U)                                          /*!< the shadow registers are enabled: the write access is done into the shadow registers */

/* update event selection */
#define HRTIMER_MT_ST_UPDATE_SELECTION_INDEPENDENT      ((uint32_t)0x00000000U)                                          /*!< update event generated independently from DMA mode */
#define HRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE          ((uint32_t)0x10000000U)                                          /*!< update event generated when the DMA transfer completed in DMA mode */
#define HRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE_UPDATE   ((uint32_t)0x20000000U)                                          /*!< update event generated on the update event following the DMA transfer completed in DMA mode */
#define HRTIMER_ST_UPDATE_SELECTION_STXUPIN0            ((uint32_t)0x30000000U)                                          /*!< update event generated on the rising edge of STxUPIN0 */
#define HRTIMER_ST_UPDATE_SELECTION_STXUPIN0_UPDATE     ((uint32_t)0x60000000U)                                          /*!< update event generated on the update event following the rising edge of STxUPIN0 */
#define HRTIMER_ST_UPDATE_SELECTION_STXUPIN1            ((uint32_t)0x40000000U)                                          /*!< update event generated on the rising edge of STxUPIN1 */
#define HRTIMER_ST_UPDATE_SELECTION_STXUPIN1_UPDATE     ((uint32_t)0x70000000U)                                          /*!< update event generated on the update event following the rising edge of STxUPIN1 */
#define HRTIMER_ST_UPDATE_SELECTION_STXUPIN2            ((uint32_t)0x50000000U)                                          /*!< update event generated on the rising edge of STxUPIN2 */
#define HRTIMER_ST_UPDATE_SELECTION_STXUPIN2_UPDATE     ((uint32_t)0x80000000U)                                          /*!< update event generated on the update event following the rising edge of STxUPIN2 */

/* timer behaves during a bunch mode operation */
#define HRTIMER_TIMERBUNCHNMODE_MAINTAINCLOCK           ((uint32_t)0x00000000U)                                          /*!< counter clock(HRTIMER_PSCCK) is maintained and the counter operates normally */
#define HRTIMER_TIMERBUNCHMODE_RESETCOUNTER             ((uint32_t)0x00010000U)                                          /*!< counter clock(HRTIMER_PSCCK) is stopped and the counter is reset */

/* update event generated by repetition event */
#define HRTIMER_UPDATEONREPETITION_DISABLED             ((uint32_t)0x00000000U)                                          /*!< update event generated by repetition event disable */
#define HRTIMER_UPDATEONREPETITION_ENABLED              ((uint32_t)0x20000000U)                                          /*!< update event generated by repetition event enable */

/* set balanced mode */
#define HRTIMER_STXBALANCEDMODE_DISABLED                ((uint32_t)0x00000000U)                                          /*!< balanced mode disabled */ 
#define HRTIMER_STXBALANCEDMODE_ENABLED                 ((uint32_t)0x00000040U)                                          /*!< balanced mode enabled */

/* faut channel enabled for a Slave_TIMER */
#define HRTIMER_STXFAULTENABLE_NONE                     ((uint32_t)0x00000000U)                                          /*!< no fault enabled */ 
#define HRTIMER_STXFAULTENABLE_FAULT0                   (HRTIMER_STXFLTCTL_FLT0EN)                                       /*!< fault 0 enabled */ 
#define HRTIMER_STXFAULTENABLE_FAULT1                   (HRTIMER_STXFLTCTL_FLT1EN)                                       /*!< fault 1 enabled */ 
#define HRTIMER_STXFAULTENABLE_FAULT2                   (HRTIMER_STXFLTCTL_FLT2EN)                                       /*!< fault 2 enabled */
#define HRTIMER_STXFAULTENABLE_FAULT3                   (HRTIMER_STXFLTCTL_FLT3EN)                                       /*!< fault 3 enabled */
#define HRTIMER_STXFAULTENABLE_FAULT4                   (HRTIMER_STXFLTCTL_FLT4EN)                                       /*!< fault 4 enabled */
#define HRTIMER_STXFAULTENABLE_FAULT5                   (HRTIMER_STXFLTCTL_FLT5EN)                                       /*!< fault 5 enabled */
#define HRTIMER_STXFAULTENABLE_FAULT6                   (HRTIMER_STXFLTCTL_FLT6EN)                                       /*!< fault 6 enabled */
#define HRTIMER_STXFAULTENABLE_FAULT7                   (HRTIMER_STXFLTCTL_FLT7EN)                                       /*!< fault 7 enabled */

