wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* protect fault enable */
#define HRTIMER_STXFAULT_PROTECT_READWRITE              ((uint32_t)0x00000000U)                                          /*!< protect disable. FLTyEN (y=0..7) is writable */
#define HRTIMER_STXFAULT_PROTECT_READONLY               (HRTIMER_STXFLTCTL_FLTENPROT)                                    /*!< protect enable. FLTyEN (y=0..7) is read-only */

/* fault automatic resume enable */
#define HRTIMER_STXFAULT_AUTOMATIC_RESUME_DISABLED      ((uint32_t)0x00000000U)                                          /*!< fault automatic resume disable */
#define HRTIMER_STXFAULT_AUTOMATIC_RESUME_ENABLED       (HRTIMER_STXACTL_FLTAR)                                          /*!< fault automatic resume enable */

/* dead time enable */
#define HRTIMER_STXDEADTIME_DISABLED                    ((uint32_t)0x00000000U)                                          /*!< channel 0 and channel 1 outputs are independent. */
#define HRTIMER_STXDEADTIME_ENABLED                     (HRTIMER_STXCHOCTL_DTEN)                                         /*!< channel 0 and channel 1 outputs are complementary and dead-time is inserted between channel 0 and channel 1 outputs */

/* set delayed IDLE state mode */
#define HRTIMER_STXDELAYED_IDLE_DISABLED                ((uint32_t)0x00000000U)                                          /*!< no action */
#define HRTIMER_STXDELAYED_IDLE_CH0_EEV57               (HRTIMER_STXCHOCTL_DLYISMEN)                                     /*!< channel 0 output delayed IDLE on external event 5 or 7 */
#define HRTIMER_STXDELAYED_IDLE_CH1_EEV57               (((uint32_t)0x00000400U) | HRTIMER_STXCHOCTL_DLYISMEN)           /*!< channel 1 output delayed IDLE on external event 5 or 7 */
#define HRTIMER_STXDELAYED_IDLE_BOTH_EEV57              (((uint32_t)0x00000800U) | HRTIMER_STXCHOCTL_DLYISMEN)           /*!< channel 0 and channel 1 output delayed IDLE on external event 5 or 7 */
#define HRTIMER_STXDELAYED_IDLE_BALANCED_EEV57          (((uint32_t)0x00000C00U) | HRTIMER_STXCHOCTL_DLYISMEN)           /*!< balanced IDLE on external event 5 or 7 */      
#define HRTIMER_STXDELAYED_IDLE_CH0_DEEV68              (((uint32_t)0x00001000U) | HRTIMER_STXCHOCTL_DLYISMEN)           /*!< channel 0 output delayed IDLE on external event 6 or 8 */
#define HRTIMER_STXDELAYED_IDLE_CH1_DEEV68              (((uint32_t)0x00001400U) | HRTIMER_STXCHOCTL_DLYISMEN)           /*!< channel 1 output delayed IDLE on external event 6 or 8 */
#define HRTIMER_STXDELAYED_IDLE_BOTH_EEV68              (((uint32_t)0x00001800U) | HRTIMER_STXCHOCTL_DLYISMEN)           /*!< channel 0 and channel 1 output delayed IDLE on external event 6 or 8 */
#define HRTIMER_STXDELAYED_IDLE_BALANCED_EEV68          (((uint32_t)0x00001C00U) | HRTIMER_STXCHOCTL_DLYISMEN)           /*!< balanced IDLE on external event 6 or 8 */

/* balanced idle automatic resumption enable */
#define HRTIMER_BALANE_IDLE_AUTOMATIC_RESUME_DISABLE    ((uint32_t)0x00000000U)                                          /*!< balanced idle automatic resumption disable */
#define HRTIMER_BALANE_IDLE_AUTOMATIC_RESUME_ENABLE     (HRTIMER_STXCHOCTL_BALIAR)                                       /*!< balanced idle automatic resumption enable */

/* update is done synchronously with any other Slave_TIMER or Master_TIMER update */
#define HRTIMER_STXUPDATETRIGGER_NONE                   ((uint64_t)0x0000000000000000U)                                  /*!< register update is disabled */    
#define HRTIMER_STXUPDATETRIGGER_MASTER                 (HRTIMER_STXCTL0_UPBMT)                                          /*!< update by Master_TIMER update event */    
#define HRTIMER_STXUPDATETRIGGER_ST0                    (HRTIMER_STXCTL0_UPBST0)                                         /*!< update by Slave_TIMER0 update event */    
#define HRTIMER_STXUPDATETRIGGER_ST1                    (HRTIMER_STXCTL0_UPBST1)                                         /*!< update by Slave_TIMER1 update event */    
#define HRTIMER_STXUPDATETRIGGER_ST2                    (HRTIMER_STXCTL0_UPBST2)                                         /*!< update by Slave_TIMER2 update event */    
#define HRTIMER_STXUPDATETRIGGER_ST3                    (HRTIMER_STXCTL0_UPBST3)                                         /*!< update by Slave_TIMER3 update event */    
#define HRTIMER_STXUPDATETRIGGER_ST4                    (HRTIMER_STXCTL0_UPBST4)                                         /*!< update by Slave_TIMER4 update event */    
#define HRTIMER_STXUPDATETRIGGER_ST5                    (HRTIMER_STXCTL0_UPBST5)                                         /*!< update by Slave_TIMER5 update event */
#define HRTIMER_STXUPDATETRIGGER_ST6                    (((uint64_t)(HRTIMER_STXACTL_UPBST6)) << 32)                     /*!< update by Slave_TIMER6 update event */
#define HRTIMER_STXUPDATETRIGGER_ST7                    (((uint64_t)(HRTIMER_STXACTL_UPBST7)) << 32)                     /*!< update by Slave_TIMER7 update event */

/* Slave_TIMER counter reset */
#define HRTIMER_STXCNT_RESET_NONE                       ((uint64_t)0x0000000000000000U)                                  /*!< no counter reset trigger */
#define HRTIMER_STXCNT_RESET_OTHER4_CMP0                BIT(0)                                                           /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 0 event */
#define HRTIMER_STXCNT_RESET_ST5_CMP0                   BIT(0)                                                           /*!< the Slave_TIMER 0~4 counter is reset upon Slave_TIMER5 compare 0 event */ 
#define HRTIMER_STXCNT_RESET_UPDATE                     (HRTIMER_STXCNTRST_UPRST)                                        /*!< the Slave_TIMER counter is reset upon update event */    
#define HRTIMER_STXCNT_RESET_CMP1                       (HRTIMER_STXCNTRST_CMP1RST)                                      /*!< the Slave_TIMER counter is reset upon Slave_TIMER compare 1 event */
#define HRTIMER_STXCNT_RESET_CMP3                       (HRTIMER_STXCNTRST_CMP3RST)                                      /*!< the Slave_TIMER counter is reset upon Slave_TIMER compare 3 event */
#define HRTIMER_STXCNT_RESET_MASTER_PER                 (HRTIMER_STXCNTRST_MTPERRST)                                     /*!< the Slave_TIMER counter is reset upon Master_TIMER period event */
#define HRTIMER_STXCNT_RESET_MASTER_CMP0                (HRTIMER_STXCNTRST_MTCMP0RST)                                    /*!< the Slave_TIMER counter is reset upon Master_TIMER compare 0 event */
#define HRTIMER_STXCNT_RESET_MASTER_CMP1                (HRTIMER_STXCNTRST_MTCMP1RST)                                    /*!< the Slave_TIMER counter is reset upon Master_TIMER compare 1 event */
#define HRTIMER_STXCNT_RESET_MASTER_CMP2                (HRTIMER_STXCNTRST_MTCMP2RST)                                    /*!< the Slave_TIMER counter is reset upon Master_TIMER compare 2 event */
#define HRTIMER_STXCNT_RESET_MASTER_CMP3                (HRTIMER_STXCNTRST_MTCMP3RST)                                    /*!< the Slave_TIMER counter is reset upon Master_TIMER compare 3 event */
#define HRTIMER_STXCNT_RESET_EEV_0                      (HRTIMER_STXCNTRST_EXEV0RST)                                     /*!< the Slave_TIMER counter is reset upon external event 0 */
#define HRTIMER_STXCNT_RESET_EEV_1                      (HRTIMER_STXCNTRST_EXEV1RST)                                     /*!< the Slave_TIMER counter is reset upon external event 1 */
#define HRTIMER_STXCNT_RESET_EEV_2                      (HRTIMER_STXCNTRST_EXEV2RST)                                     /*!< the Slave_TIMER counter is reset upon external event 2 */
#define HRTIMER_STXCNT_RESET_EEV_3                      (HRTIMER_STXCNTRST_EXEV3RST)                                     /*!< the Slave_TIMER counter is reset upon external event 3 */
#define HRTIMER_STXCNT_RESET_EEV_4                      (HRTIMER_STXCNTRST_EXEV4RST)                                     /*!< the Slave_TIMER counter is reset upon external event 4 */
#define HRTIMER_STXCNT_RESET_EEV_5                      (HRTIMER_STXCNTRST_EXEV5RST)                                     /*!< the Slave_TIMER counter is reset upon external event 5 */
#define HRTIMER_STXCNT_RESET_EEV_6                      (HRTIMER_STXCNTRST_EXEV6RST)                                     /*!< the Slave_TIMER counter is reset upon external event 6 */
#define HRTIMER_STXCNT_RESET_EEV_7                      (HRTIMER_STXCNTRST_EXEV7RST)                                     /*!< the Slave_TIMER counter is reset upon external event 7 */
#define HRTIMER_STXCNT_RESET_EEV_8                      (HRTIMER_STXCNTRST_EXEV8RST)                                     /*!< the Slave_TIMER counter is reset upon external event 8 */
#define HRTIMER_STXCNT_RESET_EEV_9                      (HRTIMER_STXCNTRST_EXEV9RST)                                     /*!< the Slave_TIMER counter is reset upon external event 9 */
#define HRTIMER_STXCNT_RESET_OTHER0_CMP0                BIT(19)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 0 event */
#define HRTIMER_STXCNT_RESET_OTHER0_CMP1                BIT(20)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 1 event */
#define HRTIMER_STXCNT_RESET_OTHER0_CMP3                BIT(21)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 3 event */
#define HRTIMER_STXCNT_RESET_OTHER1_CMP0                BIT(22)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 0 event */
#define HRTIMER_STXCNT_RESET_OTHER1_CMP1                BIT(23)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 1 event */
#define HRTIMER_STXCNT_RESET_OTHER1_CMP3                BIT(24)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 3 event */
#define HRTIMER_STXCNT_RESET_OTHER2_CMP0                BIT(25)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 0 event */
#define HRTIMER_STXCNT_RESET_OTHER2_CMP1                BIT(26)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 1 event */
#define HRTIMER_STXCNT_RESET_OTHER2_CMP3                BIT(27)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 3 event */
#define HRTIMER_STXCNT_RESET_OTHER3_CMP0                BIT(28)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 0 event */
#define HRTIMER_STXCNT_RESET_OTHER3_CMP1                BIT(29)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 1 event */
#define HRTIMER_STXCNT_RESET_OTHER3_CMP3                BIT(30)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 3 event */
#define HRTIMER_STXCNT_RESET_OTHER4_CMP1                BIT(31)                                                          /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 1 event */
#define HRTIMER_STXCNT_RESET_OTHER4_CMP3                (((uint64_t)BIT(0)) << 32)                                       /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 3 event */
#define HRTIMER_STXCNT_RESET_OTHER5_CMP0                (((uint64_t)BIT(1)) << 32)                                       /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 0 event */
#define HRTIMER_STXCNT_RESET_OTHER5_CMP1                (((uint64_t)BIT(2)) << 32)                                       /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 1 event */
#define HRTIMER_STXCNT_RESET_OTHER5_CMP3                (((uint64_t)BIT(3)) << 32)                                       /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 3 event */
#define HRTIMER_STXCNT_RESET_OTHER6_CMP0                (((uint64_t)BIT(4)) << 32)                                       /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 0 event */
#define HRTIMER_STXCNT_RESET_OTHER6_CMP1                (((uint64_t)BIT(5)) << 32)                                       /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 1 event */
#define HRTIMER_STXCNT_RESET_OTHER6_CMP3                (((uint64_t)BIT(6)) << 32)                                       /*!< the Slave_TIMER counter is reset upon other Slave_TIMER compare 3 event */

/* update event generated by reset event */
#define HRTIMER_STXUPDATEONRESET_DISABLED               ((uint32_t)0x00000000U)                                          /*!< update event generated by reset event or roll-over event disable */
#define HRTIMER_STXUPDATEONRESET_ENABLED                (HRTIMER_STXCTL0_UPRST)                                          /*!< update event generated by reset event or roll-over event enable */

/* compare 3 or 1 delayed mode */
#define HRTIMER_DELAYEDMODE_DISABLE                     ((uint32_t)0x00000000U)                                          /*!< delayed mode disable */
#define HRTIMER_DELAYEDMODE_NOTIMEOUT                   ((uint32_t)0x00001000U)                                          /*!< compare event generated only if a capture has occurred */
#define HRTIMER_DELAYEDMODE_TIMEOUTCMP0                 ((uint32_t)0x00002000U)                                          /*!< compare event generated if a capture has occurred or after a compare 0 match (timeout if capture event is missing) */
#define HRTIMER_DELAYEDMODE_TIMEOUTCMP2                 ((uint32_t)0x00003000U)                                          /*!< compare event generated if a capture has occurred or after a compare 2 match (timeout if capture event is missing) */

/* capture trigger source */
#define HRTIMER_CAPTURETRIGGER_NONE                     ((uint64_t)0x0000000000000000U)                                  /*!< capture trigger is disabled */    
#define HRTIMER_CAPTURETRIGGER_UPDATE                   (HRTIMER_STXCAP0TRG_CP0BUP)                                      /*!< capture triggered by update event */    
#define HRTIMER_CAPTURETRIGGER_EXEV_0                   (HRTIMER_STXCAP0TRG_CP0BEXEV0)                                   /*!< capture triggered by external event 0 */    
#define HRTIMER_CAPTURETRIGGER_EXEV_1                   (HRTIMER_STXCAP0TRG_CP0BEXEV1)                                   /*!< capture triggered by external event 1 */    
#define HRTIMER_CAPTURETRIGGER_EXEV_2                   (HRTIMER_STXCAP0TRG_CP0BEXEV2)                                   /*!< capture triggered by external event 2 */    
#define HRTIMER_CAPTURETRIGGER_EXEV_3                   (HRTIMER_STXCAP0TRG_CP0BEXEV3)                                   /*!< capture triggered by external event 3 */    
#define HRTIMER_CAPTURETRIGGER_EXEV_4                   (HRTIMER_STXCAP0TRG_CP0BEXEV4)                                   /*!< capture triggered by external event 4 */    
#define HRTIMER_CAPTURETRIGGER_EXEV_5                   (HRTIMER_STXCAP0TRG_CP0BEXEV5)                                   /*!< capture triggered by external event 5 */    
#define HRTIMER_CAPTURETRIGGER_EXEV_6                   (HRTIMER_STXCAP0TRG_CP0BEXEV6)                                   /*!< capture triggered by external event 6 */    
#define HRTIMER_CAPTURETRIGGER_EXEV_7                   (HRTIMER_STXCAP0TRG_CP0BEXEV7)                                   /*!< capture triggered by external event 7 */    
#define HRTIMER_CAPTURETRIGGER_EXEV_8                   (HRTIMER_STXCAP0TRG_CP0BEXEV8)                                   /*!< capture triggered by external event 8 */    
#define HRTIMER_CAPTURETRIGGER_EXEV_9                   (HRTIMER_STXCAP0TRG_CP0BEXEV9)                                   /*!< capture triggered by external event 9 */    
#define HRTIMER_CAPTURETRIGGER_ST0_ACTIVE               (HRTIMER_STXCAP0TRG_CP0BST0A)                                    /*!< capture triggered by ST0CH0_O output inactive to active transition */
#define HRTIMER_CAPTURETRIGGER_ST0_INACTIVE             (HRTIMER_STXCAP0TRG_CP0BST0NA)                                   /*!< capture triggered by ST0CH0_O output active to inactive transition */
#define HRTIMER_CAPTURETRIGGER_ST0_CMP0                 (HRTIMER_STXCAP0TRG_CP0BST0CMP0)                                 /*!< capture triggered by compare 0 event of Slave_TIMER0 */
#define HRTIMER_CAPTURETRIGGER_ST0_CMP1                 (HRTIMER_STXCAP0TRG_CP0BST0CMP1)                                 /*!< capture triggered by compare 0 event of Slave_TIMER0 */
#define HRTIMER_CAPTURETRIGGER_ST1_ACTIVE               (HRTIMER_STXCAP0TRG_CP0BST1A)                                    /*!< capture triggered by ST1CH0_O output inactive to active transition */
#define HRTIMER_CAPTURETRIGGER_ST1_INACTIVE             (HRTIMER_STXCAP0TRG_CP0BST1NA)                                   /*!< capture triggered by ST1CH0_O output active to inactive transition */
#define HRTIMER_CAPTURETRIGGER_ST1_CMP0                 (HRTIMER_STXCAP0TRG_CP0BST1CMP0)                                 /*!< capture triggered by compare 0 event of Slave_TIMER1 */
#define HRTIMER_CAPTURETRIGGER_ST1_CMP1                 (HRTIMER_STXCAP0TRG_CP0BST1CMP1)                                 /*!< capture triggered by compare 0 event of Slave_TIMER1 */
#define HRTIMER_CAPTURETRIGGER_ST2_ACTIVE               (HRTIMER_STXCAP0TRG_CP0BST2A)                                    /*!< capture triggered by ST2CH0_O output inactive to active transition */
#define HRTIMER_CAPTURETRIGGER_ST2_INACTIVE             (HRTIMER_STXCAP0TRG_CP0BST2NA)                                   /*!< capture triggered by ST2CH0_O output active to inactive transition */
#define HRTIMER_CAPTURETRIGGER_ST2_CMP0                 (HRTIMER_STXCAP0TRG_CP0BST2CMP0)                                 /*!< capture triggered by compare 0 event of Slave_TIMER2 */
#define HRTIMER_CAPTURETRIGGER_ST2_CMP1                 (HRTIMER_STXCAP0TRG_CP0BST2CMP1)                                 /*!< capture triggered by compare 0 event of Slave_TIMER2 */
#define HRTIMER_CAPTURETRIGGER_ST3_ACTIVE               (HRTIMER_STXCAP0TRG_CP0BST3A)                                    /*!< capture triggered by ST3CH0_O output inactive to active transition */
#define HRTIMER_CAPTURETRIGGER_ST3_INACTIVE             (HRTIMER_STXCAP0TRG_CP0BST3NA)                                   /*!< capture triggered by ST3CH0_O output active to inactive transition */
#define HRTIMER_CAPTURETRIGGER_ST3_CMP0                 (HRTIMER_STXCAP0TRG_CP0BST3CMP0)                                 /*!< capture triggered by compare 0 event of Slave_TIMER3 */
#define HRTIMER_CAPTURETRIGGER_ST3_CMP1                 (HRTIMER_STXCAP0TRG_CP0BST3CMP1)                                 /*!< capture triggered by compare 0 event of Slave_TIMER3 */
#define HRTIMER_CAPTURETRIGGER_ST4_ACTIVE               (HRTIMER_STXCAP0TRG_CP0BST4A)                                    /*!< capture triggered by ST4CH0_O output inactive to active transition */
#define HRTIMER_CAPTURETRIGGER_ST4_INACTIVE             (HRTIMER_STXCAP0TRG_CP0BST4NA)                                   /*!< capture triggered by ST4CH0_O output active to inactive transition */
#define HRTIMER_CAPTURETRIGGER_ST4_CMP0                 (HRTIMER_STXCAP0TRG_CP0BST4CMP0)                                 /*!< capture triggered by compare 0 event of Slave_TIMER4 */
#define HRTIMER_CAPTURETRIGGER_ST4_CMP1                 (HRTIMER_STXCAP0TRG_CP0BST4CMP1)                                 /*!< capture triggered by compare 0 event of Slave_TIMER4 */
#define HRTIMER_CAPTURETRIGGER_ST5_ACTIVE               (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST5A) << 32)                /*!< capture triggered by ST5CH0_O output inactive to active transition */
#define HRTIMER_CAPTURETRIGGER_ST5_INACTIVE             (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST5NA) << 32)               /*!< capture triggered by ST5CH0_O output active to inactive transition */
#define HRTIMER_CAPTURETRIGGER_ST5_CMP0                 (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST5CMP0) << 32)             /*!< capture triggered by compare 0 event of Slave_TIMER5 */
#define HRTIMER_CAPTURETRIGGER_ST5_CMP1                 (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST5CMP1) << 32)             /*!< capture triggered by compare 0 event of Slave_TIMER5 */
#define HRTIMER_CAPTURETRIGGER_ST6_ACTIVE               (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST6A) << 32)                /*!< capture triggered by ST6CH0_O output inactive to active transition */
#define HRTIMER_CAPTURETRIGGER_ST6_INACTIVE             (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST6NA) << 32)               /*!< capture triggered by ST6CH0_O output active to inactive transition */
#define HRTIMER_CAPTURETRIGGER_ST6_CMP0                 (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST6CMP0) << 32)             /*!< capture triggered by compare 0 event of Slave_TIMER6 */
#define HRTIMER_CAPTURETRIGGER_ST6_CMP1                 (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST6CMP1) << 32)             /*!< capture triggered by compare 0 event of Slave_TIMER6 */
#define HRTIMER_CAPTURETRIGGER_ST7_ACTIVE               (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST7A) << 32)                /*!< capture triggered by ST7CH0_O output inactive to active transition */
#define HRTIMER_CAPTURETRIGGER_ST7_INACTIVE             (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST7NA) << 32)               /*!< capture triggered by ST7CH0_O output active to inactive transition */
#define HRTIMER_CAPTURETRIGGER_ST7_CMP0                 (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST7CMP0) << 32)             /*!< capture triggered by compare 0 event of Slave_TIMER7 */
#define HRTIMER_CAPTURETRIGGER_ST7_CMP1                 (((uint64_t)HRTIMER_STXCAPTRGCOM_CP0BST7CMP1) << 32)             /*!< capture triggered by compare 0 event of Slave_TIMER7 */

