wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* external event filter mode */
#define HRTIMER_EXEVFILTER_DISABLE                      ((uint32_t)0x00000000U)                                          /* filter mode disable */   
#define HRTIMER_EXEVFILTER_BLANKINGCMP0                 ((uint32_t)0x00000002U)                                          /*!< blanking mode. the blank is from counter reset/roll-over to HRTIMER_STxCMP0V */
#define HRTIMER_EXEVFILTER_WINDOWINGCMP1_WITH2          ((uint32_t)0x00000004U)                                          /*!< windowing mode. the windowing is from counter reset/roll-over to HRTIMER_STxCMP1V */
#define HRTIMER_EXEVFILTER_BLANKINGCMP2                 ((uint32_t)0x00000006U)                                          /*!< blanking mode. the blank is from counter reset/roll-over to HRTIMER_STxCMP2V */
#define HRTIMER_EXEVFILTER_WINDOWINGCMP3                ((uint32_t)0x00000008U)                                          /*!< windowing mode. the windowing is from counter reset/roll-over to HRTIMER_STxCMP3V */
#define HRTIMER_EXEVFILTER_BLANKINGSRC0                 ((uint32_t)0x0000000AU)                                          /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC0 */
#define HRTIMER_EXEVFILTER_BLANKINGSRC1                 ((uint32_t)0x0000000CU)                                          /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC1 */
#define HRTIMER_EXEVFILTER_BLANKINGSRC2                 ((uint32_t)0x0000000EU)                                          /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC2 */
#define HRTIMER_EXEVFILTER_BLANKINGSRC3                 ((uint32_t)0x00000010U)                                          /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC3 */
#define HRTIMER_EXEVFILTER_BLANKINGSRC4                 ((uint32_t)0x00000012U)                                          /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC4 */
#define HRTIMER_EXEVFILTER_BLANKINGSRC5                 ((uint32_t)0x00000014U)                                          /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC5 */
#define HRTIMER_EXEVFILTER_BLANKINGSRC6                 ((uint32_t)0x00000016U)                                          /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC6 */
#define HRTIMER_EXEVFILTER_BLANKINGSRC7                 ((uint32_t)0x00000018U)                                          /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC7 */
#define HRTIMER_EXEVFILTER_WINDOWINGCMP1                ((uint32_t)0x0000001AU)                                          /*!< windowing mode. the windowing is from counter reset/roll-over to HRTIMER_STxCMP1V */
#define HRTIMER_EXEVFILTER_WINDOWINGCMP2                ((uint32_t)0x0000001CU)                                          /*!< windowing mode. the windowing is from counter reset/roll-over to HRTIMER_STxCMP2V */
#define HRTIMER_EXEVFILTER_WINDOWINGSRC                 ((uint32_t)0x0000001EU)                                          /*!< windowing mode. the windowing is from other Slave_TIMERy(not Slave_TIMERx):STWDSRC */
#define HRTIMER_EXEVFILTER_BLANKINGSRC8                 ((uint32_t)0x00000020U)                                          /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC8 */
#define HRTIMER_EXEVFILTER_BLANKINGSRC9                 ((uint32_t)0x00000022U)                                          /*!< blanking mode. the blank is from other Slave_TIMERy(not Slave_TIMERx): STBLKSRC9 */

/* external event memorized enable */
#define HRTIMER_EXEVMEMORIZED_DISABLE                   ((uint32_t)0x00000000U)                                          /*!< external event memory disable */
#define HRTIMER_EXEVMEMORIZED_ENABLE                    (HRTIMER_STXEXEVFCFG0_EXEV0MEEN)                                 /*!< external event memory  enable. the memorized event is generated as soon as the blanking period or windowing period is completed */

/* dead time prescaler */
#define HRTIMER_DEADTIME_PRESCALER_MUL32                ((uint32_t)0x00000009U)                                          /*!< fHRTIMER_DTGCK = 32* fHRTIMER_CK */
#define HRTIMER_DEADTIME_PRESCALER_MUL16                ((uint32_t)0x00000008U)                                          /*!< fHRTIMER_DTGCK = 16* fHRTIMER_CK */
#define HRTIMER_DEADTIME_PRESCALER_MUL8                 ((uint32_t)0x00000000U)                                          /*!< fHRTIMER_DTGCK = 8*fHRTIMER_CK */
#define HRTIMER_DEADTIME_PRESCALER_MUL4                 ((uint32_t)0x00000001U)                                          /*!< fHRTIMER_DTGCK = (8*fHRTIMER_CK)/2 = 4*fHRTIMER_CK */
#define HRTIMER_DEADTIME_PRESCALER_MUL2                 ((uint32_t)0x00000002U)                                          /*!< fHRTIMER_DTGCK = (8*fHRTIMER_CK)/4 = 2*fHRTIMER_CK */
#define HRTIMER_DEADTIME_PRESCALER_DIV1                 ((uint32_t)0x00000003U)                                          /*!< fHRTIMER_DTGCK = (8*fHRTIMER_CK)/8 = fHRTIMER_CK*/
#define HRTIMER_DEADTIME_PRESCALER_DIV2                 ((uint32_t)0x00000004U)                                          /*!< fHRTIMER_DTGCK = (8*fHRTIMER_CK)/16 = fHRTIMER_CK / 2 */
#define HRTIMER_DEADTIME_PRESCALER_DIV4                 ((uint32_t)0x00000005U)                                          /*!< fHRTIMER_DTGCK = (8*fHRTIMER_CK)/32 = fHRTIMER_CK / 4 */
#define HRTIMER_DEADTIME_PRESCALER_DIV8                 ((uint32_t)0x00000006U)                                          /*!< fHRTIMER_DTGCK = (8*fHRTIMER_CK)/64 = fHRTIMER_CK / 8 */
#define HRTIMER_DEADTIME_PRESCALER_DIV16                ((uint32_t)0x00000007U)                                          /*!< fHRTIMER_DTGCK = (8*fHRTIMER_CK)/128 = fHRTIMER_CK / 16 */

/* dead time rising sign */
#define HRTIMER_DEADTIME_RISINGSIGN_POSITIVE            ((uint32_t)0x00000000U)                                          /*!< the sign of rising edge dead-time value is positive */
#define HRTIMER_DEADTIME_RISINGSIGN_NEGATIVE            (HRTIMER_STXDTCTL_DTRS)                                          /*!< the sign of rising edge dead-time value is negative */

/* dead time rising edge protection for value and sign */
#define HRTIMER_DEADTIME_RISING_PROTECT_DISABLE         ((uint32_t)0x00000000U)                                          /*!< protect disable. DTRS and DTRCFG[15:0] register are writable */
#define HRTIMER_DEADTIME_RISING_PROTECT_ENABLE          (HRTIMER_STXDTCTL_DTRSVPROT)                                     /*!< protect enable. DTRS and DTRCFG[15:0] are read-only */

/* dead time rising edge protection only for sign */
#define HRTIMER_DEADTIME_RISINGSIGN_PROTECT_DISABLE     ((uint32_t)0x00000000U)                                          /*!< protect disable. DTRS bit is writable */
#define HRTIMER_DEADTIME_RISINGSIGN_PROTECT_ENABLE      (HRTIMER_STXDTCTL_DTRSPROT)                                      /*!< protect enable. DTRS bit is read-only */

/* dead time falling sign */
#define HRTIMER_DEADTIME_FALLINGSIGN_POSITIVE           ((uint32_t)0x00000000U)                                          /*!< the sign of falling edge dead-time value is positive */
#define HRTIMER_DEADTIME_FALLINGSIGN_NEGATIVE           (HRTIMER_STXDTCTL_DTFS)                                          /*!< the sign of falling edge dead-time value is negative */

