wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* dead time falling edge protection for value and sign */
#define HRTIMER_DEADTIME_FALLING_PROTECT_DISABLE        ((uint32_t)0x00000000U)                                          /*!< protect disable. DTFS and DTFCFG[15:0] register are writable */
#define HRTIMER_DEADTIME_FALLING_PROTECT_ENABLE         (HRTIMER_STXDTCTL_DTFSVPROT)                                     /*!< protect enable. DTFS and DTFCFG[15:0] are read-only */

/* dead time falling edge protection only for sign */
#define HRTIMER_DEADTIME_FALLINGSIGN_PROTECT_DISABLE    ((uint32_t)0x00000000U)                                          /*!< protect disable. DTFS bit is writable */
#define HRTIMER_DEADTIME_FALLINGSIGN_PROTECT_ENABLE     (HRTIMER_STXDTCTL_DTFSPROT)                                      /*!< protect enable. DTFS bit is read-only */

/* the registers that can be written by DMA mode */
#define HRTIMER_DMAMODE_NONE                            ((uint32_t)0x00000000U)                                          /*!< no register is updated by DMA mode */
#define HRTIMER_DMAMODE_CTL0                            (HRTIMER_DMAUPSTXR_STXCTL0)                                      /*!< MTCTL0 or STxCTL0 register is updated by DMA mode */
#define HRTIMER_DMAMODE_INTC                            (HRTIMER_DMAUPSTXR_STXINTC)                                      /*!< MT or STx register is updated by DMA mode */
#define HRTIMER_DMAMODE_DMAINTEN                        (HRTIMER_DMAUPSTXR_STXDMAINTEN)                                  /*!< MTINTC or STxINTC register is updated by DMA mode */
#define HRTIMER_DMAMODE_CNT                             (HRTIMER_DMAUPSTXR_STXCNT)                                       /*!< MTCNT or STxCNT register is updated by DMA mode */
#define HRTIMER_DMAMODE_CAR                             (HRTIMER_DMAUPSTXR_STXCAR)                                       /*!< MTCAR or STxCAR register is updated by DMA mode */
#define HRTIMER_DMAMODE_CREP                            (HRTIMER_DMAUPSTXR_STXCREP)                                      /*!< MTCREP or STxCREP register is updated by DMA mode */
#define HRTIMER_DMAMODE_CMP0V                           (HRTIMER_DMAUPSTXR_STXCMP0V)                                     /*!< MTCMP0V or STxCMP0V register is updated by DMA mode */
#define HRTIMER_DMAMODE_CMP1V                           (HRTIMER_DMAUPSTXR_STXCMP1V)                                     /*!< MTCMP1V or STxCMP1V register is updated by DMA mode */
#define HRTIMER_DMAMODE_CMP2V                           (HRTIMER_DMAUPSTXR_STXCMP2V)                                     /*!< MTCMP2V or STxCMP2V register is updated by DMA mode */
#define HRTIMER_DMAMODE_CMP3V                           (HRTIMER_DMAUPSTXR_STXCMP3V)                                     /*!< MTCMP3V or STxCMP3V register is updated by DMA mode */
#define HRTIMER_DMAMODE_DTCTL                           (HRTIMER_DMAUPSTXR_STXDTCTL)                                     /*!< STxDTCTL register is updated by DMA mode */
#define HRTIMER_DMAMODE_CH0SET                          (HRTIMER_DMAUPSTXR_STXCH0SET)                                    /*!< STxCH0SET register is updated by DMA mode */
#define HRTIMER_DMAMODE_CH0RST                          (HRTIMER_DMAUPSTXR_STXCH0RST)                                    /*!< STxCH0RST register is updated by DMA mode */
#define HRTIMER_DMAMODE_CH1SET                          (HRTIMER_DMAUPSTXR_STXCH1SET)                                    /*!< STxCH1SET register is updated by DMA mode */
#define HRTIMER_DMAMODE_CH1RST                          (HRTIMER_DMAUPSTXR_STXCH1RST)                                    /*!< STxCH1RST register is updated by DMA mode */
#define HRTIMER_DMAMODE_EXEVFCFG0                       (HRTIMER_DMAUPSTXR_STXEXEVFCFG0)                                 /*!< STxEXEVFCFG0 register is updated by DMA mode */
#define HRTIMER_DMAMODE_EXEVFCFG1                       (HRTIMER_DMAUPSTXR_STXEXEVFCFG1)                                 /*!< STxEXEVFCFG1 register is updated by DMA mode */
#define HRTIMER_DMAMODE_CNTRST                          (HRTIMER_DMAUPSTXR_STXCNTRST)                                    /*!< STxCNTRST register is updated by DMA mode */
#define HRTIMER_DMAMODE_CSCTL                           (HRTIMER_DMAUPSTXR_STXCSCTL)                                     /*!< STxCSCTL register is updated by DMA mode */
#define HRTIMER_DMAMODE_CHOCTL                          (HRTIMER_DMAUPSTXR_STXCHOCTL)                                    /*!< STxCHOCTL register is updated by DMA mode */
#define HRTIMER_DMAMODE_FLTCTL                          (HRTIMER_DMAUPSTXR_STXFLTCTL)                                    /*!< STxFLTCTL register is updated by DMA mode */
#define HRTIMER_DMAMODE_CTL1                            (HRTIMER_DMAUPSTXR_STxCTL1)                                      /*!< STxCTL1 register is updated by DMA mode */
#define HRTIMER_DMAMODE_EXEVFCFG2                       (HRTIMER_DMAUPSTXR_STXEXEVFCFG2)                                 /*!< STxEXEVFCFG2 register is updated by DMA mode */
#define HRTIMER_DMAMODE_ACTL                            (HRTIMER_DMAUPSTXR_STXACTL)                                      /*!< STxACTL register is updated by DMA mode */

/* the synchronization input source */
#define HRTIMER_SYNCINPUTSOURCE_DISABLE                 ((uint32_t)0x00000000U)                                          /*!< synchronization input disable */
#define HRTIMER_SYNCINPUTSOURCE_INTERNAL                ((uint32_t)0x00000200U)                                          /*!< internal signal: TIMER0_TRGO in the advanced timer TIMER0 */
#define HRTIMER_SYNCINPUTSOURCE_EXTERNAL                ((uint32_t)0x00000300U)                                          /*!< external signal: a positive pulse on the HRTIMER_SCIN pin triggers the Master_TIMER */

/* the synchronization output source */
#define HRTIMER_SYNCOUTPUTSOURCE_MTSTART                ((uint32_t)0x00000000U)                                          /*!< Master_TIMER start event to be sent to the synchronization output pad HRTIMER_SCOUT */
#define HRTIMER_SYNCOUTPUTSOURCE_MTCMP0                 ((uint32_t)0x00004000U)                                          /*!< Master_TIMER compare 0 event to be sent to the synchronization output pad HRTIMER_SCOUT*/
#define HRTIMER_SYNCOUTPUTSOURCE_ST0START               ((uint32_t)0x00008000U)                                          /*!< Slave_TIMER0 reset and start event to be sent to the synchronization output pad HRTIMER_SCOUT */
#define HRTIMER_SYNCOUTPUTSOURCE_ST0CMP0                ((uint32_t)0x0000C000U)                                          /*!< Slave_TIMER0 compare 0 event to be sent to the synchronization output pad HRTIMER_SCOUT */

/* the pulse on the synchronization output pad HRTIMER_SCOUT */
#define HRTIMER_SYNCOUTPUTPOLARITY_DISABLE              ((uint32_t)0x00000000U)                                          /*!< pulse generated disable. No pulse on HRTIMER_SCOUT */
#define HRTIMER_SYNCOUTPUTPOLARITY_POSITIVE             ((uint32_t)0x00002000U)                                          /*!< positive pulse generated on the HRTIMER_SCOUT. the length of it is 16 tHRTIMER_CK cycles */
#define HRTIMER_SYNCOUTPUTPOLARITY_NEGATIVE             ((uint32_t)0x00003000U)                                          /*!< negative pulse generated on the HRTIMER_SCOUT. the length of it is 16 tHRTIMER_CK cycles */

/* continuous mode in bunch mode */
#define HRTIMER_BUNCHMODE_SINGLE                        ((uint32_t)0x00000000U)                                          /*!< single pulse mode. the BM-counter stops by hardware when it reaches the HRTIMER_BMCAR value */
#define HRTIMER_BUNCHMODE_CONTINOUS                     (HRTIMER_BMCTL_BMCTN)                                            /*!< continuous mode. the BM-counter rolls over to zero and counts continuously when it reaches the HRTIMER_BMCAR value */

/* bunch mode clock source */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_MASTER            ((uint32_t)0x00000000U)                                          /*!< the clock source for the bunch mode counter: Master_TIMER counter reset/roll-over event */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_ST0               ((uint32_t)0x00000004U)                                          /*!< the clock source for the bunch mode counter: Slave_TIMER0 counter reset/roll-over event */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_ST1               ((uint32_t)0x00000008U)                                          /*!< the clock source for the bunch mode counter: Slave_TIMER1 counter reset/roll-over event */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_ST2               ((uint32_t)0x0000000CU)                                          /*!< the clock source for the bunch mode counter: Slave_TIMER2 counter reset/roll-over event */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_ST3               ((uint32_t)0x00000010U)                                          /*!< the clock source for the bunch mode counter: Slave_TIMER3 counter reset/roll-over event */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_ST4               ((uint32_t)0x00000014U)                                          /*!< the clock source for the bunch mode counter: Slave_TIMER4 counter reset/roll-over event */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_TIMER15_CH0_O     ((uint32_t)0x00000018U)                                          /*!< the clock source for the bunch mode counter: chip internal signal BMCLK0  */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_TIMER16_CH0_O     ((uint32_t)0x0000001CU)                                          /*!< the clock source for the bunch mode counter: chip internal signal BMCLK1 */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_TIMER6_TRGO       ((uint32_t)0x00000020U)                                          /*!< the clock source for the bunch mode counter: chip internal signal BMCLK2 */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_RESERVED          ((uint32_t)0x00000024U)                                          /*!< the clock source for the bunch mode counter: chip internal signal BMCLK3 */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_HRTIMERCK        ((uint32_t)0x00000028U)                                           /*!< the clock source for the bunch mode counter: prescaled fHRTIMER_CK clock */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_ST5               ((uint32_t)0x0000002CU)                                          /*!< the clock source for the bunch mode counter: Slave_TIMER5 counter reset/roll-over event */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_ST6               ((uint32_t)0x00000030U)                                          /*!< the clock source for the bunch mode counter: Slave_TIMER6 counter reset/roll-over event */
#define HRTIMER_BUNCHMODE_CLOCKSOURCE_ST7               ((uint32_t)0x00000034U)                                          /*!< the clock source for the bunch mode counter: Slave_TIMER7 counter reset/roll-over event */

/* bunch mode clock division */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV1                ((uint32_t)0x00000000U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV2                ((uint32_t)0x00000040U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/2 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV4                ((uint32_t)0x00000080U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/4 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV8                ((uint32_t)0x000000C0U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/8 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV16               ((uint32_t)0x00000100U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/16 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV32               ((uint32_t)0x00000140U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/32 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV64               ((uint32_t)0x00000180U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/64 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV128              ((uint32_t)0x000001C0U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/128 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV256              ((uint32_t)0x00000200U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/256 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV512              ((uint32_t)0x00000240U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/512 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV1024             ((uint32_t)0x00000280U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/1024 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV2048             ((uint32_t)0x000002C0U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/2048*/
#define HRTIMER_BUNCHMODE_PRESCALER_DIV4096             ((uint32_t)0x00000300U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/4096 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV8192             ((uint32_t)0x00000340U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/8192 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV16384            ((uint32_t)0x00000380U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/16384 */
#define HRTIMER_BUNCHMODE_PRESCALER_DIV32768            ((uint32_t)0x000003C0U)                                          /*!< fHRTIMER_BMCNTCK = fHRTIMER_CK/32768 */

/* bunch mode shadow enable */
#define HRTIMER_BUNCHMODEPRELOAD_DISABLED               ((uint32_t)0x00000000U)                                          /*!< the shadow registers for HRTIMER_BMCMPV and HRTIMER_BMCAR registers are disabled */
#define HRTIMER_BUNCHMODEPRELOAD_ENABLED                (HRTIMER_BMCTL_BMSE)                                             /*!< the shadow registers for HRTIMER_BMCMPV and HRTIMER_BMCAR registers are enabled */

