wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* the event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_NONE                  ((uint32_t)0x00000000U)                                          /*!< clear all triggers */
#define HRTIMER_BUNCHMODE_TRIGGER_MTRESET               (HRTIMER_BMSTRG_MTRST)                                           /*!< Master_TIMER reset event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_MTREPETITION          (HRTIMER_BMSTRG_MTREP)                                           /*!< Master_TIMER repetition event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_MTCMP0                (HRTIMER_BMSTRG_MTCMP0)                                          /*!< Master_TIMER compare 0 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_MTCMP1                (HRTIMER_BMSTRG_MTCMP1)                                          /*!< Master_TIMER compare 1 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_MTCMP2                (HRTIMER_BMSTRG_MTCMP2)                                          /*!< Master_TIMER compare 2 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_MTCMP3                (HRTIMER_BMSTRG_MTCMP3)                                          /*!< Master_TIMER compare 3 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST0RESET              (HRTIMER_BMSTRG_ST0RST)                                          /*!< Slave_TIMER0 reset event triggers bunch mode operation  */
#define HRTIMER_BUNCHMODE_TRIGGER_ST0REPETITION         (HRTIMER_BMSTRG_ST0REP)                                          /*!< Slave_TIMER0 repetition event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST0CMP0               (HRTIMER_BMSTRG_ST0CMP0)                                         /*!< Slave_TIMER0 compare 0 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST0CMP1               (HRTIMER_BMSTRG_ST0CMP1)                                         /*!< Slave_TIMER0 compare 1 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST1RESET              (HRTIMER_BMSTRG_ST1RST)                                          /*!< Slave_TIMER1 reset event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST1REPETITION         (HRTIMER_BMSTRG_ST1REP)                                          /*!< Slave_TIMER1 repetition event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST1CMP0               (HRTIMER_BMSTRG_ST1CMP0)                                         /*!< Slave_TIMER1 compare 0 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST1CMP1               (HRTIMER_BMSTRG_ST1CMP1)                                         /*!< Slave_TIMER1 compare 1 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST2RESET              (HRTIMER_BMSTRG_ST2RST)                                          /*!< Slave_TIMER2 reset event triggers bunch mode operation  */
#define HRTIMER_BUNCHMODE_TRIGGER_ST2REPETITION         (HRTIMER_BMSTRG_ST2REP)                                          /*!< Slave_TIMER2 repetition event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST2CMP0               (HRTIMER_BMSTRG_ST2CMP0)                                         /*!< Slave_TIMER2 compare 0 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST2CMP1               (HRTIMER_BMSTRG_ST2CMP1)                                         /*!< Slave_TIMER2 compare 1 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST3RESET              (HRTIMER_BMSTRG_ST3RST)                                          /*!< Slave_TIMER3 reset event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST3REPETITION         (HRTIMER_BMSTRG_ST3REP)                                          /*!< Slave_TIMER3 repetition event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST3CMP0               (HRTIMER_BMSTRG_ST3CMP0)                                         /*!< Slave_TIMER3 compare 0 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST3CMP1               (HRTIMER_BMSTRG_ST3CMP1)                                         /*!< Slave_TIMER3 compare 1 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST4RESET              (HRTIMER_BMSTRG_ST4RST)                                          /*!< Slave_TIMER4 reset event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST4REPETITION         (HRTIMER_BMSTRG_ST4REP)                                          /*!< Slave_TIMER4 repetition event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST4CMP0               (HRTIMER_BMSTRG_ST4CMP0)                                         /*!< Slave_TIMER4 compare 0 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST4CMP1               (HRTIMER_BMSTRG_ST4CMP1)                                         /*!< Slave_TIMER4 compare 1 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST0EVENT6             (HRTIMER_BMSTRG_ST0EXEV6)                                        /*!< Slave_TIMER0 period event following external event 6 triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST3EVENT7             (HRTIMER_BMSTRG_ST3EXEV7)                                        /*!< Slave_TIMER3 period event following external event 7 triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_EVENT6                (HRTIMER_BMSTRG_EXEV6)                                           /*!< external event 6 triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_EVENT7                (HRTIMER_BMSTRG_EXEV7)                                           /*!< external event 7 triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_CHIP                  (HRTIMER_BMSTRG_CISGN)                                           /*!< chip internal signal triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST5RESET              (HRTIMER_BMSTRGA_ST5RST)                                         /*!< Slave_TIMER5 reset event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST5REPETITION         (HRTIMER_BMSTRGA_ST5REP)                                         /*!< Slave_TIMER5 repetition event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST5CMP0               (HRTIMER_BMSTRGA_ST5CMP0)                                        /*!< Slave_TIMER5 compare 0 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST5CMP1               (HRTIMER_BMSTRGA_ST5CMP1)                                        /*!< Slave_TIMER5 compare 1 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST6RESET              (HRTIMER_BMSTRGA_ST6RST)                                         /*!< Slave_TIMER6 reset event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST6REPETITION         (HRTIMER_BMSTRGA_ST6REP)                                         /*!< Slave_TIMER6 repetition event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST6CMP0               (HRTIMER_BMSTRGA_ST6CMP0)                                        /*!< Slave_TIMER6 compare 0 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST6CMP1               (HRTIMER_BMSTRGA_ST6CMP1)                                        /*!< Slave_TIMER6 compare 1 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST7RESET              (HRTIMER_BMSTRGA_ST7RST)                                         /*!< Slave_TIMER7 reset event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST7REPETITION         (HRTIMER_BMSTRGA_ST7REP)                                         /*!< Slave_TIMER7 repetition event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST7CMP0               (HRTIMER_BMSTRGA_ST7CMP0)                                        /*!< Slave_TIMER7 compare 0 event triggers bunch mode operation */
#define HRTIMER_BUNCHMODE_TRIGGER_ST7CMP1               (HRTIMER_BMSTRGA_ST7CMP1)                                        /*!< Slave_TIMER7 compare 1 event triggers bunch mode operation */

/* external event source */
#define HRTIMER_EXEV_SRC0                               ((uint32_t)0x00000000U)                                          /*!< external event y source is EXEVySRC 0 */
#define HRTIMER_EXEV_SRC1                               ((uint32_t)0x00000001U)                                          /*!< external event y source is EXEVySRC 1 */
#define HRTIMER_EXEV_SRC2                               ((uint32_t)0x00000002U)                                          /*!< external event y source is EXEVySRC 2 */
#define HRTIMER_EXEV_SRC3                               ((uint32_t)0x00000003U)                                          /*!< external event y source is EXEVySRC 3 */

