wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* external event polarity */
#define HRTIMER_EXEV_POLARITY_HIGH                      ((uint32_t)0x00000000U)                                          /*!< external event y active at high level */
#define HRTIMER_EXEV_POLARITY_LOW                       (HRTIMER_EXEVCFG0_EXEV0P)                                       /*!< external event y active at low level */

/* external event edge sensitivity */
#define HRTIMER_EXEV_EDGE_LEVEL                         ((uint32_t)0x00000000U)                                          /*!< level active. active level is defined by EXEVyP bit */
#define HRTIMER_EXEV_EDGE_RISING                        ((uint32_t)0x00000008U)                                          /*!< rising edge active */
#define HRTIMER_EXEV_EDGE_FALLING                       ((uint32_t)0x00000010U)                                          /*!< falling edge active */
#define HRTIMER_EXEV_EDGE_BOTH                          ((uint32_t)0x00000018U)                                          /*!< both edges active */

/* external event fast mode */
#define HRTIMER_EXEV_FAST_DISABLE                      ((uint32_t)0x00000000U)                                           /*!< external event fast mode disable */
#define HRTIMER_EXEV_FAST_ENABLE                       (HRTIMER_EXEVCFG0_EXEV0FAST)                                      /*!< external event fast mode enable */

/* external event digital filter clock division */
#define HRTIMER_EXEV_PRESCALER_DIV1                     ((uint32_t)0x00000000U)                                          /*!< fHRTIMER_EXEVFCK = fHRTIMER_CK */
#define HRTIMER_EXEV_PRESCALER_DIV2                     ((uint32_t)0x40000000U)                                          /*!< fHRTIMER_EXEVFCK = fHRTIMER_CK / 2 */
#define HRTIMER_EXEV_PRESCALER_DIV4                     ((uint32_t)0x80000000U)                                          /*!< fHRTIMER_EXEVFCK = fHRTIMER_CK / 4 */
#define HRTIMER_EXEV_PRESCALER_DIV8                     ((uint32_t)0xC0000000U)                                          /*!< fHRTIMER_EXEVFCK = fHRTIMER_CK / 8 */

/* external event X reset mode */
#define HRTIMER_EXEVX_RESET_MODE0                       ((uint32_t)0x00000000U)                                          /*!< the external event counter X is reset on every reset/roll-over event */
#define HRTIMER_EXEVX_RESET_MODE1                       (HRTIMER_STXEXEVFCFG2_EXTEXRSTM)                                /*!< the external event counter X is reset on every reset/roll-over event only if no event occurs during the last counting period */

/* external event X selection */
#define HRTIMER_EXEVX_SOURCE_EXEV0                      ((uint32_t)0x00000000U)                                          /*!< external event 0 serves as the source for external event X */
#define HRTIMER_EXEVX_SOURCE_EXEV1                      ((uint32_t)0x00000010U)                                          /*!< external event 1 serves as the source for external event X */
#define HRTIMER_EXEVX_SOURCE_EXEV2                      ((uint32_t)0x00000020U)                                          /*!< external event 2 serves as the source for external event X */
#define HRTIMER_EXEVX_SOURCE_EXEV3                      ((uint32_t)0x00000030U)                                          /*!< external event 3 serves as the source for external event X */
#define HRTIMER_EXEVX_SOURCE_EXEV4                      ((uint32_t)0x00000040U)                                          /*!< external event 4 serves as the source for external event X */
#define HRTIMER_EXEVX_SOURCE_EXEV5                      ((uint32_t)0x00000050U)                                          /*!< external event 5 serves as the source for external event X */
#define HRTIMER_EXEVX_SOURCE_EXEV6                      ((uint32_t)0x00000060U)                                          /*!< external event 6 serves as the source for external event X */
#define HRTIMER_EXEVX_SOURCE_EXEV7                      ((uint32_t)0x00000070U)                                          /*!< external event 7 serves as the source for external event X */
#define HRTIMER_EXEVX_SOURCE_EXEV8                      ((uint32_t)0x00000080U)                                          /*!< external event 8 serves as the source for external event X */
#define HRTIMER_EXEVX_SOURCE_EXEV9                      ((uint32_t)0x00000090U)                                          /*!< external event 9 serves as the source for external event X */

/* immediately update compare 0 value PWM mode */
#define HRTIMER_IMMEDIATELY_UPDATE_CMP0_DISABLE         ((uint32_t)0x00000000U)                                          /*!< immediately update compare 0 value PWM mode disable */
#define HRTIMER_IMMEDIATELY_UPDATE_CMP0_ENABLE          (HRTIMER_STXCTL1_IMUPD0V)                                        /*!< immediately update compare 0 value PWM mode enable */

/* immediately update compare 2 value PWM mode */
#define HRTIMER_IMMEDIATELY_UPDATE_CMP2_DISABLE         ((uint32_t)0x00000000U)                                          /*!< immediately update compare 2 value PWM mode disable */
#define HRTIMER_IMMEDIATELY_UPDATE_CMP2_ENABLE          (HRTIMER_STXCTL1_IMUPD2V)                                        /*!< immediately update compare 2 value PWM mode enable */

/* triggered half mode */
#define HRTIMER_TRGHALFM_DISABLE                        ((uint32_t)0x00000000U)                                          /*!< triggered half mode disable */
#define HRTIMER_TRGHALFM_ENABLE                         ((uint32_t)HRTIMER_STXCTL1_TRGHALFM)                             /*!< triggered half mode enable */

/* fault input source */
#define HRTIMER_FAULT_SOURCE_PIN                        ((uint32_t)0x00000000U)                                          /*!< the source of fault input is chip external pin */
#define HRTIMER_FAULT_SOURCE_INTERNAL                   ((uint32_t)0x00000001U)                                          /*!< the source of fault input is chip internal signal(for example comparator) */
#define HRTIMER_FAULT_SOURCE_EXT_EVENT                  ((uint32_t)0x00000002U)                                          /*!< the source of fault input is external event */

/* fault input polarity */
#define HRTIMER_FAULT_POLARITY_LOW                      ((uint32_t)0x00000000U)                                          /*!< fault input active at low level */
#define HRTIMER_FAULT_POLARITY_HIGH                     (HRTIMER_FLTINCFG0_FLT0INP)                                      /*!< fault input active at high  level */

/* enable or disable fault */
#define HRTIMER_FAULT_CHANNEL_DISABLE                   ((uint32_t)0x00000000U)                                          /*!< fault channel disable */
#define HRTIMER_FAULT_CHANNEL_ENABLE                    (HRTIMER_FLTINCFG0_FLT0INEN)                                     /*!< fault channel enable */

/* protect fault input configuration */
#define HRTIMER_FAULT_PROTECT_DISABLE                   ((uint32_t)0x00000000U)                                          /*!< protect disable. FLT0INEN, FLT0INP, FLT0INSRC and FLT0INFC[3:0] is writable */
#define HRTIMER_FAULT_PROTECT_ENABLE                    (HRTIMER_FLTINCFG0_FLT0INPROT)                                   /*!< protect enable. FLT0INEN, FLT0INP, FLT0INSRC and FLT0INFC[3:0] is read-only */

/* fault input digital filter clock division */
#define HRTIMER_FAULT_PRESCALER_DIV1                    ((uint32_t)0x00000000U)                                          /*!< fHRTIMER_FLTFCK = fHRTIMER_CK */
#define HRTIMER_FAULT_PRESCALER_DIV2                    ((uint32_t)0x01000000U)                                          /*!< fHRTIMER_FLTFCK = fHRTIMER_CK/2 */
#define HRTIMER_FAULT_PRESCALER_DIV4                    ((uint32_t)0x02000000U)                                          /*!< fHRTIMER_FLTFCK = fHRTIMER_CK/4 */
#define HRTIMER_FAULT_PRESCALER_DIV8                    ((uint32_t)0x03000000U)                                          /*!< fHRTIMER_FLTFCK = fHRTIMER_CK/8 */

/* fault blanking source */
#define HRTIMER_FAULT_BLKEN_DISABLE                     ((uint32_t)0x00000000U)                                          /*!< fault blank disable */
#define HRTIMER_FAULT_BLKEN_ENABLE                      (HRTIMER_FLTINCFG2_FLT0BLKEN)                                    /*!< fault blank enable */

/* fault blanking source */
#define HRTIMER_FAULT_RST_COMP                          ((uint32_t)0x00000000U)                                          /*!< fault reset and compare windows */
#define HRTIMER_FAULT_COMP_COMP                         (HRTIMER_FLTINCFG2_FLT0BLKS)                                     /*!< fault compare and compare windows */

/* fault reset mode */
#define HRTIMER_FAULT_COUNTER_RESET_UNCONDITIONAL       ((uint32_t)0x00000000U)                                          /*!< reset the fault counter on each reset/roll-over event */
#define HRTIMER_FAULT_COUNTER_RESET_CONDITIONAL         (HRTIMER_FLTINCFG2_FLT0RST)                                      /*!< reset the fault counter on each reset/roll-over event only if no fault event is active or no fault event happens in one period */

