wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER_ADCTRIG update source */
#define HRTIMER_ADCTRGI_UPDATE_MT                       ((uint32_t)0x00000000U)                                          /*!< Master_TIMER update event */
#define HRTIMER_ADCTRGI_UPDATE_ST0                      ((uint32_t)0x00000001U)                                          /*!< Slaver_TIMER0 update event */
#define HRTIMER_ADCTRGI_UPDATE_ST1                      ((uint32_t)0x00000002U)                                          /*!< Slaver_TIMER1 update event */
#define HRTIMER_ADCTRGI_UPDATE_ST2                      ((uint32_t)0x00000003U)                                          /*!< Slaver_TIMER2 update event */
#define HRTIMER_ADCTRGI_UPDATE_ST3                      ((uint32_t)0x00000004U)                                          /*!< Slaver_TIMER3 update event */
#define HRTIMER_ADCTRGI_UPDATE_ST4                      ((uint32_t)0x00000005U)                                          /*!< Slaver_TIMER4 update event */
#define HRTIMER_ADCTRGI_UPDATE_ST5                      ((uint32_t)0x00000006U)                                          /*!< Slaver_TIMER5 update event */
#define HRTIMER_ADCTRGI_UPDATE_ST6                      ((uint32_t)0x00000007U)                                          /*!< Slaver_TIMER6 update event */
#define HRTIMER_ADCTRGI_UPDATE_ST7                      ((uint32_t)0x00000008U)                                          /*!< Slaver_TIMER7 update event */

/*  ADC trigger event */
/* ADC trigger 0,2 */
#define HRTIMER_ADCTRGI02_EVENT_NONE                    ((uint32_t)0x00000000U)                                          /*!< no ADC trigger event */
#define HRTIMER_ADCTRGI02_EVENT_MTCMP0                  (HRTIMER_ADCTRIGS0_TRG0MTC0)                                    /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Master_TIMER compare 0 */
#define HRTIMER_ADCTRGI02_EVENT_MTCMP1                  (HRTIMER_ADCTRIGS0_TRG0MTC1)                                    /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Master_TIMER compare 1 */ 
#define HRTIMER_ADCTRGI02_EVENT_MTCMP2                  (HRTIMER_ADCTRIGS0_TRG0MTC2)                                    /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Master_TIMER compare 2 */
#define HRTIMER_ADCTRGI02_EVENT_MTCMP3                  (HRTIMER_ADCTRIGS0_TRG0MTC3)                                    /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Master_TIMER compare 3 */
#define HRTIMER_ADCTRGI02_EVENT_MTPER                   (HRTIMER_ADCTRIGS0_TRG0MTPER)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Master_TIMER period */
#define HRTIMER_ADCTRGI02_EVENT_EXEV0                   (HRTIMER_ADCTRIGS0_TRG0EXEV0)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on external event 0 */
#define HRTIMER_ADCTRGI02_EVENT_EXEV1                   (HRTIMER_ADCTRIGS0_TRG0EXEV1)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on external event 1 */
#define HRTIMER_ADCTRGI02_EVENT_EXEV2                   (HRTIMER_ADCTRIGS0_TRG0EXEV2)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on external event 2 */
#define HRTIMER_ADCTRGI02_EVENT_EXEV3                   (HRTIMER_ADCTRIGS0_TRG0EXEV3)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on external event 3 */ 
#define HRTIMER_ADCTRGI02_EVENT_EXEV4                   (HRTIMER_ADCTRIGS0_TRG0EXEV4)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on external event 4 */
#define HRTIMER_ADCTRGI02_EVENT_ST0CMP1                 (HRTIMER_ADCTRIGS0_TRG0ST0C1)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER0 compare 1 */
#define HRTIMER_ADCTRGI02_EVENT_ST0CMP2                 (HRTIMER_ADCTRIGS0_TRG0ST0C2)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER0 compare 2 */
#define HRTIMER_ADCTRGI02_EVENT_ST0CMP3                 (HRTIMER_ADCTRIGS0_TRG0ST0C3)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER0 compare 3 */
#define HRTIMER_ADCTRGI02_EVENT_ST0PER                  (HRTIMER_ADCTRIGS0_TRG0ST0PER)                                  /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER0 period */
#define HRTIMER_ADCTRGI02_EVENT_ST0RST                  (HRTIMER_ADCTRIGS0_TRG0ST0RST)                                  /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER0 reset and counter roll-over event */
#define HRTIMER_ADCTRGI02_EVENT_ST1CMP1                 (HRTIMER_ADCTRIGS0_TRG0ST1C1)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER1 compare 1 */
#define HRTIMER_ADCTRGI02_EVENT_ST1CMP2                 (HRTIMER_ADCTRIGS0_TRG0ST1C2)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER1 compare 2 */
#define HRTIMER_ADCTRGI02_EVENT_ST1CMP3                 (HRTIMER_ADCTRIGS0_TRG0ST1C3)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER1 compare 3 */
#define HRTIMER_ADCTRGI02_EVENT_ST1PER                  (HRTIMER_ADCTRIGS0_TRG0ST1PER)                                  /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER1 period */
#define HRTIMER_ADCTRGI02_EVENT_ST1RST                  (HRTIMER_ADCTRIGS0_TRG0ST1RST)                                  /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER1 reset and counter roll-over event */
#define HRTIMER_ADCTRGI02_EVENT_ST2CMP1                 (HRTIMER_ADCTRIGS0_TRG0ST2C1)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER2 compare 1 */
#define HRTIMER_ADCTRGI02_EVENT_ST2CMP2                 (HRTIMER_ADCTRIGS0_TRG0ST2C2)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER2 compare 2 */
#define HRTIMER_ADCTRGI02_EVENT_ST2CMP3                 (HRTIMER_ADCTRIGS0_TRG0ST2C3)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER2 compare 3 */
#define HRTIMER_ADCTRGI02_EVENT_ST2PER                  (HRTIMER_ADCTRIGS0_TRG0ST2PER)                                  /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER2 period */
#define HRTIMER_ADCTRGI02_EVENT_ST3CMP1                 (HRTIMER_ADCTRIGS0_TRG0ST3C1)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER3 compare 1 */
#define HRTIMER_ADCTRGI02_EVENT_ST3CMP2                 (HRTIMER_ADCTRIGS0_TRG0ST3C2)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER3 compare 2 */
#define HRTIMER_ADCTRGI02_EVENT_ST3CMP3                 (HRTIMER_ADCTRIGS0_TRG0ST3C3)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER3 compare 3 */
#define HRTIMER_ADCTRGI02_EVENT_ST3PER                  (HRTIMER_ADCTRIGS0_TRG0ST3PER)                                  /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER3 period */
#define HRTIMER_ADCTRGI02_EVENT_ST4CMP1                 (HRTIMER_ADCTRIGS0_TRG0ST4C1)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER4 compare 1 */
#define HRTIMER_ADCTRGI02_EVENT_ST4CMP2                 (HRTIMER_ADCTRIGS0_TRG0ST4C2)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER4 compare 2 */
#define HRTIMER_ADCTRGI02_EVENT_ST4CMP3                 (HRTIMER_ADCTRIGS0_TRG0ST4C3)                                   /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER4 compare 3 */
#define HRTIMER_ADCTRGI02_EVENT_ST4PER                  (HRTIMER_ADCTRIGS0_TRG0ST4PER)                                  /*!< HRTIMER_ADCTRIG0 or HRTIMER_ADCTRIG2 on Slave_TIMER4 period */
#define HRTIMER_ADCTRGI02_EVENT_ST5CMP1                 (HRTIMER_ADCTRIGS0A_TRG0ST5C1)                                  /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER5 compare 1 */
#define HRTIMER_ADCTRGI02_EVENT_ST5CMP2                 (HRTIMER_ADCTRIGS0A_TRG0ST5C2)                                  /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER5 compare 2 */
#define HRTIMER_ADCTRGI02_EVENT_ST5CMP3                 (HRTIMER_ADCTRIGS0A_TRG0ST5C3)                                  /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER5 compare 3 */
#define HRTIMER_ADCTRGI02_EVENT_ST5PER                  (HRTIMER_ADCTRIGS0A_TRG0ST5PER)                                 /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER5 period */
#define HRTIMER_ADCTRGI02_EVENT_ST5RST                  (HRTIMER_ADCTRIGS0A_TRG0ST5RST)                                 /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER5 reset and counter roll-over event */
#define HRTIMER_ADCTRGI02_EVENT_ST6CMP1                 (HRTIMER_ADCTRIGS0A_TRG0ST6C1)                                  /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER6 compare 1 */
#define HRTIMER_ADCTRGI02_EVENT_ST6CMP2                 (HRTIMER_ADCTRIGS0A_TRG0ST6C2)                                  /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER6 compare 2 */
#define HRTIMER_ADCTRGI02_EVENT_ST6CMP3                 (HRTIMER_ADCTRIGS0A_TRG0ST6C3)                                  /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER6 compare 3 */
#define HRTIMER_ADCTRGI02_EVENT_ST6PER                  (HRTIMER_ADCTRIGS0A_TRG0ST6PER)                                 /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER6 period */
#define HRTIMER_ADCTRGI02_EVENT_ST6RST                  (HRTIMER_ADCTRIGS0A_TRG0ST6RST)                                 /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER6 reset and counter roll-over event */
#define HRTIMER_ADCTRGI02_EVENT_ST7CMP1                 (HRTIMER_ADCTRIGS0A_TRG0ST7C1)                                  /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER7 compare 1 */
#define HRTIMER_ADCTRGI02_EVENT_ST7CMP2                 (HRTIMER_ADCTRIGS0A_TRG0ST7C2)                                  /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER7 compare 2 */
#define HRTIMER_ADCTRGI02_EVENT_ST7CMP3                 (HRTIMER_ADCTRIGS0A_TRG0ST7C3)                                  /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER7 compare 3 */
#define HRTIMER_ADCTRGI02_EVENT_ST7PER                  (HRTIMER_ADCTRIGS0A_TRG0ST7PER)                                 /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER7 period */
#define HRTIMER_ADCTRGI02_EVENT_ST7RST                  (HRTIMER_ADCTRIGS0A_TRG0ST7RST)                                 /*!< HRTIMER_ADCTRIG0A or HRTIMER_ADCTRIG2A on Slave_TIMER7 reset and counter roll-over event */

/* ADC trigger 1,3 */
#define HRTIMER_ADCTRGI13_EVENT_NONE                    ((uint32_t)0x00000000U)                                          /*!< no ADC trigger event */
#define HRTIMER_ADCTRGI13_EVENT_MTCMP0                  (HRTIMER_ADCTRIGS1_TRG1MTC0)                                    /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Master_TIMER compare 0 */
#define HRTIMER_ADCTRGI13_EVENT_MTCMP1                  (HRTIMER_ADCTRIGS1_TRG1MTC1)                                    /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Master_TIMER compare 1 */ 
#define HRTIMER_ADCTRGI13_EVENT_MTCMP2                  (HRTIMER_ADCTRIGS1_TRG1MTC2)                                    /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Master_TIMER compare 2 */
#define HRTIMER_ADCTRGI13_EVENT_MTCMP3                  (HRTIMER_ADCTRIGS1_TRG1MTC3)                                    /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Master_TIMER compare 3 */
#define HRTIMER_ADCTRGI13_EVENT_MTPER                   (HRTIMER_ADCTRIGS1_TRG1MTPER)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Master_TIMER period */
#define HRTIMER_ADCTRGI13_EVENT_EXEV5                   (HRTIMER_ADCTRIGS1_TRG1EXEV5)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on external event 5 */
#define HRTIMER_ADCTRGI13_EVENT_EXEV6                   (HRTIMER_ADCTRIGS1_TRG1EXEV6)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on external event 6 */
#define HRTIMER_ADCTRGI13_EVENT_EXEV7                   (HRTIMER_ADCTRIGS1_TRG1EXEV7)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on external event 7 */
#define HRTIMER_ADCTRGI13_EVENT_EXEV8                   (HRTIMER_ADCTRIGS1_TRG1EXEV8)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on external event 8 */ 
#define HRTIMER_ADCTRGI13_EVENT_EXEV9                   (HRTIMER_ADCTRIGS1_TRG1EXEV9)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on external event 9 */
#define HRTIMER_ADCTRGI13_EVENT_ST0CMP1                 (HRTIMER_ADCTRIGS1_TRG1ST0C1)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER0 compare 1 */
#define HRTIMER_ADCTRGI13_EVENT_ST0CMP2                 (HRTIMER_ADCTRIGS1_TRG1ST0C2)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER0 compare 2 */
#define HRTIMER_ADCTRGI13_EVENT_ST0CMP3                 (HRTIMER_ADCTRIGS1_TRG1ST0C3)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER0 compare 3 */
#define HRTIMER_ADCTRGI13_EVENT_ST0PER                  (HRTIMER_ADCTRIGS1_TRG1ST0PER)                                  /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER0 period */
#define HRTIMER_ADCTRGI13_EVENT_ST1CMP1                 (HRTIMER_ADCTRIGS1_TRG1ST1C1)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER1 compare 1 */
#define HRTIMER_ADCTRGI13_EVENT_ST1CMP2                 (HRTIMER_ADCTRIGS1_TRG1ST1C2)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER1 compare 2 */
#define HRTIMER_ADCTRGI13_EVENT_ST1CMP3                 (HRTIMER_ADCTRIGS1_TRG1ST1C3)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER1 compare 3 */
#define HRTIMER_ADCTRGI13_EVENT_ST1PER                  (HRTIMER_ADCTRIGS1_TRG1ST1PER)                                  /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER1 period */
#define HRTIMER_ADCTRGI13_EVENT_ST2CMP1                 (HRTIMER_ADCTRIGS1_TRG1ST2C1)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER2 compare 1 */
#define HRTIMER_ADCTRGI13_EVENT_ST2CMP2                 (HRTIMER_ADCTRIGS1_TRG1ST2C2)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER2 compare 2 */
#define HRTIMER_ADCTRGI13_EVENT_ST2CMP3                 (HRTIMER_ADCTRIGS1_TRG1ST2C3)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER2 compare 3 */
#define HRTIMER_ADCTRGI13_EVENT_ST2PER                  (HRTIMER_ADCTRIGS1_TRG1ST2PER)                                  /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER2 period */
#define HRTIMER_ADCTRGI13_EVENT_ST2RST                  (HRTIMER_ADCTRIGS1_TRG1ST2RST)                                  /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER2 reset and counter roll-over event */
#define HRTIMER_ADCTRGI13_EVENT_ST3CMP1                 (HRTIMER_ADCTRIGS1_TRG1ST3C1)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER3 compare 1 */
#define HRTIMER_ADCTRGI13_EVENT_ST3CMP2                 (HRTIMER_ADCTRIGS1_TRG1ST3C2)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER3 compare 2 */
#define HRTIMER_ADCTRGI13_EVENT_ST3CMP3                 (HRTIMER_ADCTRIGS1_TRG1ST3C3)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER3 compare 3 */
#define HRTIMER_ADCTRGI13_EVENT_ST3PER                  (HRTIMER_ADCTRIGS1_TRG1ST3PER)                                  /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER3 period */
#define HRTIMER_ADCTRGI13_EVENT_ST3RST                  (HRTIMER_ADCTRIGS1_TRG1ST3RST)                                  /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER3 reset and counter roll-over event */
#define HRTIMER_ADCTRGI13_EVENT_ST4CMP1                 (HRTIMER_ADCTRIGS1_TRG1ST4C1)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER4 compare 1 */
#define HRTIMER_ADCTRGI13_EVENT_ST4CMP2                 (HRTIMER_ADCTRIGS1_TRG1ST4C2)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER4 compare 2 */
#define HRTIMER_ADCTRGI13_EVENT_ST4CMP3                 (HRTIMER_ADCTRIGS1_TRG1ST4C3)                                   /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER4 compare 3 */
#define HRTIMER_ADCTRGI13_EVENT_ST4RST                  (HRTIMER_ADCTRIGS1_TRG1ST4RST)                                  /*!< HRTIMER_ADCTRIG1 or HRTIMER_ADCTRIG3 on Slave_TIMER4 reset and counter roll-over event */
#define HRTIMER_ADCTRGI13_EVENT_ST5CMP1                 (HRTIMER_ADCTRIGS1A_TRG1ST5C1)                                  /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER5 compare 1 */
#define HRTIMER_ADCTRGI13_EVENT_ST5CMP2                 (HRTIMER_ADCTRIGS1A_TRG1ST5C2)                                  /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER5 compare 2 */
#define HRTIMER_ADCTRGI13_EVENT_ST5CMP3                 (HRTIMER_ADCTRIGS1A_TRG1ST5C3)                                  /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER5 compare 3 */
#define HRTIMER_ADCTRGI13_EVENT_ST5PER                  (HRTIMER_ADCTRIGS1A_TRG1ST5PER)                                 /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER5 period */
#define HRTIMER_ADCTRGI13_EVENT_ST5RST                  (HRTIMER_ADCTRIGS1A_TRG1ST5RST)                                 /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER5 reset and counter roll-over event */
#define HRTIMER_ADCTRGI13_EVENT_ST6CMP1                 (HRTIMER_ADCTRIGS1A_TRG1ST6C1)                                  /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER6 compare 1 */
#define HRTIMER_ADCTRGI13_EVENT_ST6CMP2                 (HRTIMER_ADCTRIGS1A_TRG1ST6C2)                                  /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER6 compare 2 */
#define HRTIMER_ADCTRGI13_EVENT_ST6CMP3                 (HRTIMER_ADCTRIGS1A_TRG1ST6C3)                                  /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER6 compare 3 */
#define HRTIMER_ADCTRGI13_EVENT_ST6PER                  (HRTIMER_ADCTRIGS1A_TRG1ST6PER)                                 /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER6 period */
#define HRTIMER_ADCTRGI13_EVENT_ST6RST                  (HRTIMER_ADCTRIGS1A_TRG1ST6RST)                                 /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER6 reset and counter roll-over event */
#define HRTIMER_ADCTRGI13_EVENT_ST7CMP1                 (HRTIMER_ADCTRIGS1A_TRG1ST7C1)                                  /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER7 compare 1 */
#define HRTIMER_ADCTRGI13_EVENT_ST7CMP2                 (HRTIMER_ADCTRIGS1A_TRG1ST7C2)                                  /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER7 compare 2 */
#define HRTIMER_ADCTRGI13_EVENT_ST7CMP3                 (HRTIMER_ADCTRIGS1A_TRG1ST7C3)                                  /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER7 compare 3 */
#define HRTIMER_ADCTRGI13_EVENT_ST7PER                  (HRTIMER_ADCTRIGS1A_TRG1ST7PER)                                 /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER7 period */
#define HRTIMER_ADCTRGI13_EVENT_ST7RST                  (HRTIMER_ADCTRIGS1A_TRG1ST7RST)                                 /*!< HRTIMER_ADCTRIG1A or HRTIMER_ADCTRIG3A on Slave_TIMER7 reset and counter roll-over event */

