wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* ADC trigger event */
/* ADC trigger 4,6,8 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_MASTER_CMP0         ((uint32_t)0x00000000U)                                         /*!< 000000: ADC triggered by compare 0 event of Master_TIMER */
#define HRTIMER_ADC_EXT_TRIG_468_BY_MASTER_CMP1         ((uint32_t)0x00000001U)                                         /*!< 000001: ADC triggered by compare 1 event of Master_TIMER */
#define HRTIMER_ADC_EXT_TRIG_468_BY_MASTER_CMP2         ((uint32_t)0x00000002U)                                         /*!< 000010: ADC triggered by compare 2 event of Master_TIMER */
#define HRTIMER_ADC_EXT_TRIG_468_BY_MASTER_CMP3         ((uint32_t)0x00000003U)                                         /*!< 000011: ADC triggered by compare 3 event of Master_TIMER */
#define HRTIMER_ADC_EXT_TRIG_468_BY_MASTER_PERIOD       ((uint32_t)0x00000004U)                                         /*!< 000100: ADC triggered by period event of Master_TIMER */
#define HRTIMER_ADC_EXT_TRIG_468_BY_EXEV_0              ((uint32_t)0x00000005U)                                         /*!< 000101: ADC triggered by external event 0 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_EXEV_1              ((uint32_t)0x00000006U)                                         /*!< 000110: ADC triggered by external event 1 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_EXEV_2              ((uint32_t)0x00000007U)                                         /*!< 000111: ADC triggered by external event 2 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_EXEV_3              ((uint32_t)0x00000008U)                                         /*!< 001000: ADC triggered by external event 3 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_EXEV_4              ((uint32_t)0x00000009U)                                         /*!< 001001: ADC triggered by external event 4 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST0_CMP2            ((uint32_t)0x0000000AU)                                         /*!< 001010: ADC triggered by compare 2 event of Slave_TIMER0 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST0_CMP3            ((uint32_t)0x0000000BU)                                         /*!< 001011: ADC triggered by compare 3 event of Slave_TIMER0 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST0_PERIOD          ((uint32_t)0x0000000CU)                                         /*!< 001100: ADC triggered by period event of Slave_TIMER0 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST0_RESET           ((uint32_t)0x0000000DU)                                         /*!< 001101: ADC triggered by reset and counter roll-over event of Slave_TIMER0 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST1_CMP2            ((uint32_t)0x0000000EU)                                         /*!< 001110: ADC triggered by compare 2 event of Slave_TIMER1 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST1_CMP3            ((uint32_t)0x0000000FU)                                         /*!< 001111: ADC triggered by compare 3 event of Slave_TIMER1 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST1_PERIOD          ((uint32_t)0x00000010U)                                         /*!< 010000: ADC triggered by period event of Slave_TIMER1 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST1_RESET           ((uint32_t)0x00000011U)                                         /*!< 010001: ADC triggered by reset and counter roll-over event of Slave_TIMER1 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST2_CMP2            ((uint32_t)0x00000012U)                                         /*!< 010010: ADC triggered by compare 2 event of Slave_TIMER2 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST2_CMP3            ((uint32_t)0x00000013U)                                         /*!< 010011: ADC triggered by compare 3 event of Slave_TIMER2 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST2_PERIOD          ((uint32_t)0x00000014U)                                         /*!< 010100: ADC triggered by period event of Slave_TIMER2 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST3_CMP2            ((uint32_t)0x00000015U)                                         /*!< 010101: ADC triggered by compare 2 event of Slave_TIMER3 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST3_CMP3            ((uint32_t)0x00000016U)                                         /*!< 010110: ADC triggered by compare 3 event of Slave_TIMER3 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST3_PERIOD          ((uint32_t)0x00000017U)                                         /*!< 010111: ADC triggered by period event of Slave_TIMER3 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST4_CMP2            ((uint32_t)0x00000018U)                                         /*!< 011000: ADC triggered by compare 2 event of Slave_TIMER4 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST4_CMP3            ((uint32_t)0x00000019U)                                         /*!< 011001: ADC triggered by compare 3 event of Slave_TIMER4 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST4_PERIOD          ((uint32_t)0x0000001AU)                                         /*!< 011010: ADC triggered by period event of Slave_TIMER4 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST5_CMP1            ((uint32_t)0x0000001BU)                                         /*!< 011011: ADC triggered by compare 1 event of Slave_TIMER5 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST5_CMP2            ((uint32_t)0x0000001CU)                                         /*!< 011100: ADC triggered by compare 2 event of Slave_TIMER5 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST5_CMP3            ((uint32_t)0x0000001DU)                                         /*!< 011101: ADC triggered by compare 3 event of Slave_TIMER5 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST5_PERIOD          ((uint32_t)0x0000001EU)                                         /*!< 011110: ADC triggered by period event of Slave_TIMER5 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST5_RESET           ((uint32_t)0x0000001FU)                                         /*!< 011111: ADC triggered by reset and counter roll-over event of Slave_TIMER5 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST6_CMP1            ((uint32_t)0x00000020U)                                         /*!< 100000: ADC triggered by compare 1 event of Slave_TIMER6 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST6_CMP2            ((uint32_t)0x00000021U)                                         /*!< 100001: ADC triggered by compare 2 event of Slave_TIMER6 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST6_CMP3            ((uint32_t)0x00000022U)                                         /*!< 100010: ADC triggered by compare 3 event of Slave_TIMER6 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST6_PERIOD          ((uint32_t)0x00000023U)                                         /*!< 100011: ADC triggered by period event of Slave_TIMER6 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST6_RESET           ((uint32_t)0x00000024U)                                         /*!< 100100: ADC triggered by reset and counter roll-over event of Slave_TIMER6 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST7_CMP1            ((uint32_t)0x00000025U)                                         /*!< 100101: ADC triggered by compare 1 event of Slave_TIMER7 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST7_CMP2            ((uint32_t)0x00000026U)                                         /*!< 100110: ADC triggered by compare 2 event of Slave_TIMER7 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST7_CMP3            ((uint32_t)0x00000027U)                                         /*!< 100111: ADC triggered by compare 3 event of Slave_TIMER7 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST7_PERIOD          ((uint32_t)0x00000028U)                                         /*!< 101000: ADC triggered by period event of Slave_TIMER7 */
#define HRTIMER_ADC_EXT_TRIG_468_BY_ST7_RESET           ((uint32_t)0x00000029U)                                         /*!< 101001: ADC triggered by reset and counter roll-over event of Slave_TIMER7 */

/* ADC trigger 5,7,9 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_MASTER_CMP0         ((uint32_t)0x00000000U)                                         /*!< 000000: ADC triggered by compare 0 event of Master_TIMER */
#define HRTIMER_ADC_EXT_TRIG_579_BY_MASTER_CMP1         ((uint32_t)0x00000001U)                                         /*!< 000001: ADC triggered by compare 1 event of Master_TIMER */
#define HRTIMER_ADC_EXT_TRIG_579_BY_MASTER_CMP2         ((uint32_t)0x00000002U)                                         /*!< 000010: ADC triggered by compare 2 event of Master_TIMER */
#define HRTIMER_ADC_EXT_TRIG_579_BY_MASTER_CMP3         ((uint32_t)0x00000003U)                                         /*!< 000011: ADC triggered by compare 3 event of Master_TIMER */
#define HRTIMER_ADC_EXT_TRIG_579_BY_MASTER_PERIOD       ((uint32_t)0x00000004U)                                         /*!< 000100: ADC triggered by period event of Master_TIMER */
#define HRTIMER_ADC_EXT_TRIG_579_BY_EXEV_5              ((uint32_t)0x00000005U)                                         /*!< 000101: ADC triggered by external event 5 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_EXEV_6              ((uint32_t)0x00000006U)                                         /*!< 000110: ADC triggered by external event 6 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_EXEV_7              ((uint32_t)0x00000007U)                                         /*!< 000111: ADC triggered by external event 7 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_EXEV_8              ((uint32_t)0x00000008U)                                         /*!< 001000: ADC triggered by external event 8 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_EXEV_9              ((uint32_t)0x00000009U)                                         /*!< 001001: ADC triggered by external event 9 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST0_CMP1            ((uint32_t)0x0000000AU)                                         /*!< 001010: ADC triggered by compare 1 event of Slave_TIMER0 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST0_CMP3            ((uint32_t)0x0000000BU)                                         /*!< 001011: ADC triggered by compare 3 event of Slave_TIMER0 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST0_PERIOD          ((uint32_t)0x0000000CU)                                         /*!< 001100: ADC triggered by period event of Slave_TIMER0 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST1_CMP1            ((uint32_t)0x0000000DU)                                         /*!< 001101: ADC triggered by compare 1 event of Slave_TIMER1 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST1_CMP3            ((uint32_t)0x0000000EU)                                         /*!< 001110: ADC triggered by compare 3 event of Slave_TIMER1 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST1_PERIOD          ((uint32_t)0x0000000FU)                                         /*!< 001111: ADC triggered by period event of Slave_TIMER1 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST2_CMP1            ((uint32_t)0x00000010U)                                         /*!< 010000: ADC triggered by compare 1 event of Slave_TIMER2 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST2_CMP3            ((uint32_t)0x00000011U)                                         /*!< 010001: ADC triggered by compare 3 event of Slave_TIMER2 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST2_PERIOD          ((uint32_t)0x00000012U)                                         /*!< 010010: ADC triggered by period event of Slave_TIMER2 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST2_RESET           ((uint32_t)0x00000013U)                                         /*!< 010011: ADC triggered by reset and counter roll-over event of Slave_TIMER2 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST3_CMP1            ((uint32_t)0x00000014U)                                         /*!< 010100: ADC triggered by compare 1 event of Slave_TIMER3 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST3_CMP3            ((uint32_t)0x00000015U)                                         /*!< 010101: ADC triggered by compare 3 event of Slave_TIMER3 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST3_PERIOD          ((uint32_t)0x00000016U)                                         /*!< 010110: ADC triggered by period event of Slave_TIMER3 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST3_RESET           ((uint32_t)0x00000017U)                                         /*!< 010111: ADC triggered by reset and counter roll-over event of Slave_TIMER3 */ 
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST4_CMP1            ((uint32_t)0x00000018U)                                         /*!< 011000: ADC triggered by compare 1 event of Slave_TIMER4 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST4_CMP2            ((uint32_t)0x00000019U)                                         /*!< 011001: ADC triggered by compare 2 event of Slave_TIMER4 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST4_CMP3            ((uint32_t)0x0000001AU)                                         /*!< 011010: ADC triggered by compare 3 event of Slave_TIMER4 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST4_RESET           ((uint32_t)0x0000001BU)                                         /*!< 011011: ADC triggered by reset and counter roll-over event of Slave_TIMER4 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST5_CMP1            ((uint32_t)0x0000001CU)                                         /*!< 011100: ADC triggered by compare 1 event of Slave_TIMER5 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST5_CMP2            ((uint32_t)0x0000001DU)                                         /*!< 011101: ADC triggered by compare 2 event of Slave_TIMER5 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST5_CMP3            ((uint32_t)0x0000001EU)                                         /*!< 011110: ADC triggered by compare 3 event of Slave_TIMER5 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST5_PERIOD          ((uint32_t)0x0000001FU)                                         /*!< 011111: ADC triggered by period event of Slave_TIMER5 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST6_CMP1            ((uint32_t)0x00000020U)                                         /*!< 100000: ADC triggered by compare 1 event of Slave_TIMER6 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST6_CMP2            ((uint32_t)0x00000021U)                                         /*!< 100001: ADC triggered by compare 2 event of Slave_TIMER6 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST6_CMP3            ((uint32_t)0x00000022U)                                         /*!< 100010: ADC triggered by compare 3 event of Slave_TIMER6 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST6_PERIOD          ((uint32_t)0x00000023U)                                         /*!< 100011: ADC triggered by period event of Slave_TIMER6 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST6_RESET           ((uint32_t)0x00000024U)                                         /*!< 100100: ADC triggered by reset and counter roll-over event of Slave_TIMER6 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST7_CMP1            ((uint32_t)0x00000025U)                                         /*!< 100101: ADC triggered by compare 1 event of Slave_TIMER7 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST7_CMP2            ((uint32_t)0x00000026U)                                         /*!< 100110: ADC triggered by compare 2 event of Slave_TIMER7 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST7_CMP3            ((uint32_t)0x00000027U)                                         /*!< 100111: ADC triggered by compare 3 event of Slave_TIMER7 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST7_PERIOD          ((uint32_t)0x00000028U)                                         /*!< 101000: ADC triggered by period event of Slave_TIMER7 */
#define HRTIMER_ADC_EXT_TRIG_579_BY_ST7_RESET           ((uint32_t)0x00000029U)                                         /*!< 101001: ADC triggered by reset and counter roll-over event of Slave_TIMER7 */

