wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* DLL calibration control */
#define HRTIMER_CALIBRATION_ONCE                        ((uint32_t)0x88888888U)                                         /*!< DLL calibration start once */
#define HRTIMER_CALIBRATION_1048576_PERIOD              ((uint32_t)0x00000000U)                                         /*!< 1048576 * tHRTIMER_CK */
#define HRTIMER_CALIBRATION_131072_PERIOD               ((uint32_t)0x00000004U)                                         /*!< 131072 * tHRTIMER_CK */
#define HRTIMER_CALIBRATION_16384_PERIOD                ((uint32_t)0x00000008U)                                         /*!< 16384 * tHRTIMER_CK  */
#define HRTIMER_CALIBRATION_2048_PERIOD                 ((uint32_t)0x0000000CU)                                         /*!< 2048 * tHRTIMER_CK */

/* Master_TIMER and Slave_TIMER interrupt enable or disable */
#define HRTIMER_MT_ST_INT_CMP0                          HRTIMER_STXDMAINTEN_CMP0IE                                      /*!< compare 0 interrupt */
#define HRTIMER_MT_ST_INT_CMP1                          HRTIMER_STXDMAINTEN_CMP1IE                                      /*!< compare 1 interrupt */
#define HRTIMER_MT_ST_INT_CMP2                          HRTIMER_STXDMAINTEN_CMP2IE                                      /*!< compare 2 interrupt */
#define HRTIMER_MT_ST_INT_CMP3                          HRTIMER_STXDMAINTEN_CMP3IE                                      /*!< compare 3 interrupt */
#define HRTIMER_MT_ST_INT_REP                           HRTIMER_STXDMAINTEN_REPIE                                       /*!< repetition interrupt */
#define HRTIMER_MT_INT_SYNI                             HRTIMER_MTDMAINTEN_SYNIIE                                       /*!< synchronization input interrupt */
#define HRTIMER_MT_ST_INT_UPD                           HRTIMER_STXDMAINTEN_UPIE                                        /*!< update interrupt */
#define HRTIMER_ST_INT_CAP0                             HRTIMER_STXDMAINTEN_CAP0IE                                      /*!< capture 0 interrupt */
#define HRTIMER_ST_INT_CAP1                             HRTIMER_STXDMAINTEN_CAP1IE                                      /*!< capture 1 interrupt */
#define HRTIMER_ST_INT_CH0OA                            HRTIMER_STXDMAINTEN_CH0OAIE                                     /*!< channel 0 output active interrupt */
#define HRTIMER_ST_INT_CH0ONA                           HRTIMER_STXDMAINTEN_CH0ONAIE                                    /*!< channel 0 output inactive interrupt */
#define HRTIMER_ST_INT_CH1OA                            HRTIMER_STXDMAINTEN_CH1OAIE                                     /*!< channel 1 output active interrupt */
#define HRTIMER_ST_INT_CH1ONA                           HRTIMER_STXDMAINTEN_CH1ONAIE                                    /*!< channel 1 output inactive interrupt */
#define HRTIMER_ST_INT_CNTRST                           HRTIMER_STXDMAINTEN_RSTIE                                       /*!< counter reset interrupt */
#define HRTIMER_ST_INT_DLYIDLE                          HRTIMER_STXDMAINTEN_DLYIIE                                      /*!< delayed IDLE mode entry interrupt */

/* HRTIMER common interrupt */
#define HRTIMER_INT_FLT0                                HRTIMER_INTEN_FLT0IE                                            /*!< fault 0 interrupt enable */
#define HRTIMER_INT_FLT1                                HRTIMER_INTEN_FLT1IE                                            /*!< fault 1 interrupt enable */
#define HRTIMER_INT_FLT2                                HRTIMER_INTEN_FLT2IE                                            /*!< fault 2 interrupt enable */
#define HRTIMER_INT_FLT3                                HRTIMER_INTEN_FLT3IE                                            /*!< fault 3 interrupt enable */
#define HRTIMER_INT_FLT4                                HRTIMER_INTEN_FLT4IE                                            /*!< fault 4 interrupt enable */
#define HRTIMER_INT_FLT5                                HRTIMER_INTEN_FLT5IE                                            /*!< fault 5 interrupt enable */
#define HRTIMER_INT_FLT6                                HRTIMER_INTEN_FLT6IE                                            /*!< fault 6 interrupt enable */
#define HRTIMER_INT_FLT7                                HRTIMER_INTEN_FLT7IE                                            /*!< fault 7 interrupt enable */
#define HRTIMER_INT_SYSFLT                              HRTIMER_INTEN_SYSFLTIE                                          /*!< system fault interrupt */
#define HRTIMER_INT_DLLCAL                              HRTIMER_INTEN_DLLCALIE                                          /*!< DLL calibration completed interrupt */
#define HRTIMER_INT_BMPER                               HRTIMER_INTEN_BMPERIE                                           /*!< bunch mode period interrupt */

/* Master_TIMER and Slave_TIMER interrupt flag */
#define HRTIMER_MT_ST_INT_FLAG_CMP0                     HRTIMER_STXINTF_CMP0IF                                          /*!< compare 0 interrupt flag */
#define HRTIMER_MT_ST_INT_FLAG_CMP1                     HRTIMER_STXINTF_CMP1IF                                          /*!< compare 1 interrupt flag */
#define HRTIMER_MT_ST_INT_FLAG_CMP2                     HRTIMER_STXINTF_CMP2IF                                          /*!< compare 2 interrupt flag */
#define HRTIMER_MT_ST_INT_FLAG_CMP3                     HRTIMER_STXINTF_CMP3IF                                          /*!< compare 3 interrupt flag */
#define HRTIMER_MT_ST_INT_FLAG_REP                      HRTIMER_STXINTF_REPIF                                           /*!< repetition interrupt flag */
#define HRTIMER_MT_INT_FLAG_SYNI                        HRTIMER_MTINTF_SYNIIF                                           /*!< synchronization input interrupt flag */
#define HRTIMER_MT_ST_INT_FLAG_UPD                      HRTIMER_STXINTF_UPIF                                            /*!< update interrupt flag */
#define HRTIMER_ST_INT_FLAG_CAP0                        HRTIMER_STXINTF_CAP0IF                                          /*!< capture 0 interrupt flag */
#define HRTIMER_ST_INT_FLAG_CAP1                        HRTIMER_STXINTF_CAP1IF                                          /*!< capture 1 interrupt flag */
#define HRTIMER_ST_INT_FLAG_CH0OA                       HRTIMER_STXINTF_CH0OAIF                                         /*!< channel 0 output active interrupt flag */
#define HRTIMER_ST_INT_FLAG_CH0ONA                      HRTIMER_STXINTF_CH0ONAIF                                        /*!< channel 0 output inactive interrupt flag */
#define HRTIMER_ST_INT_FLAG_CH1OA                       HRTIMER_STXINTF_CH1OAIF                                         /*!< channel 1 output active interrupt flag */
#define HRTIMER_ST_INT_FLAG_CH1ONA                      HRTIMER_STXINTF_CH1ONAIF                                        /*!< channel 1 output inactive interrupt flag */
#define HRTIMER_ST_INT_FLAG_CNTRST                      HRTIMER_STXINTF_RSTIF                                           /*!< counter reset interrupt flag */
#define HRTIMER_ST_INT_FLAG_DLYIDLE                     HRTIMER_STXINTF_DLYIIF                                          /*!< delayed IDLE mode entry interrupt flag */

/* HRTIMER common interrupt flag */
#define HRTIMER_INT_FLAG_FLT0                           HRTIMER_INTF_FLT0IF                                             /*!< fault 0 interrupt flag */
#define HRTIMER_INT_FLAG_FLT1                           HRTIMER_INTF_FLT1IF                                             /*!< fault 1 interrupt flag */
#define HRTIMER_INT_FLAG_FLT2                           HRTIMER_INTF_FLT2IF                                             /*!< fault 2 interrupt flag */
#define HRTIMER_INT_FLAG_FLT3                           HRTIMER_INTF_FLT3IF                                             /*!< fault 3 interrupt flag */
#define HRTIMER_INT_FLAG_FLT4                           HRTIMER_INTF_FLT4IF                                             /*!< fault 4 interrupt flag */
#define HRTIMER_INT_FLAG_FLT5                           HRTIMER_INTF_FLT5IF                                             /*!< fault 5 interrupt flag */
#define HRTIMER_INT_FLAG_FLT6                           HRTIMER_INTF_FLT6IF                                             /*!< fault 6 interrupt flag */
#define HRTIMER_INT_FLAG_FLT7                           HRTIMER_INTF_FLT7IF                                             /*!< fault 7 interrupt flag */
#define HRTIMER_INT_FLAG_SYSFLT                         HRTIMER_INTF_SYSFLTIF                                           /*!< system fault interrupt flag */
#define HRTIMER_INT_FLAG_DLLCAL                         HRTIMER_INTF_DLLCALIF                                           /*!< DLL calibration completed interrupt flag */
#define HRTIMER_INT_FLAG_BMPER                          HRTIMER_INTF_BMPERIF                                            /*!< bunch mode period interrupt flag */

/* Master_TIMER and Slave_TIMER flag */
#define HRTIMER_MT_ST_FLAG_CMP0                         HRTIMER_STXINTF_CMP0IF                                          /*!< compare 0 flag */
#define HRTIMER_MT_ST_FLAG_CMP1                         HRTIMER_STXINTF_CMP1IF                                          /*!< compare 1 flag */
#define HRTIMER_MT_ST_FLAG_CMP2                         HRTIMER_STXINTF_CMP2IF                                          /*!< compare 2 flag */
#define HRTIMER_MT_ST_FLAG_CMP3                         HRTIMER_STXINTF_CMP3IF                                          /*!< compare 3 flag */
#define HRTIMER_MT_ST_FLAG_REP                          HRTIMER_STXINTF_REPIF                                           /*!< repetition flag */
#define HRTIMER_MT_FLAG_SYNI                            HRTIMER_MTINTF_SYNIIF                                           /*!< synchronization input flag */
#define HRTIMER_MT_ST_FLAG_UPD                          HRTIMER_STXINTF_UPIF                                            /*!< update flag */
#define HRTIMER_ST_FLAG_CAP0                            HRTIMER_STXINTF_CAP0IF                                          /*!< capture 0 flag */
#define HRTIMER_ST_FLAG_CAP1                            HRTIMER_STXINTF_CAP1IF                                          /*!< capture 1 flag */
#define HRTIMER_ST_FLAG_CH0OA                           HRTIMER_STXINTF_CH0OAIF                                         /*!< channel 0 output active flag */
#define HRTIMER_ST_FLAG_CH0ONA                          HRTIMER_STXINTF_CH0ONAIF                                        /*!< channel 0 output inactive flag */
#define HRTIMER_ST_FLAG_CH1OA                           HRTIMER_STXINTF_CH1OAIF                                         /*!< channel 1 output active flag */
#define HRTIMER_ST_FLAG_CH1ONA                          HRTIMER_STXINTF_CH1ONAIF                                        /*!< channel 1 output inactive flag */
#define HRTIMER_ST_FLAG_CNTRST                          HRTIMER_STXINTF_RSTIF                                           /*!< counter reset flag */
#define HRTIMER_ST_FLAG_DLYIDLE                         HRTIMER_STXINTF_DLYIIF                                          /*!< delayed IDLE mode entry flag */
#define HRTIMER_ST_FLAG_CBLN                            HRTIMER_STXINTF_CBLNF                                           /*!< current balanced flag */
#define HRTIMER_ST_FLAG_BLNIDLE                         HRTIMER_STXINTF_BLNIF                                           /*!< balanced IDLE flag */
#define HRTIMER_ST_FLAG_CH0OUTS                         HRTIMER_STXINTF_CH0SF                                           /*!< channel 0 output status flag */
#define HRTIMER_ST_FLAG_CH1OUTS                         HRTIMER_STXINTF_CH1SF                                           /*!< channel 1 output status flag */
#define HRTIMER_ST_FLAG_CH0OUT                          HRTIMER_STXINTF_CH0F                                            /*!< channel 0 output flag */
#define HRTIMER_ST_FLAG_CH1OUT                          HRTIMER_STXINTF_CH1F                                            /*!< channel 1 output flag */

