wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* HRTIMER common flag */
#define HRTIMER_FLAG_FLT0                               HRTIMER_INTF_FLT0IF                                             /*!< fault 0 flag */
#define HRTIMER_FLAG_FLT1                               HRTIMER_INTF_FLT1IF                                             /*!< fault 1 flag */
#define HRTIMER_FLAG_FLT2                               HRTIMER_INTF_FLT2IF                                             /*!< fault 2 flag */
#define HRTIMER_FLAG_FLT3                               HRTIMER_INTF_FLT3IF                                             /*!< fault 3 flag */
#define HRTIMER_FLAG_FLT4                               HRTIMER_INTF_FLT4IF                                             /*!< fault 4 flag */
#define HRTIMER_FLAG_FLT5                               HRTIMER_INTF_FLT5IF                                             /*!< fault 5 flag */
#define HRTIMER_FLAG_FLT6                               HRTIMER_INTF_FLT6IF                                             /*!< fault 6 flag */
#define HRTIMER_FLAG_FLT7                               HRTIMER_INTF_FLT7IF                                             /*!< fault 7 flag */
#define HRTIMER_FLAG_SYSFLT                             HRTIMER_INTF_SYSFLTIF                                           /*!< system fault flag */
#define HRTIMER_FLAG_DLLCAL                             HRTIMER_INTF_DLLCALIF                                           /*!< DLL calibration completed flag */
#define HRTIMER_FLAG_BMPER                              HRTIMER_INTF_BMPERIF                                            /*!< bunch mode period flag */

/* Master_TIMER and Slave_TIMER DMA request */
#define HRTIMER_MT_ST_DMA_CMP0                          HRTIMER_STXDMAINTEN_CMP0DEN                                     /*!< compare 0 DMA request */
#define HRTIMER_MT_ST_DMA_CMP1                          HRTIMER_STXDMAINTEN_CMP1DEN                                     /*!< compare 1 DMA request */
#define HRTIMER_MT_ST_DMA_CMP2                          HRTIMER_STXDMAINTEN_CMP2DEN                                     /*!< compare 2 DMA request */
#define HRTIMER_MT_ST_DMA_CMP3                          HRTIMER_STXDMAINTEN_CMP3DEN                                     /*!< compare 3 DMA request */
#define HRTIMER_MT_ST_DMA_REP                           HRTIMER_STXDMAINTEN_REPDEN                                      /*!< repetition DMA request */
#define HRTIMER_MT_DMA_SYNID                            HRTIMER_MTDMAINTEN_SYNIDEN                                      /*!< synchronization input DMA request */
#define HRTIMER_MT_ST_DMA_UPD                           HRTIMER_STXDMAINTEN_UPDEN                                       /*!< update DMA request */
#define HRTIMER_ST_DMA_CAP0                             HRTIMER_STXDMAINTEN_CAP0DEN                                     /*!< capture 0 DMA request */
#define HRTIMER_ST_DMA_CAP1                             HRTIMER_STXDMAINTEN_CAP1DEN                                     /*!< capture 1 DMA request */
#define HRTIMER_ST_DMA_CH0OA                            HRTIMER_STXDMAINTEN_CH0OADEN                                    /*!< channel 0 output active DMA request */
#define HRTIMER_ST_DMA_CH0ONA                           HRTIMER_STXDMAINTEN_CH0ONADEN                                   /*!< channel 0 output inactive DMA request */
#define HRTIMER_ST_DMA_CH1OA                            HRTIMER_STXDMAINTEN_CH1OADEN                                    /*!< channel 1 output active DMA request */
#define HRTIMER_ST_DMA_CH1ONA                           HRTIMER_STXDMAINTEN_CH1ONADEN                                   /*!< channel 1 output inactive DMA request */
#define HRTIMER_ST_DMA_CNTRST                           HRTIMER_STXDMAINTEN_RSTDEN                                      /*!< counter reset DMA request */
#define HRTIMER_ST_DMA_DLYIDLE                          HRTIMER_STXDMAINTEN_DLYIDEN                                     /*!< delay IDLE DMA request */

/* Master_TIMER or Slave_TIMER update by software */
#define HRTIMER_UPDATE_SW_MT                            (HRTIMER_CTL1_MTSUP)                                            /*!< Master_TIMER software update */
#define HRTIMER_UPDATE_SW_ST0                           (HRTIMER_CTL1_ST0SUP)                                           /*!< Slave_TIMER0 software update */
#define HRTIMER_UPDATE_SW_ST1                           (HRTIMER_CTL1_ST1SUP)                                           /*!< Slave_TIMER1 software update */
#define HRTIMER_UPDATE_SW_ST2                           (HRTIMER_CTL1_ST2SUP)                                           /*!< Slave_TIMER2 software update */
#define HRTIMER_UPDATE_SW_ST3                           (HRTIMER_CTL1_ST3SUP)                                           /*!< Slave_TIMER3 software update */
#define HRTIMER_UPDATE_SW_ST4                           (HRTIMER_CTL1_ST4SUP)                                           /*!< Slave_TIMER4 software update */
#define HRTIMER_UPDATE_SW_ST5                           (HRTIMER_CTL1_ST5SUP)                                           /*!< Slave_TIMER5 software update */
#define HRTIMER_UPDATE_SW_ST6                           (HRTIMER_CTL1_ST6SUP)                                           /*!< Slave_TIMER6 software update */
#define HRTIMER_UPDATE_SW_ST7                           (HRTIMER_CTL1_ST7SUP)                                           /*!< Slave_TIMER7 software update */

/* Master_TIMER or Slave_TIMER counter reset by software */
#define HRTIMER_COUNTER_RESET_SW_MT                     (HRTIMER_CTL1_MTSRST)                                           /*!< Master_TIMER software reset */
#define HRTIMER_COUNTER_RESET_SW_ST0                    (HRTIMER_CTL1_ST0SRST)                                          /*!< Slave_TIMER0 software reset */
#define HRTIMER_COUNTER_RESET_SW_ST1                    (HRTIMER_CTL1_ST1SRST)                                          /*!< Slave_TIMER1 software reset */
#define HRTIMER_COUNTER_RESET_SW_ST2                    (HRTIMER_CTL1_ST2SRST)                                          /*!< Slave_TIMER2 software reset */
#define HRTIMER_COUNTER_RESET_SW_ST3                    (HRTIMER_CTL1_ST3SRST)                                          /*!< Slave_TIMER3 software reset */
#define HRTIMER_COUNTER_RESET_SW_ST4                    (HRTIMER_CTL1_ST4SRST)                                          /*!< Slave_TIMER4 software reset */
#define HRTIMER_COUNTER_RESET_SW_ST5                    (HRTIMER_CTL1_ST5SRST)                                          /*!< Slave_TIMER5 software reset */
#define HRTIMER_COUNTER_RESET_SW_ST6                    (HRTIMER_CTL1_ST6SRST)                                          /*!< Slave_TIMER6 software reset */
#define HRTIMER_COUNTER_RESET_SW_ST7                    (HRTIMER_CTL1_ST7SRST)                                          /*!< Slave_TIMER7 software reset */

