wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* Slave_TIMER output exchange */
#define HRTIMER_OUTPUT_EXCHANGE_ST0            (HRTIMER_CTL1_EXC0)                                              /*!< Slave_TIMER0 exchange output */
#define HRTIMER_OUTPUT_EXCHANGE_ST1            (HRTIMER_CTL1_EXC1)                                              /*!< Slave_TIMER1 exchange output */
#define HRTIMER_OUTPUT_EXCHANGE_ST2            (HRTIMER_CTL1_EXC2)                                              /*!< Slave_TIMER2 exchange output */
#define HRTIMER_OUTPUT_EXCHANGE_ST3            (HRTIMER_CTL1_EXC3)                                              /*!< Slave_TIMER3 exchange output */
#define HRTIMER_OUTPUT_EXCHANGE_ST4            (HRTIMER_CTL1_EXC4)                                              /*!< Slave_TIMER4 exchange output */
#define HRTIMER_OUTPUT_EXCHANGE_ST5            (HRTIMER_CTL1_EXC5)                                              /*!< Slave_TIMER5 exchange output */
#define HRTIMER_OUTPUT_EXCHANGE_ST6            (HRTIMER_CTL1_EXC6)                                              /*!< Slave_TIMER6 exchange output */
#define HRTIMER_OUTPUT_EXCHANGE_ST7            (HRTIMER_CTL1_EXC7)                                              /*!< Slave_TIMER7 exchange output */

/* channel output polarity */
#define HRTIMER_CHANNEL_POLARITY_HIGH                   ((uint32_t)0x00000000U)                                         /*!< channel active high */
#define HRTIMER_CHANNEL_POLARITY_LOW                    (HRTIMER_STXCHOCTL_CH0P)                                        /*!< channel active low */

/* channel set request */
#define HRTIMER_CHANNEL_SET_NONE                        ((uint64_t)0x0000000000000000U)                                 /*!< clear all channel set request */
#define HRTIMER_CHANNEL_SET_RSTSYNI                     (HRTIMER_STXCH0SET_CH0SRST)                                     /*!< Slave_TIMERx reset event from synchronous input and software can generate channel set request */
#define HRTIMER_CHANNEL_SET_PER                         (HRTIMER_STXCH0SET_CH0SPER)                                     /*!< Slave_TIMERx period event can generate set request */
#define HRTIMER_CHANNEL_SET_CMP0                        (HRTIMER_STXCH0SET_CH0SCMP0)                                    /*!< Slave_TIMERx compare 0 event can generate set request */
#define HRTIMER_CHANNEL_SET_CMP1                        (HRTIMER_STXCH0SET_CH0SCMP1)                                    /*!< Slave_TIMERx compare 1 event can generate set request */
#define HRTIMER_CHANNEL_SET_CMP2                        (HRTIMER_STXCH0SET_CH0SCMP2)                                    /*!< Slave_TIMERx compare 2 event can generate set request */
#define HRTIMER_CHANNEL_SET_CMP3                        (HRTIMER_STXCH0SET_CH0SCMP3)                                    /*!< Slave_TIMERx compare 3 event can generate set request */
#define HRTIMER_CHANNEL_SET_MTPER                       (HRTIMER_STXCH0SET_CH0SMTPER)                                   /*!< Master_TIMER period event generates channel set request */
#define HRTIMER_CHANNEL_SET_MTCMP0                      (HRTIMER_STXCH0SET_CH0SMTCMP0)                                  /*!< Master_TIMER compare 0 event generates channel set request */
#define HRTIMER_CHANNEL_SET_MTCMP1                      (HRTIMER_STXCH0SET_CH0SMTCMP1)                                  /*!< Master_TIMER compare 1 event generates channel set request */
#define HRTIMER_CHANNEL_SET_MTCMP2                      (HRTIMER_STXCH0SET_CH0SMTCMP2)                                  /*!< Master_TIMER compare 2 event generates channel set request */
#define HRTIMER_CHANNEL_SET_MTCMP3                      (HRTIMER_STXCH0SET_CH0SMTCMP3)                                  /*!< Master_TIMER compare 3 event generates channel set request */
#define HRTIMER_CHANNEL_SET_STEV0                       (HRTIMER_STXCH0SET_CH0SSTEV0)                                   /*!< Slave_TIMERx interconnection event 0 generates channel set request */
#define HRTIMER_CHANNEL_SET_STEV1                       (HRTIMER_STXCH0SET_CH0SSTEV1)                                   /*!< Slave_TIMERx interconnection event 1 generates channel set request */
#define HRTIMER_CHANNEL_SET_STEV2                       (HRTIMER_STXCH0SET_CH0SSTEV2)                                   /*!< Slave_TIMERx interconnection event 2 generates channel set request */
#define HRTIMER_CHANNEL_SET_STEV3                       (HRTIMER_STXCH0SET_CH0SSTEV3)                                   /*!< Slave_TIMERx interconnection event 3 generates channel set request */
#define HRTIMER_CHANNEL_SET_STEV4                       (HRTIMER_STXCH0SET_CH0SSTEV4)                                   /*!< Slave_TIMERx interconnection event 4 generates channel set request */
#define HRTIMER_CHANNEL_SET_STEV5                       (HRTIMER_STXCH0SET_CH0SSTEV5)                                   /*!< Slave_TIMERx interconnection event 5 generates channel set request */
#define HRTIMER_CHANNEL_SET_STEV6                       (HRTIMER_STXCH0SET_CH0SSTEV6)                                   /*!< Slave_TIMERx interconnection event 6 generates channel set request */
#define HRTIMER_CHANNEL_SET_STEV7                       (HRTIMER_STXCH0SET_CH0SSTEV7)                                   /*!< Slave_TIMERx interconnection event 7 generates channel set request */
#define HRTIMER_CHANNEL_SET_STEV8                       (HRTIMER_STXCH0SET_CH0SSTEV8)                                   /*!< Slave_TIMERx interconnection event 8 generates channel set request */
#define HRTIMER_CHANNEL0_SET_STEV9                      (((uint64_t)HRTIMER_STxCNTRSTA_CH0SSTEV9) << 32)                /*!< Slave_TIMERx interconnection event 9 generates channel 0 set request */
#define HRTIMER_CHANNEL0_SET_STEV10                     (((uint64_t)HRTIMER_STxCNTRSTA_CH0SSTEV10) << 32)               /*!< Slave_TIMERx interconnection event 10 generates channel 0 set request */
#define HRTIMER_CHANNEL0_SET_STCNTRST                   (((uint64_t)HRTIMER_STxCNTRSTA_CH0SSTCNTRST) << 32)             /*!< Slave_TIMERx counter reset generates channel 0 set request */
#define HRTIMER_CHANNEL1_SET_STEV9                      (((uint64_t)HRTIMER_STxCNTRSTA_CH1SSTEV9) << 32)                /*!< Slave_TIMERx interconnection event 9 generates channel 1 set request */
#define HRTIMER_CHANNEL1_SET_STEV10                     (((uint64_t)HRTIMER_STxCNTRSTA_CH1SSTEV10) << 32)               /*!< Slave_TIMERx interconnection event 10 generates channel 1 set request */
#define HRTIMER_CHANNEL1_SET_STCNTRST                   (((uint64_t)HRTIMER_STxCNTRSTA_CH1SSTCNTRST) << 32)             /*!< Slave_TIMERx counter reset generates channel 1 set request */
#define HRTIMER_CHANNEL_SET_EXEV0                       (HRTIMER_STXCH0SET_CH0SEXEV0)                                   /*!< external event 0 generates channel set request */
#define HRTIMER_CHANNEL_SET_EXEV1                       (HRTIMER_STXCH0SET_CH0SEXEV1)                                   /*!< external event 1 generates channel set request */
#define HRTIMER_CHANNEL_SET_EXEV2                       (HRTIMER_STXCH0SET_CH0SEXEV2)                                   /*!< external event 2 generates channel set request */
#define HRTIMER_CHANNEL_SET_EXEV3                       (HRTIMER_STXCH0SET_CH0SEXEV3)                                   /*!< external event 3 generates channel set request */
#define HRTIMER_CHANNEL_SET_EXEV4                       (HRTIMER_STXCH0SET_CH0SEXEV4)                                   /*!< external event 4 generates channel set request */
#define HRTIMER_CHANNEL_SET_EXEV5                       (HRTIMER_STXCH0SET_CH0SEXEV5)                                   /*!< external event 5 generates channel set request */
#define HRTIMER_CHANNEL_SET_EXEV6                       (HRTIMER_STXCH0SET_CH0SEXEV6)                                   /*!< external event 6 generates channel set request */
#define HRTIMER_CHANNEL_SET_EXEV7                       (HRTIMER_STXCH0SET_CH0SEXEV7)                                   /*!< external event 7 generates channel set request */
#define HRTIMER_CHANNEL_SET_EXEV8                       (HRTIMER_STXCH0SET_CH0SEXEV8)                                   /*!< external event 8 generates channel set request */
#define HRTIMER_CHANNEL_SET_EXEV9                       (HRTIMER_STXCH0SET_CH0SEXEV9)                                   /*!< external event 9 generates channel set request */
#define HRTIMER_CHANNEL_SET_UPDATE                      (HRTIMER_STXCH0SET_CH0SUP)                                      /*!< update event generates channel set request */

/* channel reset request */
#define HRTIMER_CHANNEL_RESET_NONE                      ((uint64_t)0x0000000000000000U)                                 /*!< clear all channel reset request */
#define HRTIMER_CHANNEL_RESET_RSTSYNI                   (HRTIMER_STXCH0RST_CH0RSRST)                                    /*!< Slave_TIMERx reset event from synchronous input and software can generate channel reset request */
#define HRTIMER_CHANNEL_RESET_PER                       (HRTIMER_STXCH0RST_CH0RSPER)                                    /*!< Slave_TIMERx period event can generate reset request */
#define HRTIMER_CHANNEL_RESET_CMP0                      (HRTIMER_STXCH0RST_CH0RSCMP0)                                   /*!< Slave_TIMERx compare 0 event can generate reset request */
#define HRTIMER_CHANNEL_RESET_CMP1                      (HRTIMER_STXCH0RST_CH0RSCMP1)                                   /*!< Slave_TIMERx compare 1 event can generate reset request */
#define HRTIMER_CHANNEL_RESET_CMP2                      (HRTIMER_STXCH0RST_CH0RSCMP2)                                   /*!< Slave_TIMERx compare 2 event can generate reset request */
#define HRTIMER_CHANNEL_RESET_CMP3                      (HRTIMER_STXCH0RST_CH0RSCMP3)                                   /*!< Slave_TIMERx compare 3 event can generate reset request */
#define HRTIMER_CHANNEL_RESET_MTPER                     (HRTIMER_STXCH0RST_CH0RSMTPER)                                  /*!< Master_TIMER period event generates channel reset request */
#define HRTIMER_CHANNEL_RESET_MTCMP0                    (HRTIMER_STXCH0RST_CH0RSMTCMP0)                                 /*!< Master_TIMER compare 0 event generates channel reset request */
#define HRTIMER_CHANNEL_RESET_MTCMP1                    (HRTIMER_STXCH0RST_CH0RSMTCMP1)                                 /*!< Master_TIMER compare 1 event generates channel reset request */
#define HRTIMER_CHANNEL_RESET_MTCMP2                    (HRTIMER_STXCH0RST_CH0RSMTCMP2)                                 /*!< Master_TIMER compare 2 event generates channel reset request */
#define HRTIMER_CHANNEL_RESET_MTCMP3                    (HRTIMER_STXCH0RST_CH0RSMTCMP3)                                 /*!< Master_TIMER compare 3 event generates channel reset request */
#define HRTIMER_CHANNEL_RESET_STEV0                     (HRTIMER_STXCH0RST_CH0RSSTEV0)                                  /*!< Slave_TIMERx interconnection event 0 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_STEV1                     (HRTIMER_STXCH0RST_CH0RSSTEV1)                                  /*!< Slave_TIMERx interconnection event 1 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_STEV2                     (HRTIMER_STXCH0RST_CH0RSSTEV2)                                  /*!< Slave_TIMERx interconnection event 2 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_STEV3                     (HRTIMER_STXCH0RST_CH0RSSTEV3)                                  /*!< Slave_TIMERx interconnection event 3 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_STEV4                     (HRTIMER_STXCH0RST_CH0RSSTEV4)                                  /*!< Slave_TIMERx interconnection event 4 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_STEV5                     (HRTIMER_STXCH0RST_CH0RSSTEV5)                                  /*!< Slave_TIMERx interconnection event 5 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_STEV6                     (HRTIMER_STXCH0RST_CH0RSSTEV6)                                  /*!< Slave_TIMERx interconnection event 6 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_STEV7                     (HRTIMER_STXCH0RST_CH0RSSTEV7)                                  /*!< Slave_TIMERx interconnection event 7 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_STEV8                     (HRTIMER_STXCH0RST_CH0RSSTEV8)                                  /*!< Slave_TIMERx interconnection event 8 generates channel reset request */
#define HRTIMER_CHANNEL0_RESET_STEV9                    (((uint64_t)HRTIMER_STxCNTRSTA_CH0RSSTEV9) << 32)               /*!< Slave_TIMERx interconnection event 9 generates channel 0 reset request */
#define HRTIMER_CHANNEL0_RESET_STEV10                   (((uint64_t)HRTIMER_STxCNTRSTA_CH0RSSTEV10) << 32)              /*!< Slave_TIMERx interconnection event 10 generates channel 0 reset request */
#define HRTIMER_CHANNEL0_RESET_STCNTRST                 (((uint64_t)HRTIMER_STxCNTRSTA_CH0RSSTCNTRST) << 32)            /*!< Slave_TIMERx counter reset generates channel 0 reset request */
#define HRTIMER_CHANNEL1_RESET_STEV9                    (((uint64_t)HRTIMER_STxCNTRSTA_CH1RSSTEV9) << 32)               /*!< Slave_TIMERx interconnection event 9 generates channel 1 reset request */
#define HRTIMER_CHANNEL1_RESET_STEV10                   (((uint64_t)HRTIMER_STxCNTRSTA_CH1RSSTEV10) << 32)              /*!< Slave_TIMERx interconnection event 10 generates channel 1 reset request */
#define HRTIMER_CHANNEL1_RESET_STCNTRST                 (((uint64_t)HRTIMER_STxCNTRSTA_CH1RSSTCNTRST) << 32)            /*!< Slave_TIMERx counter reset generates channel 1 reset request */
#define HRTIMER_CHANNEL_RESET_EXEV0                     (HRTIMER_STXCH0RST_CH0RSEXEV0)                                  /*!< external event 0 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_EXEV1                     (HRTIMER_STXCH0RST_CH0RSEXEV1)                                  /*!< external event 1 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_EXEV2                     (HRTIMER_STXCH0RST_CH0RSEXEV2)                                  /*!< external event 2 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_EXEV3                     (HRTIMER_STXCH0RST_CH0RSEXEV3)                                  /*!< external event 3 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_EXEV4                     (HRTIMER_STXCH0RST_CH0RSEXEV4)                                  /*!< external event 4 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_EXEV5                     (HRTIMER_STXCH0RST_CH0RSEXEV5)                                  /*!< external event 5 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_EXEV6                     (HRTIMER_STXCH0RST_CH0RSEXEV6)                                  /*!< external event 6 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_EXEV7                     (HRTIMER_STXCH0RST_CH0RSEXEV7)                                  /*!< external event 7 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_EXEV8                     (HRTIMER_STXCH0RST_CH0RSEXEV8)                                  /*!< external event 8 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_EXEV9                     (HRTIMER_STXCH0RST_CH0RSEXEV9)                                  /*!< external event 9 generates channel reset request */
#define HRTIMER_CHANNEL_RESET_UPDATE                    (HRTIMER_STXCH0RST_CH0RSUP)                                     /*!< update event generates channel reset request */

/* channel IDLE state enable in bunch mode */
#define HRTIMER_CHANNEL_BUNCH_IDLE_DISABLE              ((uint32_t)0x00000000U)                                          /*!< channel output is not affected by the bunch mode */
#define HRTIMER_CHANNEL_BUNCH_IDLE_ENABLE               (HRTIMER_STXCHOCTL_BMCH0IEN)                                     /*!< channel output can be IDLE state in bunch mode */

/* channel output idle state */
#define HRTIMER_CHANNEL_IDLESTATE_INACTIVE              ((uint32_t)0x00000000U)                                          /*!< channel idle state output is inactive */
#define HRTIMER_CHANNEL_IDLESTATE_ACTIVE                (HRTIMER_STXCHOCTL_ISO0)                                         /*!< channel idle state output is active */

/* channel output in fault state */
#define HRTIMER_CHANNEL_FAULTSTATE_NONE                 ((uint32_t)0x00000000U)                                          /*!< no effect. the output is normally in Run mode when a fault event happened */
#define HRTIMER_CHANNEL_FAULTSTATE_ACTIVE               ((uint32_t)0x00000010U)                                          /*!< output is active level when in FAULT state */
#define HRTIMER_CHANNEL_FAULTSTATE_INACTIVE             ((uint32_t)0x00000020U)                                          /*!< output is inactive level when in FAULT state */
#define HRTIMER_CHANNEL_FAULTSTATE_HIGHZ                ((uint32_t)0x00000030U)                                          /*!< output is Hi-Z when in FAULT state */

/* channel carrier-signal mode enable */
#define HRTIMER_CHANNEL_CARRIER_DISABLED                ((uint32_t)0x00000000U)                                          /*!< the output is not affected by the fault input */
#define HRTIMER_CHANNEL_CARRIER_ENABLED                 (HRTIMER_STXCHOCTL_CH0CSEN)                                      /*!< output at active level when in FAULT state */

