wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* channel dead-time insert in bunch mode */
#define HRTIMER_CHANNEL_BUNCH_ENTRY_REGULAR             ((uint32_t)0x00000000U)                                          /*!< the output enter IDLE immediately */
#define HRTIMER_CHANNEL_BUNCH_ENTRY_DEADTIME            ((uint32_t)0x00000080U)                                          /*!< dead-time is inserted before entering the IDLE state */

/* software event generates channel set request or reset request */
#define HRTIMER_CHANNEL_SOFTWARE_SET                    ((uint32_t)0x00000001U)                                          /*!< software event cannot generate request */
#define HRTIMER_CHANNEL_SOFTWARE_RESET                  ((uint32_t)0x00000002U)                                          /*!< software event can generate request */

/* channel output level */
#define HRTIMER_CHANNEL_OUTPUT_ACTIVE                   ((uint32_t)0x00000001U)                                          /*!< channel outputs active level */
#define HRTIMER_CHANNEL_OUTPUT_INACTIVE                 ((uint32_t)0x00000002U)                                          /*!< channel outputs inactive leve */

/* channel run state */
#define HRTIMER_CHANNEL_STATE_IDLE                      ((uint32_t)0x00000001U)                                          /*!< Run state: the channel output can take the active or inactive level as programmed in the crossbar unit */
#define HRTIMER_CHANNEL_STATE_RUN                       ((uint32_t)0x00000002U)                                          /*!< Idle state: after an HRTIMER reset, when the outputs are disabled by software or during a bunch mode operation */
#define HRTIMER_CHANNEL_STATE_FAULT                     ((uint32_t)0x00000003U)                                          /*!< Fault state: when a fault happen */

/* bunch mode operating flag */
#define HRTIMER_BUNCHMODE_OPERATION_OFF                 ((uint32_t)0x00000000U)                                          /*!< normal operation. bunch mode is not operation */
#define HRTIMER_BUNCHMODE_OPERATION_ON                  ((uint32_t)0x80000000U)                                          /*!< bunch mode operation on-going. */

/* double trigger enable */
#define HRTIMER_DOUBLE_TRIG_DISABLE                     ((uint32_t)0x00000000U)                                          /*!< two channel DAC step trigger is generated on compare 1 event */
#define HRTIMER_DOUBLE_TRIG_ENABLE                      ((uint32_t)0x00000001U)                                          /*!< two channel DAC step trigger is generated on output 0 reset event */

/* two channel DAC step trigger */
#define HRTIMER_DOUBLE_TRIG0_BY_CPV1                    ((uint32_t)0x00000000U)                                          /*!< two channel DAC step trigger is generated on compare 1 event */
#define HRTIMER_DOUBLE_TRIG0_BY_CH0_RESET               ((uint32_t)0x00000002U)                                          /*!< two channel DAC step trigger is generated on output 0 reset event */

/* two channel DAC reset trigger */
#define HRTIMER_DOUBLE_TRIG1_BY_CNT_RESET               ((uint32_t)0x00000000U)                                          /*!< two channel DAC reset trigger is generated on counter reset or roll-over event */
#define HRTIMER_DOUBLE_TRIG1_BY_CH0_SET                 ((uint32_t)0x00000004U)                                          /*!< two channel DAC reset trigger is generated on output 0 set event */

/* roll-over mode */
#define HRTIMER_ROLLOVER_MODE0                          ((uint32_t)0x00000000U)                                          /*!< roll-over Event is generated when the counter is equal to 0 or to HRTIMER_STxCAR value */
#define HRTIMER_ROLLOVER_MODE1                          ((uint32_t)0x00000040U)                                          /*!< roll-over Event is generated when the counter is equal to 0 */
#define HRTIMER_ROLLOVER_MODE2                          ((uint32_t)0x00000080U)                                          /*!< roll-over Event is generated when the counter is equal to the HRTIMER_STxCAR value */

/* output roll-over mode */
#define HRTIMER_OUTPUT_ROLLOVER_MODE0                   ((uint32_t)0x00000000U)                                          /*!< output Roll-over Event is generated when the counter is equal to 0 or to HRTIMER_STxCAR value */
#define HRTIMER_OUTPUT_ROLLOVER_MODE1                   ((uint32_t)0x00000100U)                                          /*!< output Roll-over Event is generated when the counter is equal to 0 */    
#define HRTIMER_OUTPUT_ROLLOVER_MODE2                   ((uint32_t)0x00000200U)                                          /*!< output Roll-over Event is generated when the counter is equal to the HRTIMER_STxCAR value */

/* ADC roll-over mode */
#define HRTIMER_ADC_ROLLOVER_MODE0                      ((uint32_t)0x00000000U)                                          /*!< ADC trigger event generated when counter in up direction and in down direction */
#define HRTIMER_ADC_ROLLOVER_MODE1                      ((uint32_t)0x00000400U)                                          /*!< ADC trigger event generated when counter in down direction */
#define HRTIMER_ADC_ROLLOVER_MODE2                      ((uint32_t)0x00000800U)                                          /*!< ADC trigger event generated when counter in up direction */

/* bunch mode roll-over mode */
#define HRTIMER_BUNCH_MODE_ROLLOVER_MODE0               ((uint32_t)0x00000000U)                                          /*!< bunch mode Roll-over Event is generated when the counter is equal to 0 or to HRTIMER_STxCAR value */
#define HRTIMER_BUNCH_MODE_ROLLOVER_MODE1               ((uint32_t)0x00001000U)                                          /*!< bunch mode Roll-over Event is generated when the counter is equal to 0 */    
#define HRTIMER_BUNCH_MODE_ROLLOVER_MODE2               ((uint32_t)0x00002000U)                                          /*!< bunch mode Roll-over Event is generated when the counter is equal to the HRTIMER_STxCAR value */

/* fault and event roll-over mode */
#define HRTIMER_FAULT_EVENTROLLOVER_MODE0               ((uint32_t)0x00000000U)                                          /*!< fault and event Event is generated when the counter is equal to 0 or to HRTIMER_STxCAR value */
#define HRTIMER_FAULT_EVENTROLLOVER_MODE1               ((uint32_t)0x00004000U)                                          /*!< fault and event Event is generated when the counter is equal to 0 */    
#define HRTIMER_FAULT_EVENTROLLOVER_MODE2               ((uint32_t)0x00008000U)                                          /*!< fault and event Event is generated when the counter is equal to the HRTIMER_STxCAR value */

/* HRTIMER fault recovery control */
#define HRTIMER_FAULT_RECOVERY_CONTROL_DISABLE          ((uint32_t)0x00000000U)                                          /*!< fault counter reset on each reset / roll-over event only if no fault event is active */
#define HRTIMER_FAULT_RECOVERY_CONTROL_ENABLE           (HRTIMER_FLTRECCTL_FLTRECCTL)                                    /*!< fault counter reset on each reset / roll-over event only if no fault event happens in one period */

/* function declarations */
/* HRTIMER timebase configure functions */
/* deinit a HRTIMER */
void hrtimer_deinit(uint32_t hrtimer_periph);
/* configure and start DLL calibration */
void hrtimer_dll_calibration_start(uint32_t hrtimer_periph, uint32_t calform);
/* initialize HRTIMER HRTIMER time base parameters struct with a default value */
void hrtimer_baseinit_struct_para_init(hrtimer_baseinit_parameter_struct* baseinit);
/* initialize Master_TIMER and Slave_TIMER timerbase */
void hrtimer_timers_base_init(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_baseinit_parameter_struct* baseinit);
/* enable a counter */
void hrtimer_timers_counter_enable(uint32_t hrtimer_periph, uint32_t cntid);
/* disable a counter */
void hrtimer_timers_counter_disable(uint32_t hrtimer_periph, uint32_t cntid);
/* enable the Master_TIMER or Slave_TIMER update event */
void hrtimer_timers_update_event_enable(uint32_t hrtimer_periph, uint32_t timer_id);
/* disable the Master_TIMER or Slave_TIMER update event */
void hrtimer_timers_update_event_disable(uint32_t hrtimer_periph, uint32_t timer_id);
/* trigger the Master_TIMER and Slave_TIMER registers update by software */
void hrtimer_software_update(uint32_t hrtimer_periph, uint32_t timersrc);
/* reset the Master_TIMER and Slave_TIMER counter by software */
void hrtimer_software_counter_reset(uint32_t hrtimer_periph, uint32_t timerrst);
/* exchange Slave_TIMERx outputs */
void hrtimer_output_exchange(uint32_t hrtimer_periph, uint32_t timerexc);

/* HRTIMER waveform configure functions */
/* initialize waveform mode initialization parameters struct with a default value */
void hrtimer_timerinit_struct_para_init(hrtimer_timerinit_parameter_struct* timerinit);
/* initialize a timer to work in waveform mode */
void hrtimer_timers_waveform_init(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_timerinit_parameter_struct* timerinitpara);
/* initialize Slave_TIMER general behavior configuration struct with a default value */
void hrtimer_timercfg_struct_para_init(hrtimer_timercfg_parameter_struct* timercfg);
/* configure the general behavior of a Slave_TIMER which work in waveform mode */
void hrtimer_slavetimer_waveform_config(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_timercfg_parameter_struct * timercfg);
/* initialize compare unit configuration struct with a default value */
void hrtimer_comparecfg_struct_para_init(hrtimer_comparecfg_parameter_struct* comparecfg);
/* configure the compare unit of a Slave_TIMER which work in waveform mode */
void hrtimer_slavetimer_waveform_compare_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t comparex, hrtimer_comparecfg_parameter_struct* cmpcfg);
/* initialize channel output configuration struct  with a default value */
void hrtimer_channel_outputcfg_struct_para_init(hrtimer_channel_outputcfg_parameter_struct * channelcfg);
/* configure the channel output of a Slave_TIMER work in waveform mode */
void hrtimer_slavetimer_waveform_channel_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t channel, hrtimer_channel_outputcfg_parameter_struct * channelcfg);
/* software generates channel "set request" or "reset request" */
void hrtimer_slavetimer_waveform_channel_software_request(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t channel, uint32_t request);
/* get Slave_TIMER channel output level */
uint32_t hrtimer_slavetimer_waveform_channel_output_level_get(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t channel);
/* get Slave_TIMER channel run state */
uint32_t hrtimer_slavetimer_waveform_channel_state_get(uint32_t hrtimer_periph, uint32_t channel);
/* initialize dead time configuration struct with a default value */
void hrtimer_deadtimercfg_struct_para_init(hrtimer_deadtimecfg_parameter_struct * dtcfg);
/* configure the dead time for Slave_TIMER */
void hrtimer_slavetimer_deadtime_config(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_deadtimecfg_parameter_struct* dtcfg);
/* initialize carrier signal configuration struct with a default value */
void hrtimer_carriersignalcfg_struct_para_init(hrtimer_carriersignalcfg_parameter_struct* carriercfg);
/* configure the carrier signal mode for Slave_TIMER */
void hrtimer_slavetimer_carriersignal_config(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_carriersignalcfg_parameter_struct* carriercfg);
/* enable a output channel */
void hrtimer_output_channel_enable(uint32_t hrtimer_periph, uint32_t chid);
/* disable a output channel */
void hrtimer_output_channel_disable(uint32_t hrtimer_periph, uint32_t chid);

/* Master_TIMER and Slave_TIMER numerical related functions */
/* configure the compare value in Master_TIMER */
void hrtimer_mastertimer_compare_value_config(uint32_t hrtimer_periph, uint32_t comparex, uint32_t cmpvalue);
/* get the compare value in Master_TIMER */
uint32_t hrtimer_mastertimer_compare_value_get(uint32_t hrtimer_periph, uint32_t comparex);
/* configure the compare value in Slave_TIMER */
void hrtimer_slavetimer_compare_value_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t comparex, uint32_t cmpvalue);
/* get the compare value in Slave_TIMER */
uint32_t hrtimer_slavetimer_compare_value_get(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t comparex);
/* configure the counter value in Master_TIMER and Slave_TIMER */
void hrtimer_timers_counter_value_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t cntvalue);
/* get the counter value in Master_TIMER and Slave_TIMER */
uint32_t hrtimer_timers_counter_value_get(uint32_t hrtimer_periph, uint32_t timer_id);
/* configure the counter auto reload value in Master_TIMER and Slave_TIMER */
void hrtimer_timers_autoreload_value_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t carlvalue);
/* get the counter auto reload value in Master_TIMER and Slave_TIMER */
uint32_t hrtimer_timers_autoreload_value_get(uint32_t hrtimer_periph, uint32_t timer_id);
/* configure the counter repetition value in Master_TIMER and Slave_TIMER */
void hrtimer_timers_repetition_value_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t replvalue);
/* get the counter repetition value in Master_TIMER and Slave_TIMER */
uint32_t hrtimer_timers_repetition_value_get(uint32_t hrtimer_periph, uint32_t timer_id);

/* external event and synchronization configure functions */
/* initialize external event filtering for Slave_TIMER configuration struct with a default value */
void hrtimer_exevfilter_struct_para_init(hrtimer_exevfilter_parameter_struct * exevfilter);
/* configure the external event filtering for Slave_TIMER (blanking, windowing) */
void hrtimer_slavetimer_exevent_filtering_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t event_id, hrtimer_exevfilter_parameter_struct* exevfilter);
/* initialize external event configuration struct with a default value */
void hrtimer_exeventcfg_struct_para_init(hrtimer_exeventcfg_parameter_struct * exevcfg);
/* configure the an external event */
void hrtimer_exevent_config(uint32_t hrtimer_periph, uint32_t event_id, hrtimer_exeventcfg_parameter_struct* exevcfg);
/* configure external event digital filter clock division */
void hrtimer_exevent_prescaler(uint32_t hrtimer_periph, uint32_t prescaler);
/* initialize external event configuration struct with a default value */
void hrtimer_exeventx_counter_struct_para_init(hrtimer_exeventcnt_parameter_struct *exevcnt);
/* configure the external event X counter */
void hrtimer_exeventx_counter_config(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_exeventcnt_parameter_struct *exevcnt);
/* reset external event X counter by software */
void hrtimer_software_reset_exeventx_counter(uint32_t hrtimer_periph, uint32_t timer_id);
/* enable external event X counter */
void hrtimer_exeventx_counter_enable(uint32_t hrtimer_periph, uint32_t timer_id);
/* disable external event X counter */
void hrtimer_exeventx_counter_disable(uint32_t hrtimer_periph, uint32_t timer_id);
/* read external event X counter value */
uint32_t hrtimer_exeventx_counter_read(uint32_t hrtimer_periph, uint32_t timer_id);
/* initialize synchronization configuration struct with a default value */
void hrtimer_synccfg_struct_para_init(hrtimer_synccfg_parameter_struct* synccfg);
/* configure the synchronization input/output of the HRTIMER */
void hrtimer_synchronization_config(uint32_t hrtimer_periph, hrtimer_synccfg_parameter_struct* synccfg);
/* initialize double channel trigger struct */
void hrtimer_double_channel_struct_para_init(hrtimer_double_trigger_parameter_struct *doubletrigger);
/* configure Slave_TIMER in double channel */
void hrtimer_double_trigger_config(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_double_trigger_parameter_struct *doubletrigger);
/* initialize roll over struct with a default value */
void hrtimer_roll_over_struct_para_init(hrtimer_roll_over_parameter_struct *rollover);
/* configure Slave_TIMER in roll over mode */
void hrtimer_roll_over_mode_config(uint32_t hrtimer_periph, uint32_t timer_id,hrtimer_roll_over_parameter_struct *rollover);

/* fault configure functions */
/* configure the synchronization input/output of the HRTIMER */
void hrtimer_faultcfg_struct_para_init(hrtimer_faultcfg_parameter_struct * faultcfg);
/* configure the fault input */
void hrtimer_fault_config(uint32_t hrtimer_periph, uint32_t fault_id, hrtimer_faultcfg_parameter_struct* faultcfg);
/* configure the fault input digital filter clock division */
void hrtimer_fault_prescaler_config(uint32_t hrtimer_periph, uint32_t prescaler);
/* fault input enable */
void hrtimer_fault_input_enable(uint32_t hrtimer_periph, uint32_t fault_id);
/* fault input disable */
void hrtimer_fault_input_disable(uint32_t hrtimer_periph, uint32_t fault_id);
/* fault input couter reset */
void hrtimer_fault_counter_reset(uint32_t hrtimer_periph, uint32_t fault_id);
/* fault input blank enable */
void hrtimer_fault_blank_enable(uint32_t hrtimer_periph, uint32_t fault_id);
/* fault input blank disable */
void hrtimer_fault_blank_disable(uint32_t hrtimer_periph, uint32_t fault_id);

