wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_hrtimer.h
/* DMA configure functions */
/* enable the Master_TIMER and Slave_TIMER DMA request */
void hrtimer_timers_dma_enable(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t dmareq);
/* disable the Master_TIMER and Slave_TIMER DMA request */
void hrtimer_timers_dma_disable(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t dmareq);
/* configure the DMA mode for Master_TIMER or Slave_TIMER */
void hrtimer_dmamode_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t regupdate);

/* bunch mode configure functions */
/* initialize bunch mode configuration struct with a default value */
void hrtimer_bunchmode_struct_para_init(hrtimer_bunchmode_parameter_struct* bmcfg);
/* configure bunch mode for the HRTIMER */
void hrtimer_bunchmode_config(uint32_t hrtimer_periph, hrtimer_bunchmode_parameter_struct* bmcfg);
/* enable the bunch mode */
void hrtimer_bunchmode_enable(uint32_t hrtimer_periph);
/* disable the bunch mode */
void hrtimer_bunchmode_disable(uint32_t hrtimer_periph);
/* get bunch mode operating flag */
uint32_t hrtimer_bunchmode_flag_get(uint32_t hrtimer_periph);
/* bunch mode started by software */
void hrtimer_bunchmode_software_start(uint32_t hrtimer_periph);

/* configure the capture functions in Slave_TIMER */
/* configure the capture source in Slave_TIMER */
void hrtimer_slavetimer_capture_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t capturex, uint64_t trgsource);
/* capture triggered by software in Slave_TIMER */
void hrtimer_slavetimer_capture_software(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t capturex);
/* read the capture value */
hrtimer_capture_value_struct hrtimer_slavetimer_capture_value_read(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t capturex);

/* ADC trigger configure functions */ 
/* initialize ADC trigger configuration struct with a default value */
void hrtimer_adctrigcfg_struct_para_init(hrtimer_adctrigcfg_parameter_struct* triggercfg);
/* configure the trigger source to ADC and the update source(0..3) */
void hrtimer_adc_trigger0_3_config(uint32_t hrtimer_periph, uint32_t trigger_id, hrtimer_adctrigcfg_parameter_struct* triggercfg);
/* configure the trigger source to ADC and the update source(4..9) */
void hrtimer_adc_trigger4_9_config(uint32_t hrtimer_periph, uint32_t trigger_id, hrtimer_adctrigcfg_parameter_struct* triggercfg);
/* configure the trigger source prescaler of ADC (0..9) */
void hrtimer_adc_prescaler_config(uint32_t hrtimer_periph, uint32_t trigger_id, uint32_t psc);

/* get the Slave_TIMER counter direction */
DirectionStatus hrtimer_slavetimer_counter_direction_get(uint32_t hrtimer_periph, uint32_t timer_id);
/* TIMER interrupt and flag functions */
/* get the Master_TIMER and Slave_TIMER flag */
FlagStatus hrtimer_timers_flag_get(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t flag);
/* clear the Master_TIMER and Slave_TIMER flag */
void hrtimer_timers_flag_clear(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t flag);
/* get the common flag */
FlagStatus hrtimer_common_flag_get(uint32_t hrtimer_periph, uint32_t flag);
/* clear the common flag */
void hrtimer_common_flag_clear(uint32_t hrtimer_periph, uint32_t flag);
/* enable the Master_TIMER and Slave_TIMER interrupt */
void hrtimer_timers_interrupt_enable(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t interrupt);
/* disable the Master_TIMER and Slave_TIMER interrupt */
void hrtimer_timers_interrupt_disable(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t interrupt);
/* clear the Master_TIMER and Slave_TIMER interrupt flag */
FlagStatus hrtimer_timers_interrupt_flag_get(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t interrupt);
/* clear the Master_TIMER and Slave_TIMER interrupt flag */
void hrtimer_timers_interrupt_flag_clear(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t interrupt);
/* enable the common interrupt */
void hrtimer_common_interrupt_enable(uint32_t hrtimer_periph, uint32_t interrupt);
/* disable common interrupt */
void hrtimer_common_interrupt_disable(uint32_t hrtimer_periph, uint32_t interrupt);
/* clear the common interrupt flag */
FlagStatus hrtimer_common_interrupt_flag_get(uint32_t hrtimer_periph, uint32_t interrupt);
/* clear the common interrupt flag */
void hrtimer_common_interrupt_flag_clear(uint32_t hrtimer_periph, uint32_t interrupt);

#endif /* GD32G5X3_HRTIMER_H */
